Repository: eurolinux-enterprise-linux-sources/man-pages-pl
Catalog: src/po/man2/reboot.2.po
Languages: pl

source: Linux Programmer's Manual
pl: Podręcznik programisty Linuksa

source: NAME
pl: NAZWA

source: reboot - reboot or enable/disable Ctrl-Alt-Del
pl: reboot - przeładowanie systemu lub włączenie/wyłączenie Ctrl-Alt-Del

source: SYNOPSIS
pl: SKŁADNIA

source: /* For libc4 and libc5 the library call and the system call are identical, and since kernel version 2.1.30 there are symbolic names LINUX_REBOOT_* for the constants and a fourth argument to the call: */
pl: /* Wywołania systemowe pod biblioteką libc4 i libc5 są identyczne, a od wersji jądra 2.1.30 istnieją symboliczne nazwy LINUX_REBOOT_* dla stałych oraz czwarty parametr wywołania: */

source: /* Under glibc some of the constants involved have gotten symbolic names RB_*, and the library call is a 1-argument wrapper around the 3-argument system call: */
pl: /* Pod glibc niektóre stałe dostały nazwy RB_*, a wywołanie biblioteczne jest jednoargumentową funkcją opakowującą trójargumentowe wywołanie systemowe: */

source: DESCRIPTION
pl: OPIS

source: The B<reboot>() call reboots the system, or enables/disables the reboot keystroke (abbreviated CAD, since the default is Ctrl-Alt-Delete; it can be changed using B<loadkeys>(1)).
pl: Wywołanie B<reboot>() przeładowuje system albo włącza lub wyłącza kombinację klawiszy odpowiedzialną za przeładowanie systemu (nazywaną w skrócie CAD od domyślnej kombinacji Ctrl-Alt-Del, którą można zmienić przy pomocy B<loadkeys>(1)).

source: This system call will fail (with B<EINVAL>) unless I<magic> equals B<LINUX_REBOOT_MAGIC1> (that is, 0xfee1dead) and I<magic2> equals B<LINUX_REBOOT_MAGIC2> (that is, 672274793). However, since 2.1.17 also B<LINUX_REBOOT_MAGIC2A> (that is, 85072278) and since 2.1.97 also B<LINUX_REBOOT_MAGIC2B> (that is, 369367448) and since 2.5.71 also B<LINUX_REBOOT_MAGIC2C> (that is, 537993216) are permitted as value for I<magic2>. (The hexadecimal values of these constants are meaningful.) The I<cmd> argument can have the following values:
pl: To wywołanie systemowe się nie powiedzie (z kodem B<EINVAL>), chyba że I<magic> wynosi B<LINUX_REBOOT_MAGIC1> (czyli 0xfee1dead) i I<magic2> jest równe B<LINUX_REBOOT_MAGIC2> (czyli 672274793). Jednakże I<magic2> może przyjmować dodatkowe wartości: od wersji 2.1.17 - B<LINUX_REBOOT_MAGIC2A> (czyli 85072278), od wersji 2.1.97 - B<LINUX_REBOOT_MAGIC2B> (czyli 369367448), a od wersji 2.5.71 również B<LINUX_REBOOT_MAGIC2C> (czyli 537993216). (Szesnastkowe wartości powyższych stałych mają znaczenie). Parametr I<cmd> może przyjmować następujące wartości:

source: (RB_DISABLE_CAD, 0). CAD is disabled. This means that the CAD keystroke will cause a B<SIGINT> signal to be sent to init (process 1), whereupon this process may decide upon a proper action (maybe: kill all processes, sync, reboot).
pl: (RB_DISABLE_CAD, 0). CAD jest wyłączony, co oznacza, że naciśnięcie kombinacji klawiszy CAD wyśle procesowi init (procesowi nr 1) sygnał B<SIGINT> i ten proces zdecyduje, jaką akcję wykonać (być może: zabicie wszystkich procesów, sync, restart).

source: (RB_ENABLE_CAD, 0x89abcdef). CAD is enabled. This means that the CAD keystroke will immediately cause the action associated with B<LINUX_REBOOT_CMD_RESTART>.
pl: (RB_ENABLE_CAD, 0x89abcdef). CAD jest włączony, co oznacza, że naciśnięcie klawiszy CAD wywoła od razu akcję skojarzoną z B<LINUX_REBOOT_CMD_RESTART>.

source: (RB_HALT_SYSTEM, 0xcdef0123; since 1.1.76). The message "System halted." is printed, and the system is halted. Control is given to the ROM monitor, if there is one. If not preceded by a B<sync>(2), data will be lost.
pl: (RB_HALT_SYSTEM, 0xcdef0123; od wersji 1.1.76). Wypisywany jest komunikat "System halted.", a system jest zatrzymywany. Kontrola jest przekazywana do monitora ROM, jeżeli istnieje. Jeżeli nie wywołano wcześniej B<sync>(2), niezapisane dane zostaną utracone.

source: B<LINUX_REBOOT_CMD_KEXEC> (since Linux 2.6.13)
pl: B<LINUX_REBOOT_CMD_KEXEC> (od wersji 2.6.13 systemu Linux)

source: Execute a kernel that has been loaded earlier with B<kexec_load>(2). This option is only available if the kernel was configured with B<CONFIG_KEXEC>.
pl: Uruchamia jądro załadowane wcześniej za pomocą B<kexec_load>(2). Opcja jest dostępna tylko wtedy, jeśli jądro zostało skonfigurowane z B<CONFIG_KEXEC>.

source: (0x4321fedc; since 2.1.30). The message "Power down." is printed, the system is stopped, and all power is removed from the system, if possible. If not preceded by a B<sync>(2), data will be lost.
pl: (0x4321fedc; od wersji 2.1.30). Wypisywany jest komunikat "Power down.", system jest zatrzymywany i jeżeli jest to możliwe, zasilanie jest odłączane. Jeżeli nie wywołano wcześniej B<sync>(2), niezapisane dane zostaną utracone.

source: (RB_AUTOBOOT, 0x1234567). The message "Restarting system." is printed, and a default restart is performed immediately. If not preceded by a B<sync>(2), data will be lost.
pl: (RB_AUTOBOOT, 0x1234567). Wypisywany jest komunikat "Restarting system.", a natychmiast po tym następuje przeładowanie systemu. Jeżeli nie wywołano wcześniej B<sync>(2), niezapisane dane zostaną utracone.

source: (0xa1b2c3d4; since 2.1.30). The message "Restarting system with command \(aq%s\(aq" is printed, and a restart (using the command string given in I<arg>) is performed immediately. If not preceded by a B<sync>(2), data will be lost.
pl: (0xa1b2c3d4; od wersji 2.1.30). Wypisywany jest komunikat "Restarting system with command \(aq%s\(aq" i natychmiast po nim system jest przeładowywany (używając polecenia podanego w argumencie I<arg>). Jeżeli nie wywołano wcześniej B<sync>(2), niezapisane dane zostaną utracone.

source: Only the superuser may call B<reboot>().
pl: Tylko administrator może wywołać funkcję B<reboot>().

source: The precise effect of the above actions depends on the architecture. For the i386 architecture, the additional argument does not do anything at present (2.1.122), but the type of reboot can be determined by kernel command-line arguments ("reboot=...") to be either warm or cold, and either hard or through the BIOS.
pl: Dokładny wynik powyższych akcji zależy od architektury komputera. Obecnie (2.1.122) dodatkowy parametr nie ma żadnego znaczenia dla architektury i386, jednakże typ restartowania systemu może być określony w argumentach linii poleceń jądra ("reboot=...") jako restart albo ciepły, albo zimny oraz albo twardy, albo przez BIOS.

source: RETURN VALUE
pl: WARTOŚĆ ZWRACANA

source: For the values of I<cmd> that stop or restart the system, a successful call to B<reboot>() does not return. For the other I<cmd> values, zero is returned on success. In all cases, -1 is returned on failure, and I<errno> is set appropriately.
pl: Jeśli podano wartość I<cmd> powodującą zatrzymanie lub zrestartowanie systemu, to B<reboot>() nie powraca. W przypadku innych wartości parametru I<cmd> zwracane jest zero, jeśli funkcja zakończyła się powodzeniem. We wszystkich przypadkach (niezależnie od wartości I<cmd>) w razie wystąpienia błędu zwracane jest -1 i zmienna I<errno> jest ustawiana na odpowiednią wartość.

source: ERRORS
pl: BŁĘDY

source: Problem with getting userspace data under B<LINUX_REBOOT_CMD_RESTART2>.
pl: Problem pobierania danych z przestrzeni użytkownika w wypadku wywołania B<LINUX_REBOOT_CMD_RESTART2>.

source: Bad magic numbers or I<cmd>.
pl: Niepoprawne liczby magiczne lub I<cmd>.

source: The calling process has insufficient privilege to call B<reboot>(); the B<CAP_SYS_BOOT> capability is required.
pl: Proces wywołujący nie ma odpowiednich uprawnień, aby wywołać B<reboot>(); wymagane jest posiadanie przywileju B<CAP_SYS_BOOT>.

source: CONFORMING TO
pl: ZGODNE Z

source: B<reboot>() is Linux-specific, and should not be used in programs intended to be portable.
pl: Funkcja B<reboot>() jest specyficzna dla Linuksa i nie powinna być używana w programach, które mają działać pod różnymi systemami.

source: SEE ALSO
pl: ZOBACZ TAKŻE

source: COLOPHON
pl: O STRONIE

source: This page is part of release 3.40 of the Linux I<man-pages> project. A description of the project, and information about reporting bugs, can be found at http://www.kernel.org/doc/man-pages/.
pl: Angielska wersja tej strony pochodzi z wydania 3.40 projektu Linux I<man-pages>. Opis projektu oraz informacje dotyczące zgłaszania błędów można znaleźć pod adresem http://www.kernel.org/doc/man-pages/.
