Repository: eurolinux-enterprise-linux-sources/man-pages-pl
Catalog: src/po/man2/select.2.po
Languages: pl

source: Linux Programmer's Manual
pl: Podręcznik programisty Linuksa

source: NAME
pl: NAZWA

source: select, pselect, FD_CLR, FD_ISSET, FD_SET, FD_ZERO - synchronous I/O multiplexing
pl: select, pselect, FD_CLR, FD_ISSET, FD_SET, FD_ZERO - synchroniczne zwielokrotnianie wejście/wyjście

source: SYNOPSIS
pl: SKŁADNIA

source: /* According to POSIX.1-2001 */
pl: /* Zgodnie z POSIX.1-2001 */

source: /* According to earlier standards */
pl: /* Zgodnie z wcześniejszymi standardami */

source: Feature Test Macro Requirements for glibc (see B<feature_test_macros>(7)):
pl: Wymagane ustawienia makr biblioteki glibc (patrz B<feature_test_macros>(7)):

source: DESCRIPTION
pl: OPIS

source: B<select>() and B<pselect>() allow a program to monitor multiple file descriptors, waiting until one or more of the file descriptors become "ready" for some class of I/O operation (e.g., input possible). A file descriptor is considered ready if it is possible to perform the corresponding I/O operation (e.g., B<read>(2)) without blocking.
pl: B<select>() i B<pselect>() umożliwiają programowi monitorowanie wielu deskryptorów plików i oczekiwanie aż jeden lub więcej deskryptorów będzie "gotowy" na wykonanie pewnej klasy operacji wejścia/wyjścia (np. możliwy odczyt). Deskryptor pliku jest uważany za gotowy, jeżeli możliwe jest wykonanie odpowiadającej operacji (np. B<read>(2)) bez blokowania.

source: The operation of B<select>() and B<pselect>() is identical, with three differences:
pl: Funkcjonalność funkcji B<select>() i B<pselect>() jest identyczna, jeśli pominąć trzy różnice:

source: B<select>() uses a timeout that is a I<struct timeval> (with seconds and microseconds), while B<pselect>() uses a I<struct timespec> (with seconds and nanoseconds).
pl: Funkcja B<select>() używa dla parametru I<timeout> typu I<struct timeval> (z sekundami i mikrosekundami), podczas gdy B<pselect>() używa typu I<struct timespec> (z sekundami i nanosekundami).

source: B<select>() may update the I<timeout> argument to indicate how much time was left. B<pselect>() does not change this argument.
pl: Funkcja B<select>() może aktualizować parametr I<timeout>, aby wskazać, jak dużo czasu minęło. Funkcja B<pselect>() nie zmienia tego parametru.

source: B<select>() has no I<sigmask> argument, and behaves as B<pselect>() called with NULL I<sigmask>.
pl: Funkcja B<select>() nie przyjmuje parametru I<sigmask> i zachowuje się, jak B<pselect>() wywołane z NULL-em przekazanym w I<sigmask>.

source: Three independent sets of file descriptors are watched. Those listed in I<readfds> will be watched to see if characters become available for reading (more precisely, to see if a read will not block; in particular, a file descriptor is also ready on end-of-file), those in I<writefds> will be watched to see if a write will not block, and those in I<exceptfds> will be watched for exceptions. On exit, the sets are modified in place to indicate which file descriptors actually changed status. Each of the three file descriptor sets may be specified as NULL if no file descriptors are to be watched for the corresponding class of events.
pl: Podglądane są trzy niezależne zestawy deskryptorów. Te, które są wymienione w I<readfds>, będą obserwowane w celu dowiedzenia się, czy nie ma tam jakichś znaków dostępnych do czytania (dokładniej, aby dowiedzieć się, czy read nie spowoduje zablokowania, deskryptor pliku jest również przygotowany na koniec pliku). Deskryptory wymienione w I<writefds> będą obserwowane w celu dowiedzenia się, czy zapis nie spowoduje blokady, a deskryptory wymienione w I<exceptfds> będą obserwowane w celu dowiedzenia się, czy nie ma na nich wyjątku. Przy wyjściu, zbiory te są modyfikowane, wskazując, które z deskryptorów zmieniły status. Każdy z tych trzech zbiorów deskryptorów plików może być przekazany jako NULL, jeżeli dla żadnego deskryptora pliku na ma potrzeby obserwowania odpowiedniej klasy zdarzeń.

source: Four macros are provided to manipulate the sets. B<FD_ZERO>() clears a set. B<FD_SET>() and B<FD_CLR>() respectively add and remove a given file descriptor from a set. B<FD_ISSET>() tests to see if a file descriptor is part of the set; this is useful after B<select>() returns.
pl: Do obsługi tych zbiorów udostępnione są cztery makra: B<FD_ZERO>() czyści zbiór; B<FD_SET>() i B<FD_CLR>() dodają lub usuwają ze zbioru podany deskryptor; B<FD_ISSET>() sprawdza, czy deskryptor jest częścią zbioru. Jest to przydatne po zakończeniu B<select>().

source: I<nfds> is the highest-numbered file descriptor in any of the three sets, plus 1.
pl: I<nfds> jest najwyższym numerem deskryptora z wszystkich trzech zbiorów plus 1.

source: I<timeout> is an upper bound on the amount of time elapsed before B<select>() returns. If both fields of the I<timeval> structure are zero, then B<select>() returns immediately. (This is useful for polling.) If I<timeout> is NULL (no timeout), B<select>() can block indefinitely.
pl: I<timeout> jest górną granicą czasu, który upłynie przed zakończeniem działania funkcji B<select>(). Jeśli oba pola struktury I<timeval> mają wartość zero, B<select>() zakończy pracę natychmiast. (Jest to przydatne w uwspólnianiu). Jeśli I<timeout> jest równe NULL (brak czasu przeterminowania), B<select>() może blokować w nieskończoność.

source: I<sigmask> is a pointer to a signal mask (see B<sigprocmask>(2)); if it is not NULL, then B<pselect>() first replaces the current signal mask by the one pointed to by I<sigmask>, then does the "select" function, and then restores the original signal mask.
pl: I<sigmask> jest wskaźnikiem do maski sygnałów (zobacz B<sigprocmask>(2)). Jeśli nie jest równe NULL, to B<pselect>() najpierw zastępuje bieżącą maskę sygnałów maską wskazywaną przez I<sigmask>, a następnie wywołuje funkcję "select", a po jej zakończeniu odtwarza oryginalną maskę sygnałów.

source: Other than the difference in the precision of the I<timeout> argument, the following B<pselect>() call:
pl: Poza różnicą w precyzji argumentu I<timeout>, następujące wywołanie B<pselect>():

source: is equivalent to I<atomically> executing the following calls:
pl: jest odpowiednikiem I<niepodzielnego> wykonania następujących funkcji:

source: The reason that B<pselect>() is needed is that if one wants to wait for either a signal or for a file descriptor to become ready, then an atomic test is needed to prevent race conditions. (Suppose the signal handler sets a global flag and returns. Then a test of this global flag followed by a call of B<select>() could hang indefinitely if the signal arrived just after the test but just before the call. By contrast, B<pselect>() allows one to first block signals, handle the signals that have come in, then call B<pselect>() with the desired I<sigmask>, avoiding the race.)
pl: Idea B<pselect>() polega na tym, że gdy chce się oczekiwać na zdarzenie będące sygnałem lub czymś na deskryptorze pliku, potrzebny jest atomowy test zapobiegający sytuacjom wyścigu. (Przypuśćmy, że procedura obsługi sygnału ustawia globalny znacznik i kończy działanie. Wówczas, test tego znacznika globalnego, po którym następuje wywołanie B<select>() może wisieć w nieskończoność, gdyby sygnał przybył natychmiast po teście, ale przed wywołaniem. Inaczej mówiąc, B<pselect> zezwala na, najpierw, zablokowanie sygnałów, następnie obsłużenie dostarczonych sygnałów, aby wreszcie wywołać B<pselect>() z pożądanym I<sigmask>, unikając wyścigu).

source: The timeout
pl: Przeterminowanie

source: The time structures involved are defined in I<E<lt>sys/time.hE<gt>> and look like
pl: Struktury czasu, których to dotyczy, są zdefiniowane w I<E<lt>sys/time.hE<gt>> i wyglądają następująco

source: struct timeval { long tv_sec; /* seconds */ long tv_usec; /* microseconds */ };
pl: struct timeval { long tv_sec; /* sekundy */ long tv_usec; /* mikrosekundy */ };

source: and
pl: i

source: struct timespec { long tv_sec; /* seconds */ long tv_nsec; /* nanoseconds */ };
pl: struct timespec { long tv_sec; /* sekundy */ long tv_nsec; /* nanosekundy */ };

source: (However, see below on the POSIX.1-2001 versions.)
pl: (Jednakże zobacz poniżej uwagi dotyczące POSIX.1-2001).

source: Some code calls B<select>() with all three sets empty, I<nfds> zero, and a non-NULL I<timeout> as a fairly portable way to sleep with subsecond precision.
pl: Niektóre programy wywołują B<select>() z wszystkimi trzema zbiorami pustymi, z I<nfds> równym zeru i niezerowym I<timeout>. Jest to całkiem przenośny sposób pauzowania z dokładnością subsekundową.

source: On Linux, B<select>() modifies I<timeout> to reflect the amount of time not slept; most other implementations do not do this. (POSIX.1-2001 permits either behavior.) This causes problems both when Linux code which reads I<timeout> is ported to other operating systems, and when code is ported to Linux that reuses a I<struct timeval> for multiple B<select>()s in a loop without reinitializing it. Consider I<timeout> to be undefined after B<select>() returns.
pl: Pod Linuksem funkcja B<select>() modyfikuje I<timeout>, aby odzwierciedlić ilość nieprzespanego czasu; większość innych implementacji tego nie robi (POSIX.1-2001 dopuszcza oba te zachowania). Powoduje to problemy, zarówno gdy kod linuksowy odczytujący I<timeout> zostanie przeniesiony na inne systemy operacyjne, jak i gdy kod przeniesiony pod Linuksa z innych systemów używa ponownie struktury I<timeval> dla wielu wywołań B<select>() w pętli, bez powtórnej inicjacji. Prosimy rozważyć traktowanie wartości I<timeout> jako niezdefiniowanej po zakończeniu funkcji B<select>().

source: RETURN VALUE
pl: WARTOŚĆ ZWRACANA

source: On success, B<select>() and B<pselect>() return the number of file descriptors contained in the three returned descriptor sets (that is, the total number of bits that are set in I<readfds>, I<writefds>, I<exceptfds>) which may be zero if the timeout expires before anything interesting happens. On error, -1 is returned, and I<errno> is set appropriately; the sets and I<timeout> become undefined, so do not rely on their contents after an error.
pl: Po pomyślnym zakończeniu, B<select>() i B<pselect>() zwracają liczbę deskryptorów w zbiorach deskryptorów (to jest całkowitę liczbę bitów ustawioną w I<readfds>, I<writefds>, I<exceptfds>). Może ona być zerowa, jeśli nastąpi przeterminowanie, nim coś ciekawego się zdarzy. Po błędzie, zwracane jest -1 i odpowiednio ustawiane I<errno>; zbiory deskryptorów i I<timeout> stają się niezdefiniowane, więc nie należy polegać na ich zawartości.

source: ERRORS
pl: BŁĘDY

source: An invalid file descriptor was given in one of the sets. (Perhaps a file descriptor that was already closed, or one on which an error has occurred.)
pl: W jednym ze zbiorów przekazano niepoprawny deskryptor pliku (Być może deskryptor ten został już zamknięty lub wystąpił na nim inny błąd).

source: A signal was caught; see B<signal>(7).
pl: Przechwycono sygnał, patrz B<signal>(7).

source: I<nfds> is negative or the value contained within I<timeout> is invalid.
pl: I<nfds> jest ujemne lub wartość I<timeout> jest nieprawidłowa.

source: unable to allocate memory for internal tables.
pl: nie można było przydzielić pamięci dla wewnętrznych tablic.

source: VERSIONS
pl: WERSJE

source: B<pselect>() was added to Linux in kernel 2.6.16. Prior to this, B<pselect>() was emulated in glibc (but see BUGS).
pl: B<pselect>() został dodany w wersji 2.6.16 jądra Linuksa. Wcześniej B<pselect>() był emulowany w glibc (patrz również BŁĘDY IMPLEMENTACJI).

source: CONFORMING TO
pl: ZGODNE Z

source: B<select>() conforms to POSIX.1-2001 and 4.4BSD (B<select>() first appeared in 4.2BSD). Generally portable to/from non-BSD systems supporting clones of the BSD socket layer (including System V variants). However, note that the System V variant typically sets the timeout variable before exit, but the BSD variant does not.
pl: B<select>() jest zgodny z POSIX.1-2001 i BSD 4.4 (funkcja B<select>() pojawiła się pierwotnie w BSD 4.2). W ogólności jest przenośne do/z systemów nie-BSD wspierających sklonowaną warstwę gniazd BSD (włączając warianty Systemu V). Jednakże należy zauważyć, że warianty Systemu V zasadniczo ustawiają zmienną timeout przed zakończeniem, ale wariant BSD tego nie robi.

source: B<pselect>() is defined in POSIX.1g, and in POSIX.1-2001.
pl: B<pselect>() jest zdefiniowany w POSIX.1g i w POSIX.1-2001.

source: NOTES
pl: UWAGI

source: An I<fd_set> is a fixed size buffer. Executing B<FD_CLR>() or B<FD_SET>() with a value of I<fd> that is negative or is equal to or larger than B<FD_SETSIZE> will result in undefined behavior. Moreover, POSIX requires I<fd> to be a valid file descriptor.
pl: I<fd_set> jest buforem o stałym rozmiarze. Wykonanie B<FD_CLR>() lub B<FD_SET>() z ujemną wartością I<fd> albo z wartością większą lub równą B<FD_SETSIZE> spowoduje zachowanie niezdefiniowane. Ponadto POSIX wymaga, by I<fd> był prawidłowym deskryptorem pliku.

source: Concerning the types involved, the classical situation is that the two fields of a I<timeval> structure are typed as I<long> (as shown above), and the structure is defined in I<E<lt>sys/time.hE<gt>>. The POSIX.1-2001 situation is
pl: Jeśli chodzi o używane typy, klasyczna sytuacja polega na tym, że oba pola struktury I<timeval> są typu I<long> (jak pokazano powyżej), a sama struktura jest zdefiniowana w I<E<lt>sys/time.hE<gt>>. W POSIX.1-2001 wygląda to następująco:

source: struct timeval { time_t tv_sec; /* seconds */ suseconds_t tv_usec; /* microseconds */ };
pl: struct timeval { time_t tv_sec; /* sekundy */ suseconds_t tv_usec; /* mikrosekundy */ };

source: where the structure is defined in I<E<lt>sys/select.hE<gt>> and the data types I<time_t> and I<suseconds_t> are defined in I<E<lt>sys/types.hE<gt>>.
pl: przy czym struktura jest zdefiniowana w I<E<lt>sys/select.hE<gt>>, a typy I<time_t> i I<suseconds_t> zdefiniowano w I<E<lt>sys/types.hE<gt>>.

source: Concerning prototypes, the classical situation is that one should include I<E<lt>time.hE<gt>> for B<select>(). The POSIX.1-2001 situation is that one should include I<E<lt>sys/select.hE<gt>> for B<select>() and B<pselect>().
pl: Jeśli chodzi o prototypy opisywanych funkcji, to klasyczna sytuacja polega na tym, że dla B<select>() należy włączyć I<E<lt>time.hE<gt>>, natomiast sytuacja z POSIX 1003.1-2001 polega na tym, że dla B<select>() i B<pselect>() należy włączyć I<E<lt>sys/select.hE<gt>>.

source: Libc4 and libc5 do not have a I<E<lt>sys/select.hE<gt>> header; under glibc 2.0 and later this header exists. Under glibc 2.0 it unconditionally gives the wrong prototype for B<pselect>(). Under glibc 2.1 to 2.2.1 it gives B<pselect>() when B<_GNU_SOURCE> is defined. Since glibc 2.2.2 the requirements are as shown in the SYNOPSIS.
pl: Libc4 i libc5 nie zawierają pliku nagłówkowego I<E<lt>sys/select.hE<gt>>; ten plik nagłówkowy istnieje w glibc 2.0 i późniejszych. W glibc 2.0 udostępnia on bezwarunkowo błędny prototyp dla B<pselect>(). W glibc 2.1 aż do 2.2.1 udostępnia on B<pselect>(), jeżeli zdefiniowane jest B<_GNU_SOURCE>. Od glibc 2.2.2 wymagania są takie, jak pokazano powyżej w rozdziale SKŁADNIA.

source: Linux Notes
pl: Uwagi linuksowe

source: The Linux B<pselect>() system call modifies its I<timeout> argument. However, the glibc wrapper function hides this behavior by using a local variable for the timeout argument that is passed to the system call. Thus, the glibc B<pselect>() function does not modify its I<timeout> argument; this is the behavior required by POSIX.1-2001.
pl: Wywołanie systemowe B<pselect>() pod Linuksem modyfikuje argument I<timeout>. Jednakże funkcja glibc ukrywa to zachowanie przez użycie dla argumentu timeout lokalnej zmiennej, która jest przekazywana do wywołania systemowego. Dlatego B<pselect>() z glibc nie zmienia argumentu I<timeout>, co jest zachowaniem wymaganym przez POSIX.1-2001.

source: BUGS
pl: BŁĘDY IMPLEMENTACJI

source: Glibc 2.0 provided a version of B<pselect>() that did not take a I<sigmask> argument.
pl: Glibc 2.0 dostarczała wersję B<pselect>(), która nie przyjmowała argumentu I<sigmask>.

source: Starting with version 2.1, glibc provided an emulation of B<pselect>() that was implemented using B<sigprocmask>(2) and B<select>(). This implementation remained vulnerable to the very race condition that B<pselect>() was designed to prevent. Modern versions of glibc use the (race-free) B<pselect>() system call on kernels where it is provided.
pl: Od wersji 2.1 glibc dostarczał emulację B<pselect>(), która była zaimplementowana przy użyciu B<sigprocmask>(2) i B<select>(). Implementacja ta pozostaje podatna na wiele błędów wyścigów (race conditions), których uniknięcie stanowiło ideę funkcji B<pselect>(). Nowsze wersje glibc używają (wolnego od wyścigów) wywołania systemowego, jeśli tylko jądro dostarcza takiego wywołania.

source: On systems that lack B<pselect>(), reliable (and more portable) signal trapping can be achieved using the self-pipe trick (where a signal handler writes a byte to a pipe whose other end is monitored by B<select>() in the main program.)
pl: W systemach, które nie mają B<pselect>() niezawodne (i bardziej przenośne) przechwytywanie sygnałów można osiągnąć, używając triku potoku do siebie (gdzie procedura obsługi sygnału zapisuje bajt do potoku, którego drugi koniec jest monitorowany przez B<select>() w głównym programie).

source: Under Linux, B<select>() may report a socket file descriptor as "ready for reading", while nevertheless a subsequent read blocks. This could for example happen when data has arrived but upon examination has wrong checksum and is discarded. There may be other circumstances in which a file descriptor is spuriously reported as ready. Thus it may be safer to use B<O_NONBLOCK> on sockets that should not block.
pl: Pod Linuksem B<select>() może raportować deskryptory plików gniazd jako "dostępne do czytania", podczas gdy kolejne czytania zostaną zablokowane. Może to się zdarzyć na przykład wtedy, gdy dane nadeszły, ale podczas sprawdzania okazało się, że mają złą sumę kontrolną i zostały odrzucone. Mogą wystąpić także inne sytuacje, w których deskryptor pliku jest błędnie raportowany jako gotowy. Dlatego używanie B<O_NONBLOCK> na gniazdach, które nie powinny się blokować może być bezpieczniejsze.

source: On Linux, B<select>() also modifies I<timeout> if the call is interrupted by a signal handler (i.e., the B<EINTR> error return). This is not permitted by POSIX.1-2001. The Linux B<pselect>() system call has the same behavior, but the glibc wrapper hides this behavior by internally copying the I<timeout> to a local variable and passing that variable to the system call.
pl: Pod Linuksem wywołanie B<select>() zmienia wartość I<timeout> także wtedy, gdy zostanie przerwane przez procedurę obsługi sygnału (tj. zostanie zwrócony błąd B<EINTR>). POSIX.1-2001 nie pozwala na takie zachowanie. Wywołanie systemowe B<pselect>() pod Linuksem zachowuje się tak samo, ale funkcja opakowująca biblioteki glibc ukrywa to zachowanie, kopiując wartość I<timeout> do wewnętrznej lokalnej zmiennej i przekazując tę zmienną do wywołania systemowego.

source: EXAMPLE
pl: PRZYKŁAD

source: /* Watch stdin (fd 0) to see when it has input. */ FD_ZERO(&rfds); FD_SET(0, &rfds);
pl: /* Obserwacja stdin (fd 0) i sprawdzanie kiedy ma wejście. */ FD_ZERO(&rfds); FD_SET(0, &rfds);

source: /* Wait up to five seconds. */ tv.tv_sec = 5; tv.tv_usec = 0;
pl: /* Czekanie nie dłużej niż 5 sekund. */ tv.tv_sec = 5; tv.tv_usec = 0;

source: retval = select(1, &rfds, NULL, NULL, &tv); /* Don't rely on the value of tv now! */
pl: retval = select(1, &rfds, NULL, NULL, &tv); /* Nie należy już polegać na wartości tv! */

source: if (retval == -1) perror("select()"); else if (retval) printf("Data is available now.\en"); /* FD_ISSET(0, &rfds) will be true. */ else printf("No data within five seconds.\en");
pl: if (retval == -1) perror("select()"); else if (retval) printf("Dane są już dostępne.\en"); /* FD_ISSET(0, &rfds) będzie prawdziwy. */ else printf("Brak danych w ciągu 5 sekund.\en");

source: SEE ALSO
pl: ZOBACZ TAKŻE

source: For a tutorial with discussion and examples, see B<select_tut>(2).
pl: Samouczek z dyskusją i przykładami znajduje się w B<select_tut>(2).

source: For vaguely related stuff, see B<accept>(2), B<connect>(2), B<poll>(2), B<read>(2), B<recv>(2), B<send>(2), B<sigprocmask>(2), B<write>(2), B<epoll>(7), B<time>(7)
pl: Rzeczy w nieokreślony sposób powiązane z tym można znaleźć w B<accept>(2), B<connect>(2), B<poll>(2), B<read>(2), B<recv>(2), B<send>(2), B<sigprocmask>(2), B<write>(2), B<epoll>(7), B<time>(7)

source: COLOPHON
pl: O STRONIE

source: This page is part of release 3.40 of the Linux I<man-pages> project. A description of the project, and information about reporting bugs, can be found at http://www.kernel.org/doc/man-pages/.
pl: Angielska wersja tej strony pochodzi z wydania 3.40 projektu Linux I<man-pages>. Opis projektu oraz informacje dotyczące zgłaszania błędów można znaleźć pod adresem http://www.kernel.org/doc/man-pages/.
