Repository: eurolinux-enterprise-linux-sources/man-pages-pl
Catalog: src/po/man2/stat.2.po
Languages: pl

source: The following program calls B<stat>() and displays selected fields in the returned I<stat> structure.
pl: Poniższy program wywołuje B<stat>() i wypisuje wybrane pola zwrócone w strukturze I<stat>:

source: if (argc != 2) { fprintf(stderr, "Usage: %s E<lt>pathnameE<gt>\en", argv[0]); exit(EXIT_FAILURE); }
pl: if (argc != 2) { fprintf(stderr, "Użycie: %s E<lt>ścieżkaE<gt>\en", argv[0]); exit(EXIT_FAILURE); }

source: printf("File type: ");
pl: printf("Typ pliku: ");

source: switch (sb.st_mode & S_IFMT) { case S_IFBLK: printf("block device\en"); break; case S_IFCHR: printf("character device\en"); break; case S_IFDIR: printf("directory\en"); break; case S_IFIFO: printf("FIFO/pipe\en"); break; case S_IFLNK: printf("symlink\en"); break; case S_IFREG: printf("regular file\en"); break; case S_IFSOCK: printf("socket\en"); break; default: printf("unknown?\en"); break; }
pl: switch (sb.st_mode & S_IFMT) { case S_IFBLK: printf("urządzenie blokowe\en"); break; case S_IFCHR: printf("urządzenie znakowe\en"); break; case S_IFDIR: printf("katalog\en"); break; case S_IFIFO: printf("FIFO/pipe\en"); break; case S_IFLNK: printf("dowiązanie symboliczne\en"); break; case S_IFREG: printf("zwykły plik\en"); break; case S_IFSOCK: printf("gniazdo\en"); break; default: printf("typ nieznany\en"); break; }

source: printf("I-node number: %ld\en", (long) sb.st_ino);
pl: printf("numer I-węzła: %ld\en", (long) sb.st_ino);

source: printf("Mode: %lo (octal)\en", (unsigned long) sb.st_mode);
pl: printf("Tryb: %lo (octal)\en", (unsigned long) sb.st_mode);

source: printf("Link count: %ld\en", (long) sb.st_nlink); printf("Ownership: UID=%ld GID=%ld\en", (long) sb.st_uid, (long) sb.st_gid);
pl: printf("Liczba dowiązań: %ld\en", (long) sb.st_nlink); printf("Właściciel: UID=%ld GID=%ld\en", (long) sb.st_uid, (long) sb.st_gid);

source: printf("Preferred I/O block size: %ld bytes\en", (long) sb.st_blksize); printf("File size: %lld bytes\en", (long long) sb.st_size); printf("Blocks allocated: %lld\en", (long long) sb.st_blocks);
pl: printf("Preferowany rozmiar bloku I/O: %ld bajtów\en", (long) sb.st_blksize); printf("Rozmiar bloku: %lld bajtów\en", (long long) sb.st_size); printf("Liczba zaalokowanych bloków: %lld\en", (long long) sb.st_blocks);

source: printf("Last status change: %s", ctime(&sb.st_ctime)); printf("Last file access: %s", ctime(&sb.st_atime)); printf("Last file modification: %s", ctime(&sb.st_mtime));
pl: printf("Ostatnia zmiana stanu: %s", ctime(&sb.st_ctime)); printf("Ostatni dostęp do pliku: %s", ctime(&sb.st_atime)); printf("Ostatnia zmiana pliku: %s", ctime(&sb.st_mtime));

source: SEE ALSO
pl: ZOBACZ TAKŻE

source: COLOPHON
pl: O STRONIE

source: This page is part of release 3.40 of the Linux I<man-pages> project. A description of the project, and information about reporting bugs, can be found at http://www.kernel.org/doc/man-pages/.
pl: Angielska wersja tej strony pochodzi z wydania 3.40 projektu Linux I<man-pages>. Opis projektu oraz informacje dotyczące zgłaszania błędów można znaleźć pod adresem http://www.kernel.org/doc/man-pages/.
