Repository: eurolinux-enterprise-linux-sources/man-pages-pl
Catalog: src/po/man2/stat.2.po
Languages: pl

source: Linux Programmer's Manual
pl: Podręcznik programisty Linuksa

source: NAME
pl: NAZWA

source: stat, fstat, lstat - get file status
pl: stat, fstat, lstat - pobieranie stanu pliku

source: SYNOPSIS
pl: SKŁADNIA

source: Feature Test Macro Requirements for glibc (see B<feature_test_macros>(7)):
pl: Wymagane ustawienia makr biblioteki glibc (patrz B<feature_test_macros>(7)):

source: || /* Since glibc 2.10: */ _POSIX_C_SOURCE\ E<gt>=\ 200112L
pl: || /* od glibc 2.10: */ _POSIX_C_SOURCE\ E<gt>=\ 200112L

source: DESCRIPTION
pl: OPIS

source: These functions return information about a file. No permissions are required on the file itself, but\(emin the case of B<stat>() and B<lstat>() \(em execute (search) permission is required on all of the directories in I<path> that lead to the file.
pl: Funkcje te zwracają informacje o podanym pliku. Do uzyskania tej informacji nie są wymagane prawa dostępu do samego pliku, lecz \(em w przypadku B<stat>() i B<lstat>() \(em konieczne są prawa wykonywania (przeszukiwania) do wszystkich katalogów na prowadzącej do pliku ścieżce I<path>.

source: B<stat>() stats the file pointed to by I<path> and fills in I<buf>.
pl: B<stat>() zwraca status pliku wskazywanego przez I<path>, ładując go do argumentu I<buf>.

source: B<lstat>() is identical to B<stat>(), except that if I<path> is a symbolic link, then the link itself is stat-ed, not the file that it refers to.
pl: B<lstat>() jest identyczny z B<stat>(), lecz w przypadku gdy I<path> jest dowiązaniem symbolicznym, to zwraca status tego dowiązania, a nie pliku, do którego się to dowiązanie odwołuje.

source: B<fstat>() is identical to B<stat>(), except that the file to be stat-ed is specified by the file descriptor I<fd>.
pl: B<fstat>() jest identyczny z B<stat>(), z tym wyjątkiem, że plik, którego status ma zwrócić, jest określony przez deskryptor pliku I<fd>.

source: All of these system calls return a I<stat> structure, which contains the following fields:
pl: Wszystkie te funkcje zwracają strukturę I<stat>, zawierającą następujące pola:

source: struct stat { dev_t st_dev; /* ID of device containing file */ ino_t st_ino; /* inode number */ mode_t st_mode; /* protection */ nlink_t st_nlink; /* number of hard links */ uid_t st_uid; /* user ID of owner */ gid_t st_gid; /* group ID of owner */ dev_t st_rdev; /* device ID (if special file) */ off_t st_size; /* total size, in bytes */ blksize_t st_blksize; /* blocksize for file system I/O */ blkcnt_t st_blocks; /* number of 512B blocks allocated */ time_t st_atime; /* time of last access */ time_t st_mtime; /* time of last modification */ time_t st_ctime; /* time of last status change */ };
pl: struct stat { dev_t st_dev; /* ID urządzenia zawierającego plik */ ino_t st_ino; /* numer i-węzła (inode) */ umode_t st_mode; /* ochrona */ nlink_t st_nlink; /* liczba dowiązań stałych (hardlinks) */ uid_t st_uid; /* ID użytkownika właściciela */ gid_t st_gid; /* ID grupy właściciela */ dev_t st_rdev; /* ID urządzenia (jeśli plik specjalny) */ off_t st_size; /* całkowity rozmiar w bajtach */ blksize_t st_blksize; /* wielkość bloku dla I/O systemu plików */ blkcnt_t st_blocks; /* liczba zaalokowanych bloków 512-bajtowych */ time_t st_atime; /* czas ostatniego dostępu */ time_t st_mtime; /* czas ostatniej modyfikacji */ time_t st_ctime; /* czas ostatniej zmiany */ };

source: The I<st_dev> field describes the device on which this file resides. (The B<major>(3) and B<minor>(3) macros may be useful to decompose the device ID in this field.)
pl: Pole I<st_dev> opisuje urządzenie, w którym plik się znajduje. (Makra B<major>(3) i B<minor>(3) mogą się przydać przy dekodowaniu identyfikatora urządzenia znajdującego się w tym polu).

source: The I<st_rdev> field describes the device that this file (inode) represents.
pl: Pole I<st_rdev> opisuje urządzenie reprezentowane przez ten plik (i-węzeł).

source: The I<st_size> field gives the size of the file (if it is a regular file or a symbolic link) in bytes. The size of a symbolic link is the length of the pathname it contains, without a terminating null byte.
pl: Pole I<st_size> podaje rozmiar pliku w bajtach (jeżeli plik jest plikiem regularnym lub dowiązaniem symbolicznym). Rozmiarem dowiązania symbolicznego jest długość ścieżki, na którą wskazuje, z wyłączeniem końcowego bajtu NULL.

source: The I<st_blocks> field indicates the number of blocks allocated to the file, 512-byte units. (This may be smaller than I<st_size>/512 when the file has holes.)
pl: Pole I<st_sblocks> określa liczbę bloków zajmowanych przez plik w jednostkach 512-bajtowych. (Liczba ta może być mniejsza niż I<st_size>/512, na przykład wtedy, gdy plik ma dziury).

source: The I<st_blksize> field gives the "preferred" blocksize for efficient file system I/O. (Writing to a file in smaller chunks may cause an inefficient read-modify-rewrite.)
pl: Pole I<st_blksize> zawiera "preferowany" rozmiar bloku dla efektywnych operacji wejścia/wyjścia dla pliku. (Zapis do pliku mniejszych kawałków może spowodować nieefektywne operacje odczyt-modyfikacja-powtórny zapis).

source: Not all of the Linux file systems implement all of the time fields. Some file system types allow mounting in such a way that file and/or directory accesses do not cause an update of the I<st_atime> field. (See I<noatime>, I<nodiratime>, and I<relatime> in B<mount>(8), and related information in B<mount>(2).) In addition, I<st_atime> is not updated if a file is opened with the B<O_NOATIME>; see B<open>(2).
pl: Nie wszystkie systemy plików pod Linuksem obsługują wszystkie pola czasu. Niektóre systemy plików można zamontować w ten sposób, że dostęp do pliku lub katalogu nie powoduje uaktualnienia pola I<st_atime>. (Patrz I<noatime>, I<nodiratime> i I<relatime> w B<mount>(8) oraz powiązane informacje w B<mount>(2)). Dodatkowo I<st_atime> nie jest aktualizowane, jeśli plik jest otwierany z flagą B<O_NOATIME>, patrz B<open>(2).

source: The field I<st_atime> is changed by file accesses, for example, by B<execve>(2), B<mknod>(2), B<pipe>(2), B<utime>(2) and B<read>(2) (of more than zero bytes). Other routines, like B<mmap>(2), may or may not update I<st_atime>.
pl: Pole I<st_atime> jest zmieniane przez każdy dostęp do pliku, np. przez B<execve>(2), B<mknod>(2), B<pipe>(2), B<utime>(2) i B<read>(2) (w razie odczytania więcej niż zera bajtów). Inne procedury, jak B<mmap>(2) mogą, ale nie muszą, zaktualizować I<st_atime>.

source: The field I<st_mtime> is changed by file modifications, for example, by B<mknod>(2), B<truncate>(2), B<utime>(2) and B<write>(2) (of more than zero bytes). Moreover, I<st_mtime> of a directory is changed by the creation or deletion of files in that directory. The I<st_mtime> field is I<not> changed for changes in owner, group, hard link count, or mode.
pl: Zazwyczaj pole I<st_mtime> jest zmieniane przez modyfikowanie pliku, np. przez B<mknod>(2), B<truncate>(2), B<utime>(2) i B<write>(2) (więcej niż zera bajtów). Co więcej I<st_mtime> katalogu jest zmieniane przy tworzeniu plików w tym katalogu lub ich usuwaniu. Pole I<st_mtime> I<nie> jest zmieniane po zmianach właściciela, grupy, liczby dowiązań (hard links) czy uprawnień.

source: The field I<st_ctime> is changed by writing or by setting inode information (i.e., owner, group, link count, mode, etc.).
pl: Pole I<st_ctime> jest zmieniane przy zapisywaniu lub ustawianiu informacji i-węzła (np. właściciela, grupy, liczby dowiązań, praw itp.).

source: The following POSIX macros are defined to check the file type using the I<st_mode> field:
pl: Zdefiniowane są następujące makra POSIX sprawdzające typ pliku przy użyciu pola I<st_mode>:

source: is it a regular file?
pl: czy plik jest regularny?

source: directory?
pl: katalog?

source: character device?
pl: urządzenie znakowe?

source: block device?
pl: urządzenie blokowe?

source: FIFO (named pipe)?
pl: kolejka FIFO (potok nazwany)?

source: symbolic link? (Not in POSIX.1-1996.)
pl: dowiązanie symboliczne? (Nie w POSIX.1-1996).

source: socket? (Not in POSIX.1-1996.)
pl: gniazdo? (Nie w POSIX.1-1996).

source: The following flags are defined for the I<st_mode> field:
pl: Dla pola I<st_mode> zdefiniowano następujące flagi:

source: S_IFMT 0170000 bit mask for the file type bit fields
pl: S_IFMT 0170000 maska bitowa dla pól bitowych typu pliku

source: S_IFSOCK 0140000 socket
pl: S_IFSOCK 0140000 gniazdo

source: S_IFLNK 0120000 symbolic link
pl: S_IFLNK 0120000 dowiązanie symboliczne (symbolic link)

source: S_IFREG 0100000 regular file
pl: S_IFREG 0100000 plik regularny

source: S_IFBLK 0060000 block device
pl: S_IFBLK 0060000 urządzenie blokowe

source: S_IFDIR 0040000 directory
pl: S_IFDIR 0040000 katalog

source: S_IFCHR 0020000 character device
pl: S_IFCHR 0020000 urządzenie znakowe

source: S_IFIFO 0010000 FIFO
pl: S_IFIFO 0010000 kolejka FIFO

source: S_ISUID 0004000 set UID bit
pl: S_ISUID 0004000 bit "set UID"

source: S_ISGID 0002000 set-group-ID bit (see below)
pl: S_ISGID 0002000 bit "set-group-ID" (patrz niżej)

source: S_ISVTX 0001000 sticky bit (see below)
pl: S_ISVTX 0001000 bit "sticky" (patrz niżej)

source: S_IRWXU 00700 mask for file owner permissions
pl: S_IRWXU 00700 maska praw dostępu właściciela pliku

source: S_IRUSR 00400 owner has read permission
pl: S_IRUSR 00400 właściciel ma prawa odczytu

source: S_IWUSR 00200 owner has write permission
pl: S_IWUSR 00200 właściciel ma prawa zapisu

source: S_IXUSR 00100 owner has execute permission
pl: S_IXUSR 00100 właściciel ma prawa wykonania

source: S_IRWXG 00070 mask for group permissions
pl: S_IRWXG 00070 maska praw dostępu dla grupy

source: S_IRGRP 00040 group has read permission
pl: S_IRGRP 00040 grupa ma prawa odczytu

source: S_IWGRP 00020 group has write permission
pl: S_IWGRP 00020 grupa ma prawa zapisu

source: S_IXGRP 00010 group has execute permission
pl: S_IXGRP 00010 grupa ma prawa wykonania

source: S_IRWXO 00007 mask for permissions for others (not in group)
pl: S_IRWXO 00007 maska uprawnień dla innych (poza grupą)

source: S_IROTH 00004 others have read permission
pl: S_IROTH 00004 inni mają prawa odczytu

source: S_IWOTH 00002 others have write permission
pl: S_IWOTH 00002 inni mają prawa zapisu

source: S_IXOTH 00001 others have execute permission
pl: S_IXOTH 00001 inni mają prawa wykonania

source: The set-group-ID bit (B<S_ISGID>) has several special uses. For a directory it indicates that BSD semantics is to be used for that directory: files created there inherit their group ID from the directory, not from the effective group ID of the creating process, and directories created there will also get the B<S_ISGID> bit set. For a file that does not have the group execution bit (B<S_IXGRP>) set, the set-group-ID bit indicates mandatory file/record locking.
pl: Bit "set-group-ID" (B<S_ISGID>) ma kilka specjalnych znaczeń. Ustawiony na katalogu oznacza, że dla tego katalogu powinna być używana semantyka BSD: pliki w nim utworzone dziedziczą identyfikator grupy z katalogu, a nie z efektywnego identyfikatora grupy procesu tworzącego plik, ponadto tworzone katalogi będą miały także ustawiony bit B<S_ISGID>. Dla pliku, który nie ma ustawionego bitu wykonywania dla grupy (B<S_IXGRP>), bit "set-group-ID" oznacza obowiązkowe blokowanie pliku/rekordu.

source: The sticky bit (B<S_ISVTX>) on a directory means that a file in that directory can be renamed or deleted only by the owner of the file, by the owner of the directory, and by a privileged process.
pl: Bit "sticky" (B<S_ISVTX>) ustawiony na katalogu oznacza, że tylko właściciel pliku lub właściciel katalogu albo proces uprzywilejowany może usunąć plik w tym katalogu lub zmienić nazwę tego pliku.

source: RETURN VALUE
pl: WARTOŚĆ ZWRACANA

source: On success, zero is returned. On error, -1 is returned, and I<errno> is set appropriately.
pl: W przypadku powodzenia zwracane jest zero. W razie wystąpienia błędu zwracane jest -1 i ustawiana jest odpowiednia wartość zmiennej I<errno>.

source: ERRORS
pl: BŁĘDY

source: Search permission is denied for one of the directories in the path prefix of I<path>. (See also B<path_resolution>(7).)
pl: Brak uprawnień do przeszukiwania jednego z katalogów w ścieżce zaczynającej I<path>. (Patrz także B<path_resolution>(7)).

source: I<fd> is bad.
pl: I<fd> jest nieprawidłowy.

source: Bad address.
pl: Niepoprawny adres.

source: Too many symbolic links encountered while traversing the path.
pl: Podczas rozwiązywania ścieżki napotkano zbyt wiele dowiązań symbolicznych.

source: I<path> is too long.
pl: Ścieżka I<path> jest zbyt długa.

source: A component of I<path> does not exist, or I<path> is an empty string.
pl: Składnik ścieżki I<path> nie istnieje lub I<path> jest pustym łańcuchem znaków.

source: Out of memory (i.e., kernel memory).
pl: Brak pamięci (tj. pamięci jądra).

source: A component of the path prefix of I<path> is not a directory.
pl: Składnik ścieżki I<path> nie jest katalogiem.

source: (B<stat>()) I<path> refers to a file whose size cannot be represented in the type I<off_t>. This can occur when an application compiled on a 32-bit platform without I<-D_FILE_OFFSET_BITS=64> calls B<stat>() on a file whose size exceeds I<(1E<lt>E<lt>31)-1> bits.
pl: (B<stat>()) I<path> odnosi się do pliku, którego rozmiar nie jest reprezentowalny w typie I<off_t>. Może się to zdarzyć, jeśli aplikacja skompilowana na platformie 32-bitowej bez I<-D_FILE_OFFSET_BITS=64> wywoła B<stat>() na pliku, którego rozmiar jest większy niż I<(1E<lt>E<lt>31)-1> bitów.

source: CONFORMING TO
pl: ZGODNE Z

source: These system calls conform to SVr4, 4.3BSD, POSIX.1-2001.
pl: Opisywane wywołanie systemowe są zgodne z SVr4, BSD 4.3, POSIX.1-2001.

source: According to POSIX.1-2001, B<lstat>() on a symbolic link need return valid information only in the I<st_size> field and the file-type component of the I<st_mode> field of the I<stat> structure. POSIX.-2008 tightens the specification, requiring B<lstat>() to return valid information in all fields except the permission bits in I<st_mode>.
pl: Według POSIX.1-2001 B<lstat>() na dowiązaniu symbolicznym powinien zwrócić poprawne wartości tylko w polu I<st_size> i w części pola I<st_mode> związanej z typem pliku struktury I<stat>. POSIX.1-2008 zaostrza tę specyfikację, wymagając od B<lstat>() zwracania poprawnych informacji we wszystkich polach z wyjątkiem bitów uprawnień w I<st_mode>.

source: Use of the I<st_blocks> and I<st_blksize> fields may be less portable. (They were introduced in BSD. The interpretation differs between systems, and possibly on a single system when NFS mounts are involved.) If you need to obtain the definition of the I<blkcnt_t> or I<blksize_t> types from I<E<lt>sys/stat.hE<gt>>, then define B<_XOPEN_SOURCE> with the value 500 or greater (before including I<any> header files).
pl: Używanie pól I<st_blocks> i I<st_blksize> może być nieprzenośne. (Były wprowadzone w BSD. Interpretacje różnią się zarówno między systemami, jak i na jednym systemie, jeśli użyty jest zdalny system plików montowany po NFS-ie). Aby uzyskać definicje typów I<blkcnt_t> i I<blksize_t> z I<E<lt>sys/stat.hE<gt>> należy zdefiniować B<_XOPEN_SOURCE> na wartość 500 lub wyższą (przed dołączeniem I<jakiegokolwiek> innego pliku nagłówkowego).

source: POSIX.1-1990 did not describe the B<S_IFMT>, B<S_IFSOCK>, B<S_IFLNK>, B<S_IFREG>, B<S_IFBLK>, B<S_IFDIR>, B<S_IFCHR>, B<S_IFIFO>, B<S_ISVTX> constants, but instead demanded the use of the macros B<S_ISDIR>(), etc. The B<S_IF*> constants are present in POSIX.1-2011 and later.
pl: POSIX.1-1990 nie opisywał stałych B<S_IFMT>, B<S_IFSOCK>, B<S_IFLNK>, B<S_IFREG>, B<S_IFBLK>, B<S_IFDIR>, B<S_IFCHR>, B<S_IFIFO>, B<S_ISVTX> , ale zamiast tego wymagał używania makr B<S_ISDIR>() itp. Stałe B<S_IF*> są obecne w POSIX.1-2011 i późniejszych.

source: The B<S_ISLNK>() and B<S_ISSOCK>() macros are not in POSIX.1-1996, but both are present in POSIX.1-2001; the former is from SVID 4, the latter from SUSv2.
pl: Makra B<S_ISLNK>() i B<S_ISSOCK>() nie są wymienione w POSIX.1-1996, ale są obecne w POSIX.1-2001; pierwsze z nich pochodzi z SVID 4, a drugie z SUSv2.

source: UNIX V7 (and later systems) had B<S_IREAD>, B<S_IWRITE>, B<S_IEXEC>, where POSIX prescribes the synonyms B<S_IRUSR>, B<S_IWUSR>, B<S_IXUSR>.
pl: Unix V7 (i kolejne systemy) miał B<S_IREAD>, B<S_IWRITE>, B<S_IEXEC>, podczas gdy POSIX nakazuje używanie synonimów B<S_IRUSR>, B<S_IWUSR>, B<S_IXUSR>.

source: Other Systems
pl: Inne systemy

source: Values that have been (or are) in use on various systems:
pl: Wartości, które były (lub nadal są) w użyciu w różnych systemach:

source: hex name ls octal description
pl: szesn. nazwa ls ósemk. opis

source: f000 S_IFMT 170000 mask for file type
pl: f000 S_IFMT 170000 maska bitowa dla pól bitowych typu pliku

source: 0000 000000 SCO out-of-service inode; BSD unknown
pl: 0000 000000 niedziałający i-węzeł w SCO, nieznany typ

source: type; SVID-v2 and XPG2 have both
pl: w BSD; SVID-v2 i XPG2 mają zarówno

source: 0 and 0100000 for ordinary file
pl: 0, jak i 0100000 dla zwykłego pliku

source: 1000 S_IFIFO p| 010000 FIFO (named pipe)
pl: 1000 S_IFIFO p| 010000 kolejka FIFO (potok nazwany)

source: 2000 S_IFCHR c 020000 character special (V7)
pl: 2000 S_IFCHR c 020000 specjalny znakowy (V7)

source: 3000 S_IFMPC 030000 multiplexed character special (V7)
pl: 3000 S_IFMPC 030000 specjalny znakowy zwielokrotniony (V7)

source: 4000 S_IFDIR d/ 040000 directory (V7)
pl: 4000 S_IFDIR d/ 040000 katalog (V7)

source: 5000 S_IFNAM 050000 XENIX named special file
pl: 5000 S_IFNAM 050000 nazwany plik specjalny XENIXa

source: with two subtypes, distinguished by
pl: z dwoma podtypami, rozróżnianymi przez

source: I<st_rdev> values 1, 2
pl: wartości 1, 2 w I<st_rdev>

source: 0001 S_INSEM s 000001 XENIX semaphore subtype of IFNAM
pl: 0001 S_INSEM s 000001 podtyp IFNAM semafora XENIX

source: 0002 S_INSHD m 000002 XENIX shared data subtype of IFNAM
pl: 0002 S_INSHD m 000002 podtyp IFNAM dzielonych danych XENIX

source: 6000 S_IFBLK b 060000 block special (V7)
pl: 6000 S_IFBLK b 060000 specjalny blokowy (V7)

source: 7000 S_IFMPB 070000 multiplexed block special (V7)
pl: 7000 S_IFMPB 070000 specjalny blokowy zwielokrotniony (V7)

source: 8000 S_IFREG - 100000 regular (V7)
pl: 8000 S_IFREG - 100000 regularny (V7)

source: 9000 S_IFCMP 110000 VxFS compressed
pl: 9000 S_IFCMP 110000 skompresowany VxFS

source: 9000 S_IFNWK n 110000 network special (HP-UX)
pl: 9000 S_IFNWK n 110000 sieciowy specjalny (HP-UX)

source: a000 S_IFLNK l@ 120000 symbolic link (BSD)
pl: a000 S_IFLNK l@ 120000 dowiązanie symboliczne (BSD)

source: b000 S_IFSHAD 130000 Solaris shadow inode for ACL
pl: b000 S_IFSHAD 130000 shadow i-węzeł ACL w Solarisie

source: (not seen by userspace)
pl: (niedostępny w przestrzeni użytkownika)

source: c000 S_IFSOCK s= 140000 socket (BSD; also "S_IFSOC" on VxFS)
pl: c000 S_IFSOCK s= 140000 gniazdo (BSD; także "S_IFSOC" na VxFS)

source: d000 S_IFDOOR DE<gt> 150000 Solaris door
pl: d000 S_IFDOOR DE<gt> 150000 drzwi Solarisa

source: e000 S_IFWHT w% 160000 BSD whiteout (not used for inode)
pl: e000 S_IFWHT w% 160000 BSD whiteout (nieużywane dla i-węzła)

source: 0200 S_ISVTX 001000 sticky bit: save swapped text even
pl: 0200 S_ISVTX 001000 "bit sticky": zachowuje wyswappowany tekst

source: after use (V7)
pl: nawet po użyciu (V7)

source: reserved (SVID-v2)
pl: zarezerwowane (SVID-v2)

source: On nondirectories: don't cache this
pl: Dla niekatalogów: nie buforuj tego

source: file (SunOS)
pl: pliku (SunOS)

source: On directories: restricted deletion
pl: Dla katalogów: flaga ograniczonego

source: flag (SVID-v4.2)
pl: usuwania (SVID-v4.2)

source: 0400 S_ISGID 002000 set-group-ID on execution (V7)
pl: 0400 S_ISGID 002000 set-group-ID podczas wykonywania (V7)

source: for directories: use BSD semantics for
pl: dla katalogów: używa semantyki BSD do

source: propagation of GID
pl: propagowania ID grupy

source: 0400 S_ENFMT 002000 System V file locking enforcement (shared
pl: 0400 S_ENFMT 002000 egzekwowanie blokowania plików SysV

source: with S_ISGID)
pl: (dzielone z S_ISGID)

source: 0800 S_ISUID 004000 set-user-ID on execution (V7)
pl: 0800 S_ISUID 004000 set-user-ID podczas wykonywania (V7)

source: 0800 S_CDF 004000 directory is a context dependent
pl: 0800 S_CDF 004000 katalog jest plikiem zależnym od kontekstu

source: file (HP-UX)
pl: (HP-UX)

source: A sticky command appeared in Version 32V AT&T UNIX.
pl: Polecenie "sticky" pojawiło się w wersji 32V systemu AT&T UNIX.

source: NOTES
pl: UWAGI

source: Since kernel 2.5.48, the I<stat> structure supports nanosecond resolution for the three file timestamp fields. Glibc exposes the nanosecond component of each field using names of the form I<st_atim.tv_nsec> if the B<_BSD_SOURCE> or B<_SVID_SOURCE> feature test macro is defined. These fields are specified in POSIX.1-2008, and, starting with version 2.12, glibc also exposes these field names if B<_POSIX_C_SOURCE> is defined with the value 200809L or greater, or B<_XOPEN_SOURCE> is defined with the value 700 or greater. If none of the aforementioned macros are defined, then the nanosecond values are exposed with names of the form I<st_atimensec>. On file systems that do not support subsecond timestamps, the nanosecond fields are returned with the value 0.
pl: Od wersji jądra 2.5.48 struktura I<stat> obsługuje nanosekundową dokładność wszystkich trzech pól czasowych. Glibc podaje nanosekundową część każdego z tych pól, używając albo I<st_atim.tv_nsec>, jeżeli zdefiniowano makro B<_BSD_SOURCE> lub B<_SVID_SOURCE>. Pola te są podane w POSIX.1-2008 i w związku z tym, począwszy od wersji 2.12 biblioteka glibc udostępnia nazwy tych pól, jeśli B<_POSIX_C_SOURCE> jest zdefiniowane na wartość 200809L lub większą, albo B<_XOPEN_SOURCE> jest zdefiniowane na wartość 700 lub większą. Jeśli nie zdefiniowano żadnego z powyższych makr, to nanosekundowe wartości są dostępne w polu I<st_atimensec>. W systemach plików, które nie obsługują takiej dokładności czasowej, wartości nanosekund w tych polach wynoszą 0.

source: On Linux, B<lstat>() will generally not trigger automounter action, whereas B<stat>() will (but see B<fstatat>(2)).
pl: Pod Linuksem, B<lstat>() nie spowoduje uruchomienia akcji automontera, natomiast B<stat>() - spowoduje (patrz jednakże B<fstatat>(2)).

source: For most files under the I</proc> directory, B<stat>() does not return the file size in the I<st_size> field; instead the field is returned with the value 0.
pl: Dla większości plików w katalogu I</proc>, B<stat>() w polu I<st_size> zwraca 0, a nie rzeczywisty rozmiar pliku.

source: Underlying kernel interface
pl: Interfejs jądra

source: Over time, increases in the size of the I<stat> structure have led to three successive versions of B<stat>(): I<sys_stat>() (slot I<__NR_oldstat>), I<sys_newstat>() (slot I<__NR_stat>), and I<sys_stat64()> (new in kernel 2.4; slot I<__NR_stat64>). The glibc B<stat>() wrapper function hides these details from applications, invoking the most recent version of the system call provided by the kernel, and repacking the returned information if required for old binaries. Similar remarks apply for B<fstat>() and B<lstat>().
pl: Z upływem czasu, zwiększanie rozmiarów struktury I<stat> doprowadziło do powstania trzech kolejnych wersji funkcji B<stat>(): I<sys_stat>() (slot I<__NR_oldstat>), I<sys_newstat>() (slot I<__NR_stat>) i I<sys_stat64()> (nowe w jądrze 2.4; slot I<__NR_stat64>). Funkcja opakowująca B<stat>() biblioteki glibc ukrywa te szczegóły przed aplikacjami, wywołując najnowszą wersję wywołania systemowego dostarczanego przez jądro i przepakowując zwracaną informację, jeśli jest to wymagane przez starsze aplikacje. Podobne uwagi odnoszą się do B<fstat>() i B<lstat>().

source: EXAMPLE
pl: PRZYKŁAD
