Repository: eurolinux-enterprise-linux-sources/man-pages-pl
Catalog: src/po/man2/write.2.po
Languages: pl

source: Linux Programmer's Manual
pl: Podręcznik programisty Linuksa

source: NAME
pl: NAZWA

source: write - write to a file descriptor
pl: write - zapisuje do deskryptora pliku

source: SYNOPSIS
pl: SKŁADNIA

source: B<ssize_t write(int >I<fd>B<, const void *>I<buf>B<, size_t >I<count>B<);>
pl: B<ssize_t write(int >I<fd>B<, const void *>I<buf>B<, size_t >I<liczba>B<);>

source: DESCRIPTION
pl: OPIS

source: B<write>() writes up to I<count> bytes from the buffer pointed I<buf> to the file referred to by the file descriptor I<fd>.
pl: B<write>() zapisuje do I<liczba> bajtów z bufora wskazanego przez I<buf> do pliku określonego przez deskryptor pliku I<fd>.

source: The number of bytes written may be less than I<count> if, for example, there is insufficient space on the underlying physical medium, or the B<RLIMIT_FSIZE> resource limit is encountered (see B<setrlimit>(2)), or the call was interrupted by a signal handler after having written less than I<count> bytes. (See also B<pipe>(7).)
pl: Liczba bajtów zapisanych może być mniejsza niż I<liczba> jeżeli, na przykład nie ma wystarczającej ilości wolnej przestrzeni na urządzeniu fizycznym, lub zasoby B<RLIMIT_FSIZE> zostały wyczerpane (patrz B<setrlimit>(2)), wywołanie zostało przerwane przez obsługę sygnału po zapisaniu mniej niż I<liczba> bajtów (spójrz również na B<pipe>(7)).

source: For a seekable file (i.e., one to which B<lseek>(2) may be applied, for example, a regular file) writing takes place at the current file offset, and the file offset is incremented by the number of bytes actually written. If the file was B<open>(2)ed with B<O_APPEND>, the file offset is first set to the end of the file before writing. The adjustment of the file offset and the write operation are performed as an atomic step.
pl: Dla przeszukiwalnych plików (np. takie na których można użyć B<lseek>(2), na przykład, pliki zwykłe (regular)) zapis ma miejsce w danym przesunięciu pliku (offsecie), i to przesunięcie jest zwiększane o ilość aktualnie zapisanych danych. Jeżeli plik został otwarty (B<open>(2)) z B<O_APPEND>, wtedy przesunięciem (offsetem) jest koniec pliku przed zapisem. Dostosowanie przesunięcia pliku i operacja zapisu są wykonywane jako nierozdzielne (atomowe).

source: POSIX requires that a B<read>(2) which can be proved to occur after a B<write>() has returned returns the new data. Note that not all file systems are POSIX conforming.
pl: Standard POSIX wymaga aby B<read> które mogą nastąpić po B<write>() zwrócił nowe dane. Pamiętaj, że nie wszystkie systemy plików są zgodne z POSIX.

source: RETURN VALUE
pl: ZWRACANA WARTOŚĆ

source: On success, the number of bytes written is returned (zero indicates nothing was written). On error, -1 is returned, and I<errno> is set appropriately.
pl: Po pomyślnym wykonaniu, zwracana jest liczba zapisanych bajtów (zero informuje, że nic nie zostało zapisane). Przy błędzie zwracane jest -1 i ustawiana jest odpowiednia wartość zmiennej I<errno>.

source: If I<count> is zero and I<fd> refers to a regular file, then B<write>() may return a failure status if one of the errors below is detected. If no errors are detected, 0 will be returned without causing any other effect. If I<count> is zero and I<fd> refers to a file other than a regular file, the results are not specified.
pl: Jeżeli I<liczba> jest zerem a I<fd> wskazuje na zwykły (regular) plik, wtedy B<write>() może zwrócić status niepowodzenia jeżeli zostanie wykryty jeden z poniższych błędów. Jeżeli nie wykryto błędów, 0 zostanie zwrócone bez żadnych innych skutków. Jeżeli I<liczba> jest zerem a I<fd> odwołuje się do pliku innego typu niż zwykły (regular), skutki nie są sprecyzowane.

source: ERRORS
pl: BŁĘDY

source: The file descriptor I<fd> refers to a file other than a socket and has been marked nonblocking (B<O_NONBLOCK>), and the write would block.
pl: Deskryptor pliku I<fd> odwołuje się do gniazda i został oznaczony jako nieblokujący (B<O_NONBLOCK>), a zapis go zablokuje.

source: B<EAGAIN> or B<EWOULDBLOCK>
pl: B<EAGAIN> lub B<EWOULDBLOCK>

source: The file descriptor I<fd> refers to a socket and has been marked nonblocking (B<O_NONBLOCK>), and the write would block. POSIX.1-2001 allows either error to be returned for this case, and does not require these constants to have the same value, so a portable application should check for both possibilities.
pl: Deskryptor pliku I<fd> odwołuje się do gniazda i został oznaczony jako nieblokujący (B<O_NONBLOCK>), a zapis go zablokuje. POSIX.1-2001 pozwala w tej sytuacji na zwrócenie błędu ale nie wymaga aby ta stała miała taką samą wartość, portowalna aplikacja powinna sprawdzać obie możliwości.

source: I<fd> is not a valid file descriptor or is not open for writing.
pl: I<fd> nie jest prawidłowym deskryptorem pliku lub nie jest otwarty do zapisu

source: I<fd> refers to a datagram socket for which a peer address has not been set using B<connect>(2).
pl: I<fd> odwołuje się do gniazda datagramowego dla którego adres nie został ustalony przy użyciu B<connect>(2).

source: I<buf> is outside your accessible address space.
pl: I<buf> jest poza dostępną przestrzenią adresową.

source: An attempt was made to write a file that exceeds the implementation-defined maximum file size or the process's file size limit, or to write at a position past the maximum allowed offset.
pl: Dokonano próby zapisu pliku który przekracza zdefiniowane w implementacji maksymalne rozmiary pliku, rozmiary pliku procesu lub zapis na pozycję wykraczającą poza maksymalne dozwolone przesunięcie (offset).

source: The call was interrupted by a signal before any data was written; see B<signal>(7).
pl: Wywołanie zostało przerwane przez sygnał przed zapisaniem jakichkolwiek danych, patrz B<signal>(7).

source: I<fd> is attached to an object which is unsuitable for writing; or the file was opened with the B<O_DIRECT> flag, and either the address specified in I<buf>, the value specified in I<count>, or the current file offset is not suitably aligned.
pl: I<fd> jest dołączony do obiektu nieodpowiedniego do zapisu, plik został otwarty z flagą B<O_DIRECT> i adres podany w I<buf> bądź wartość I<liczba> lub przesunięcie (offset) nie zostały odpowiednio dopasowane.

source: A low-level I/O error occurred while modifying the inode.
pl: Podczas modyfikacji i-węzła nastąpił niskopoziomowy błąd wejścia/wyjścia.

source: The device containing the file referred to by I<fd> has no room for the data.
pl: Urządzenie zawierające plik wskazany przez I<fd> nie ma miejsca na dane.

source: I<fd> is connected to a pipe or socket whose reading end is closed. When this happens the writing process will also receive a B<SIGPIPE> signal. (Thus, the write return value is seen only if the program catches, blocks or ignores this signal.)
pl: I<fd> jest podłączony do potoku (pipe) lub gniazda (socket) którego końcówka odczytująca jest zamknięta. Gdy taka sytuacja następuje, proces zapisujący również otrzyma sygnał B<SIGPIPE>. (Więc wartość zwracana przez B<write()> jest widziana tylko wówczas gdy program obsługuje, blokuje lub ignoruje ten sygnał).

source: Other errors may occur, depending on the object connected to I<fd>.
pl: Zależnie od obiektu podłączonego do I<fd>, mogą także zajść inne (nieopisane) błędy.

source: CONFORMING TO
pl: ZGODNOŚĆ

source: Under SVr4 a write may be interrupted and return B<EINTR> at any point, not just before any data is written.
pl: Pod SVr4 B<EINTR> jest zwracane zarówno gdy po przerwaniu wywołania, dane zostały zapisane częściowo lub przed jakimkolwiek zapisem.

source: NOTES
pl: UWAGI

source: A successful return from B<write>() does not make any guarantee that data has been committed to disk. In fact, on some buggy implementations, it does not even guarantee that space has successfully been reserved for the data. The only way to be sure is to call B<fsync>(2) after you are done writing all your data.
pl: Pomyślny powrót z B<write>() nie daje gwarancji, że dane zostały faktycznie zapisane na urządzeniu. W rzeczywistości, w niektórych wadliwych implementacjach, nie ma nawet pewności, że przestrzeń potrzebna do zapisu została pomyślnie zarezerwowana. Jedynym sposobem aby mieć pewność, że dane zostały zapisane jest wywołanie B<fsync>(2) po skończeniu zapisywania wszystkich danych przez B<write>().

source: If a B<write>() is interrupted by a signal handler before any bytes are written, then the call fails with the error B<EINTR>; if it is interrupted after at least one byte has been written, the call succeeds, and returns the number of bytes written.
pl: Jeżeli B<write>() zostanie przerwany przez obsługe sygnału przed zapisaniem jakichkolwiek danych, wtedy wywołanie nie powiedzie się i zwracany jest błąd B<EINTR>; jeżeli przerwanie nastąpi po zapisaniu co najmniej jednego bajtu danych, wywołanie powiedzie się i zwróci ilość zapisanych bajtów danych.

source: SEE ALSO
pl: ZOBACZ TAKŻE

source: COLOPHON
pl: O STRONIE

source: This page is part of release 3.40 of the Linux I<man-pages> project. A description of the project, and information about reporting bugs, can be found at http://www.kernel.org/doc/man-pages/.
pl: Angielska wersja tej strony pochodzi z wydania 3.40 projektu Linux I<man-pages>. Opis projektu oraz informacje dotyczące zgłaszania błędów można znaleźć pod adresem http://www.kernel.org/doc/man-pages/.
