Repository: eurolinux-enterprise-linux-sources/man-pages-pl
Catalog: src/po/man8/debugfs.8.po
Languages: pl

source: April 2012
pl: kwiecień 2012

source: E2fsprogs version 1.42.2
pl: E2fsprogs wersja 1.42.2

source: NAME
pl: NAZWA

source: debugfs - ext2/ext3/ext4 file system debugger
pl: debugfs - debugger systemu plików ext2/ext3/ext4

source: SYNOPSIS
pl: SKŁADNIA

source: B<debugfs> [ B<-DVwci> ] [ B<-b> blocksize ] [ B<-s> superblock ] [ B<-f> cmd_file ] [ B<-R> request ] [ B<-d> data_source_device ] [ device ]
pl: B<debugfs> [ B<-DVwci> ] [ B<-b> I<rozmiar-bloku> ] [ B<-s> I<superblok> ] [ B<-f> I<plik-komend> ] [ B<-R> I<komenda> ] [ B<-d> I<urządzenie-źródła-danych> ] [ I<urządzenie> ]

source: DESCRIPTION
pl: OPIS

source: The B<debugfs> program is an interactive file system debugger. It can be used to examine and change the state of an ext2, ext3, or ext4 file system.
pl: Program B<debugfs> jest debuggerem systemów plików. Można go używać do sprawdzenia i zmiany stanu systemu plików typu ext2, ext3 lub ext4.

source: I<device> is the special file corresponding to the device containing the file system (e.g /dev/hdXX).
pl: I<Urządzenie> jest plikiem specjalnym odpowiadającym urządzeniu zawierającemu system plików (np. /dev/hdXX).

source: OPTIONS
pl: OPCJE

source: I<-w>
pl: B<-w>

source: Specifies that the file system should be opened in read-write mode. Without this option, the file system is opened in read-only mode.
pl: Określa, że system plików powinien być otwarty w trybie odczyt-zapis (read-write). Bez tej opcji system plików otwierany jest w trybie tylko-do-odczytu (read-only).

source: I<-c>
pl: B<-c>

source: Specifies that the file system should be opened in catastrophic mode, in which the inode and group bitmaps are not read initially. This can be useful for filesystems with significant corruption, but because of this, catastrophic mode forces the filesystem to be opened read-only.
pl: Powoduje, że system plików powinien być otwarty w trybie katastrofalnym (catastrophic mode), gdzie i-węzeł oraz mapy bitowe grup nie są początkowo odczytywane. Ta opcja może być przydatna dla znacznie uszkodzonych systemów plików, lecz powoduje ona ich otwarcie w trybie tylko do odczytu.

source: I<-i>
pl: B<-i>

source: Specifies that I<device> represents an ext2 image file created by the B<e2image> program. Since the ext2 image file only contains the superblock, block group descriptor, block and inode allocation bitmaps, and the inode table, many B<debugfs> commands will not function properly. B<Warning:> no safety checks are in place, and B<debugfs> may fail in interesting ways if commands such as I<ls>, I<dump>, etc. are tried without specifying the I<data_source_device> using the I<-d> option. B<debugfs> is a debugging tool. It has rough edges!
pl: Powoduje, że I<urządzenie> reprezentuje obraz ext2 utworzony przez program B<e2image>. Ponieważ obraz ext2 zawiera jedynie superblok, deskryptor grupy bloków, blok i mapy bitowe alokacji i-węzłów oraz tablicę i-węzłów, wiele komend B<debugfs> nie będzie działało poprawnie. B<Ostrzeżenie:> nie ma żadnych bezpiecznych sprawdzeń, dlatego B<debugfs> może zawieść podczas prób wykonania takich komend jak B<ls>, B<dump>, itd. B<debugfs> jest debuggerem. Posiada szorstkie krawędzie!

source: I<-d data_source_device>
pl: B<-d> I<data_source_device>

source: Used with the I<-i> option, specifies that I<data_source_device> should be used when reading blocks not found in the ext2 image file. This includes data, directory, and indirect blocks.
pl: W użyciu z opcją B<-i>, określa I<urządzenie-źródła-danych>, które powinno być użyte do odczytu bloków nieodnalezionych w pliku obrazu ext2. Obejmuje to dane, katalogi i bloki niebezpośrednie.

source: I<-b blocksize>
pl: B<-b> I<rozmiar-bloku>

source: Forces the use of the given block size for the file system, rather than detecting the correct block size as normal.
pl: Powoduje użycie podanego rozmiaru bloku dla systemu plików zamiast, tak jak normalnie, wykrywać odpowiedni rozmiar.

source: I<-s superblock>
pl: B<-s> I<superblok>

source: Causes the file system superblock to be read from the given block number, instead of using the primary superblock (located at an offset of 1024 bytes from the beginning of the filesystem). If you specify the I<-s> option, you must also provide the blocksize of the filesystem via the I<-b> option.
pl: Powoduje odczytanie superbloku z podanego numeru bloku zamiast z domyślnego (położonego w odstępie 1024 bajtów od początku systemu plików). Jeżeli poda się opcję B<-s>, konieczne jest również podanie rozmiaru bloku systemu plików, przy użyciu opcji B<-b>.

source: I<-f cmd_file>
pl: B<-f> I<plik_komend>

source: Causes B<debugfs> to read in commands from I<cmd_file>, and execute them. When B<debugfs> is finished executing those commands, it will exit.
pl: Powoduje, że B<debugfs> odczytuje komendy z I<pliku komend> i wykonuje je. Po zakończeniu wykonywania tych komend B<debugfs> kończy pracę.

source: I<-D>
pl: B<-D>

source: Causes B<debugfs> to open the device using Direct I/O, bypassing the buffer cache. Note that some Linux devices, notably device mapper as of this writing, do not support Direct I/O.
pl: Powoduje, że B<debugfs> otwiera urządzenie używając bezpośredniego wejścia/wyjścia, pomijając bufory. Proszę zauważyć, że niektóre linuksowe urządzenia, przede wszystkim szkielet mapujący urządzenia (device mapper) nie obsługują bezpośredniego wejścia/wyjścia (w chwili pisania tego tekstu).

source: I<-R request>
pl: B<-R> I<komenda>

source: Causes B<debugfs> to execute the single command I<request>, and then exit.
pl: Powoduje wykonanie pojedynczej I<komendy> (żądania - request), i zakończenie pracy.

source: I<-V>
pl: B<-V>

source: print the version number of B<debugfs> and exit.
pl: Wyświetla wersję programu B<debugfs> i kończy pracę.

source: SPECIFYING FILES
pl: OKREŚLANIE PLIKÓW

source: Many B<debugfs> commands take a I<filespec> as an argument to specify an inode (as opposed to a pathname) in the filesystem which is currently opened by B<debugfs>. The I<filespec> argument may be specified in two forms. The first form is an inode number surrounded by angle brackets, e.g., I<E<lt>2E<gt>>. The second form is a pathname; if the pathname is prefixed by a forward slash ('/'), then it is interpreted relative to the root of the filesystem which is currently opened by B<debugfs>. If not, the pathname is interpreted relative to the current working directory as maintained by B<debugfs>. This may be modified by using the B<debugfs> command I<cd>.
pl: Wiele komend B<debugfs> pobiera I<określ-pliku> jako argument określający i-węzeł (w przeciwieństwie do nazwy ścieżkowej) systemu plików, aktualnie otwartego przez B<debugfs>. Argument I<określ-pliku> może być podany w dwu postaciach. Pierwszą jest numer i-węzła ujęty w nawiasy trójkątne, np. I<E<lt>2E<gt>>. Drugą postać stanowi nazwa ścieżkowa; jeśli jest ona poprzedzona ukośnikiem ('/'), to będzie interpretowana względem katalogu głównego (root) systemu plików aktualnie otwartego przez B<debugfs>. Jeśli nie, to interpretowana będzie względem bieżącego katalogu roboczego, jaki jest w ustawiony w danym momencie w B<debugfs>. Można go zmienić posługując się komendą B<debugfs> o nazwie B<cd>.

source: COMMANDS
pl: KOMENDY

source: This is a list of the commands which B<debugfs> supports.
pl: B<debugfs> jest debuggerem interaktywnym. Rozumie sporo komend.

source: I<blocks filespace>
pl: B<blocks> I<określ-pliku>

source: Print the blocks used by the inode I<filespec> to stdout.
pl: Wypisuje bloki używane przez i-węzeł I<określ-pliku> na standardowe wyjście.

source: I<bmap filespec logical_block>
pl: B<bmap> I<określ-pliku blok-logiczny>

source: Print the physical block number corresponding to the logical block number I<logical_block> in the inode I<filespec>.
pl: Wypisuje numer fizycznego bloku, odnoszącego się do logicznego bloku o numerze I<blok-logiczny> w i-węźle I<określ-pliku>.

source: I<cat filespec>
pl: B<cat> I<określ-pliku>

source: Dump the contents of the inode I<filespec> to stdout.
pl: Zrzuca zawartość i-węzła I<określ-pliku> na standardowe wyjście.

source: I<cd filespec>
pl: B<cd> I<określ-pliku>

source: Change the current working directory to I<filespec>.
pl: Zmienia bieżący katalog roboczy na I<określ-pliku>.

source: I<chroot filespec>
pl: B<chroot> I<określ-pliku>

source: Change the root directory to be the directory I<filespec>.
pl: Zmień katalog główny (root) na katalog I<określ-pliku>.

source: I<close [-a]>
pl: B<close> [B<-a>]

source: Close the currently open file system. If the I<-a> option is specified, write out any changes to the superblock and block group descriptors to all of the backup superblocks, not just to the master superblock.
pl: Zamyka aktualnie otwarty system plików. Jeżeli poda się opcję B<-a>, to wypisywane są wszystkie zmiany i deskryptory grup bloków w odniesieniu do wszystkich zapasowych superbloków, a nie tylko w stosunku do głównego.

source: I<clri file>
pl: B<clri> I<plik>

source: Clear the contents of the inode I<file>.
pl: Czyści zawartość i-węzła I<plik>.

source: I<dirsearch filespec filename>
pl: B<dirsearch> I<określ-pliku nazwa-pliku>

source: Search the directory I<filespec> for I<filename>.
pl: Przeszukuje katalog I<określ-pliku> szukając I<nazwy-pliku>.

source: I<dump [-p] filespec out_file>
pl: B<dump> [B<-p>] I<określ-pliku plik-wyjściowy>

source: Dump the contents of the inode I<filespec> to the output file I<out_file>. If the I<-p> option is given set the owner, group and permissions information on I<out_file> to match I<filespec>.
pl: Zrzuca zawartość i-węzła I<określ-pliku> do pliku wyjściowego I<plik-wyjściowy>. Jeśli podano opcję B<-p>, to ustawia informację o właścicielu, grupie i prawach I<plik-wyjściowy>, tak jak dla I<określ-pliku>.

source: I<dump_mmp>
pl: B<dump_mmp>

source: Display the multiple-mount protection (mmp) field values.
pl: Wyświetla wartości pola zabezpieczającego przed wielokrotnymi montowaniami (ang. multiple-mount protection - mmp).

source: I<dx_hash [-h hash_alg] [-s hash_seed] filename>
pl: B<dx_hash> [B<-h> I<algorytm-hasz>] [B<-s> I<ziarno-hasz>] I<nazwa-pliku>

source: Calculate the directory hash of I<filename>. The hash algorithm specified with I<-h> may be "legacy" "half_md4" or "tea". The hash seed specified with I<-s> must be in UUID format.
pl: Oblicza hasz katalogu I<nazwa-pliku>. Algorytmem haszowania podanym z B<-h> może być: "legacy", "half_md4" lub "tea". Ziarno haszowania podane z B<-s> musi być w formacie UUID.

source: I<dump_extents [-n] [-l] filespec>
pl: B<dump_extents> [B<-n>] [B<-l>] I<określ-pliku>

source: Dump the the extent tree of the inode I<filespec>. The I<-n> flag will cause I<dump_extents> to only display the interior nodes in the extent tree. The I<-l> flag cause I<dump_extents> to only display the leaf nodes in the extent tree.
pl: Zrzuca drzewo ekstentów i-węzła I<określ-pliku>. Flaga B<-n> spowoduje, że B<dump_extents> wyświetli jedynie wewnętrzne węzły w drzewie ekstentów. Flaga B<-l> spowoduje, że opcja wyświetli jedynie liście drzewa ekstentów.

source: (Please note that the length and range of blocks for the last extent in an interior node is an estimate by the extents library functions, and is not stored in filesystem data structures. Hence, the values displayed may not necessarily by accurate and does not indicate a problem or corruption in the file system.)
pl: Proszę zauważyć, że długość i zakres bloków do ostatniego ekstenta w węźle wewnętrznym są przybliżone przez funkcje biblioteki ekstentów i nie są przechowywane w strukturze danych systemu plików. Wyświetlane wartości nie muszą być więc dokładne i nie oznaczają wystąpienia problemu lub uszkodzenia w systemie plików.

source: I<expand_dir filespec>
pl: B<expand_dir> I<określ-pliku>

source: Expand the directory I<filespec>.
pl: Rozwija katalog I<określ-pliku>.

source: I<feature [fs_feature] [-fs_feature] ...>
pl: B<feature> [I<cecha>] [B<->I<cecha>] ...

source: Set or clear various filesystem features in the superblock. After setting or clearing any filesystem features that were requested, print the current state of the filesystem feature set.
pl: Ustawia (lub czyści - z minusem) różne cechy systemu plików w superbloku, a następnie wyświetla aktualny stan cech systemu plików.

source: I<filefrag [-dvr] filespec>
pl: B<filefrag> [B<-dvr>] I<określ-pliku>

source: Print the number of contiguous extents in I<filespec>. If I<filespec> is a directory and the I<-d> option is not specified, I<filefrag> will print the number of contiguous extents for each file in the directory. The I<-v> option will cause I<filefrag> print a tabular listing of the contiguous extents in the file. The I<-r> option will cause I<filefrag> to do a recursive listing of the directory.
pl: Wypisuje liczbę ciągłych ekstentów w I<określ-pliku>. Jeśli I<określ-pliku> jest katalogiem, a nie podano opcji B<-d>, to B<filefrag> wypisze liczbę ciągłych ekstentów każdego pliku w katalogu. Opcja B<-v> spowoduje, że B<filefrag> wypisze tabelaryczną listę ciągłych ekstentów pliku. Opcja B<-r> oznacza rekurencyjne wypisanie katalogu.

source: I<find_free_block [count [goal]]>
pl: B<find_free_block> [I<liczba> [I<cel>]]

source: Find the first I<count> free blocks, starting from I<goal> and allocate it.
pl: Znajduje pierwsze I<liczba> wolnych bloków, poczynając od I<cel> i alokuje je.

source: I<find_free_inode [dir [mode]]>
pl: B<find_free_inode> [I<katalog> [I<tryb>]]

source: Find a free inode and allocate it. If present, I<dir> specifies the inode number of the directory which the inode is to be located. The second optional argument I<mode> specifies the permissions of the new inode. (If the directory bit is set on the mode, the allocation routine will function differently.)
pl: Znajduje wolny i-węzeł i alokuje go. Jeśli go podano, to argument I<katalog> określa numer i-węzła katalogu, w którym ma zostać umieszczony i-węzeł. Drugi opcjonalny argument I<tryb> określa prawa nowego i-węzła (jeżeli w trybie mode ustawiony jest bit katalogu, to procedura alokacji będzie działać odmiennie).

source: I<freeb block [count]>
pl: B<freeb> I<blok> [I<liczba>]

source: Mark the block number I<block> as not allocated. If the optional argument I<count> is present, then I<count> blocks starting at block number I<block> will be marked as not allocated.
pl: Zaznacza blok o numerze I<blok> jako niezaalokowany. Jeżeli podany zostanie opcjonalny argument I<liczba>, to I<liczba> bloków zaczynając od bloku o numerze I<blok> zostanie zaznaczona jako niezaalokowana.

source: I<freefrag [-c chunk_kb ]>
pl: B<freefrag> [B<-c> I<część_kb> ]

source: Report free space fragmentation on the currently open file system. If the I<-c> option is specified then the filefrag command will print how many free chunks of size I<chunk_kb> can be found in the file system. The chunk size must be a power of two and be larger than the file system block size.
pl: Wypisuje fragmentację wolnej przestrzeni w aktualnie otwartym systemie plików. Jeśli poda się opcję B<-c>, to polecenie B<freefrag> wypisze liczbę wolnych części o rozmiarze I<część_kb>. Rozmiar części musi być potęgą dwójki i musi być większy od rozmiaru bloku systemu plików.

source: I<freei filespec [num]>
pl: B<freei> I<określ-pliku> [I<numer>]

source: Free the inode specified by I<filespec>. If I<num> is specified, also clear num-1 inodes after the specified inode.
pl: Zwalnia i-węzeł podany przez I<określ-pliku>. Jeśli poda się I<numer>, to czyści również numer-1 i-węzłów po podanym i-węźle.

source: I<help>
pl: B<help>

source: Print a list of commands understood by B<debugfs>.
pl: Pokazuje listę poleceń rozumianych przez B<debugfs>.

source: I<htree_dump filespec>
pl: B<htree_dump> I<określ-pliku>

source: Dump the hash-indexed directory I<filespec>, showing its tree structure.
pl: Zrzuca indeksowany za pomocą haszy katalog I<określ-pliku>, pokazując jego strukturę drzewa.

source: I<icheck block ...>
pl: B<icheck> I<blok ...>

source: Print a listing of the inodes which use the one or more blocks specified on the command line.
pl: Pokazuje zestawienie i-węzłów używających jednego lub więcej bloków określonych w wierszu poleceń.

source: I<imap filespec>
pl: B<imap> I<określ-pliku>

source: Print the location of the inode data structure (in the inode table) of the inode I<filespec>.
pl: Wypisuje położenie struktury danych i-węzła (w tabeli i-węzłów) I<określ-pliku>.

source: I<init_filesys device blocksize>
pl: B<init_filesys> I<urządzenie rozmiar-bloku>

source: Create an ext2 file system on I<device> with device size I<blocksize>. Note that this does not fully initialize all of the data structures; to do this, use the B<mke2fs>(8) program. This is just a call to the low-level library, which sets up the superblock and block descriptors.
pl: Tworzy system plików ext2 na urządzeniu I<urządzenie> z rozmiarem urządzenia I<rozmiar-bloku>. Proszę zauważyć, że nie inicjuje to w pełni wszystkich struktur danych; aby to zrobić, proszę wykorzystać program B<mke2fs>(8). Ta komenda jest tylko wywołaniem funkcji z biblioteki niskopoziomowej, która ustawia superblok i deskryptory bloków.

source: I<kill_file filespec>
pl: B<kill_file> I<określ-pliku>

source: Deallocate the inode I<filespec> and its blocks. Note that this does not remove any directory entries (if any) to this inode. See the B<rm>(1) command if you wish to unlink a file.
pl: Zwalnia (dealokuje) i-węzeł I<określ-pliku> i jego bloki. Proszę zauważyć, że nie usuwa to żadnych wpisów katalogu (jeśli istnieją) dotyczących tego i-węzła. Aby usunąć (ang. unlink) plik, proszę zapoznać się z poleceniem B<rm>(1).

source: I<lcd directory>
pl: B<lcd> I<katalog>

source: Change the current working directory of the B<debugfs> process to I<directory> on the native filesystem.
pl: Zmienia bieżący katalog roboczy B<debugfs> na I<katalog> na pierwotnym (native) systemie plików.

source: I<ln filespec dest_file>
pl: B<ln> I<określ-pliku plik-docelowy>

source: Create a link named I<dest_file> which is a link to I<filespec>. Note this does not adjust the inode reference counts.
pl: Tworzy dowiązanie o nazwie I<plik-docelowy>, do pliku I<określ-pliku>. Proszę zauważyć, że nie dostosowuje to odpowiednio licznika odwołań w i-węźle.

source: I<logdump [-acs] [-bE<lt>blockE<gt>] [-iE<lt>filespecE<gt>] [-fE<lt>journal_fileE<gt>] [output_file]>
pl: B<logdump> [B<-ac>] [B<-b>I<blok>] [B<-i>I<i-węzeł>] [B<-f>I<dziennik>] [I<plik-wyjściowy>]

source: Dump the contents of the ext3 journal. By default, the journal inode as specified in the superblock. However, this can be overridden with the I<-i> option, which uses an inode specifier to specify the journal to be used. A file containing journal data can be specified using the I<-f> option. Finally, the I<-s> option utilizes the backup information in the superblock to locate the journal.
pl: Zrzuca zawartość dziennika ext3. Domyślnie, i-węzeł dziennika jest brany z superbloku. Można przesłonić ten wybór za pomocą opcji B<-i>, która używa podanego i-węzła jako położenia dziennika. Plik zawierający dane dziennika można podać za pomocą opcji B<-f>. Opcja B<-s> wykorzystuje informacje zapasowe z superbloku, do zlokalizowania dziennika.

source: The I<-a> option causes the I<logdump> program to print the contents of all of the descriptor blocks. The I<-b> option causes I<logdump> to print all journal records that are refer to the specified block. The I<-c> option will print out the contents of all of the data blocks selected by the I<-a> and I<-b> options.
pl: Opcja B<-a> powoduje, że B<logdump> wypisuje zawartość wszystkich bloków deskryptora. Z opcją B<-b> B<logdump> wypisuje wszystkie rekordy dziennika, które odnoszą się do podanego bloku. Opcja B<-c> wypisuje zawartość wszystkich bloków z danymi, wybranymi przez opcje B<-a> i B<-b>.

source: I<ls [-l] [-d] [-p] filespec>
pl: B<ls> [B<-l>] [B<-d>] [B<-p>] I<określ-pliku>

source: Print a listing of the files in the directory I<filespec>. The I<-l> flag will list files using a more verbose format. The I<-d> flag will list deleted entries in the directory. The I<-p> flag will list the files in a format which is more easily parsable by scripts, as well as making it more clear when there are spaces or other non-printing characters at the end of filenames.
pl: Wypisuje listę plików w katalogu I<określ-pliku>. Flaga B<-l> wypisuje pliki za pomocą bardziej szczegółowego formatu. Flaga B<-d> wypisuje usunięte wpisy w katalogu. Opcja B<-p> wypisze pliki w formacie, który jest łatwiejszy do przetworzenia przez skrypty oraz łatwiej jest rozpoznać ewentualne spacje i inne znaki niedrukowalne na końcu nazw plików.

source: I<modify_inode filespec>
pl: B<modify_inode> I<określ-pliku>

source: Modify the contents of the inode structure in the inode I<filespec>.
pl: Zmienia zawartość struktury i-węzła o nazwie I<określ-pliku>.

source: I<mkdir filespec>
pl: B<mkdir> I<określ-pliku>

source: Make a directory.
pl: Tworzy katalog.

source: I<mknod filespec [p|[[c|b] major minor]]>
pl: B<mknod> I<określ-pliku> [B<p>|[[B<c>|B<b>] I<główny poboczny>]]

source: Create a special device file (a named pipe, character or block device). If a character or block device is to be made, the I<major> and I<minor> device numbers must be specified.
pl: Tworzy plik specjalny urządzenia (potoku nazwanego, urządzenia znakowego lub blokowego). Jeżeli tworzone ma być urządzenie znakowe lub blokowe, to musi zostać podany I<główny> (major) i I<poboczny> (minor) numer urządzenia.

source: I<ncheck [-c] inode_num ...>
pl: B<ncheck> [B<-c>] I<numer-i-węzła ...>

source: Take the requested list of inode numbers, and print a listing of pathnames to those inodes. The I<-c> flag will enable checking the file type information in the directory entry to make sure it matches the inode's type.
pl: Za pomocą żądanej listy numerów i-węzłów wypisuje listę nazw ścieżek do tych i-węzłów. Flaga B<-c> włącza sprawdzania informacji o typie pliku we wpisie katalogu, upewniając się, że pasuje on do typu i-węzła.

source: I<open [-w] [-e] [-f] [-i] [-c] [-D] [-b blocksize] [-s superblock] device>
pl: B<open> [B<-w>] [B<-e>] [B<-f>] [B<-i>] [B<-c>] [B<-D>] [B<-b> I<rozmiar_bloku>] [B<-s> I<superblok>] I<urządzenie>

source: Open a filesystem for editing. The I<-f> flag forces the filesystem to be opened even if there are some unknown or incompatible filesystem features which would normally prevent the filesystem from being opened. The I<-e> flag causes the filesystem to be opened in exclusive mode. The I<-b>, I<-c>, I<-i>, I<-s>, I<-w>, and I<-D> options behave the same as the command-line options to B<debugfs>.
pl: Otwiera system plików do edycji. Flaga B<-f> wymusza otwarcie systemu plików nawet wtedy gdy posiada on nieznane lub niekompatybilne cechy, które normalnie zapobiegły by otwarciu. Opcja B<-e> powoduje, że system plików jest otwarty w trybie wyłączności. Opcje B<-b> B<-c>, B<-i>, B<-s>, B<-w> i B<-D> zachowują się tak samo jak te z B<debugfs>.

source: I<punch filespec start_blk [end_blk]>
pl: B<punch> I<określ-pliku> I<blok-początkowy> [I<blok-końcowy>]

source: Delete the blocks in the inode ranging from I<start_blk> to I<end_blk>. If I<end_blk> is omitted then this command will function as a truncate command; that is, all of the blocks starting at I<start_blk> through to the end of the file will be deallocated.
pl: Usuwa bloki w i-węźle, poczynając od I<bloku-początkowego> do I<bloku-końcowego>. Jeśli nie poda się I<bloku-końcowego>, to ta komenda zadziała jak polecenie obcięcia (ang. truncate), tzn. dealokowane będą wszystkie bloki od I<bloku-początkowego>, aż do końca pliku.

source: I<pwd>
pl: B<pwd>

source: Print the current working directory.
pl: Pokazuje bieżący katalog roboczy.

source: I<quit>
pl: B<quit>

source: Quit B<debugfs>
pl: Kończy pracę B<debugfs>.
