Repository: eurolinux-enterprise-linux-sources/man-pages-pl
Catalog: src/po/man8/debugfs.8.po
Languages: pl

source: I<rdump directory destination>
pl: B<rdump> I<katalog miejsce-docelowe>

source: Recursively dump I<directory> and all its contents (including regular files, symbolic links, and other directories) into the named I<destination> which should be an existing directory on the native filesystem.
pl: Zrzuca rekurencyjnie I<katalog> wraz z zawartością (włączając plik, dowiązania symboliczne i inne katalogi) w I<miejsce_docelowe,> które powinno być istniejącym katalogiem na pierwotnym systemie plików.

source: I<rm pathname>
pl: B<rm> I<ścieżka>

source: Unlink I<pathname>. If this causes the inode pointed to by I<pathname> to have no other references, deallocate the file. This command functions as the unlink() system call.
pl: Usuwa (ang. unlink) I<ścieżkę>. Jeśli spowoduje to, że i-węzeł wskazywany przez I<ścieżka> nie będzie posiadał innych odwołań, to dealokuje plik. Komenda ta działa jak funkcja systemowa unlink().

source: I<rmdir filespec>
pl: B<rmdir> I<określ-pliku>

source: Remove the directory I<filespec>.
pl: Usuwa katalog I<określ-pliku>.

source: I<setb block [count]>
pl: B<setb> I<blok> [I<liczba>]

source: Mark the block number I<block> as allocated. If the optional argument I<count> is present, then I<count> blocks starting at block number I<block> will be marked as allocated.
pl: Zaznacza blok o numerze I<blok> jako zaalokowany. Jeżeli podany zostanie opcjonalny argument I<liczba>, to wtedy I<liczba> bloków zaczynając od bloku o numerze I<blok> zostanie zaznaczona jako zaalokowana.

source: I<set_block_group bgnum field value>
pl: B<set_super_value> I<num-dgb pole wartość>

source: Modify the block group descriptor specified by I<bgnum> so that the block group descriptor field I<field> has value I<value.>
pl: Modyfikuje deskryptor grupy bloków określony przez I<num-dgb> tak, że pole deskryptora I<pole> będzie miało wartość I<wartość>.

source: I<seti filespec [num]>
pl: B<seti> I<określ-pliku> [I<liczba>]

source: Mark inode I<filespec> as in use in the inode bitmap. If I<num> is specified, also set num-1 inodes after the specified inode.
pl: Oznacza i-węzeł I<określ-pliku>, jako użyty w mapie bitów i-węzła. Jeśli poda się I<liczbę>, to oznaczanych jest również liczba-1 i-węzłów po podanym i-węźle.

source: I<set_inode_field filespec field value>
pl: B<set_inode_field> I<określ-pliku pole wartość>

source: Modify the inode specified by I<filespec> so that the inode field I<field> has value I<value.> The list of valid inode fields which can be set via this command can be displayed by using the command: B<set_inode_field -l>
pl: Modyfikuje i-węzeł określony przez I<określ-pliku> tak, że pole I<pole> na wartość I<wartość>. Lista prawidłowych pól i-węzła, które mogą być ustawione tą komendą, może zostać wyświetlona za pomocą: B<set_inode_field -l>.

source: I<set_mmp_value field value>
pl: B<set_mmp_value> I<pole wartość>

source: Modify the multiple-mount protection (mmp) data so that the mmp field I<field> has value I<value.> The list of valid mmp fields which can be set via this command can be displayed by using the command: B<set_mmp_value -l>
pl: Modyfikuje dane ochrony przed wielokrotnym montowaniem (ang. multiple-mount protection - mmp) tak, że pole mmp I<pole>, ma wartość I<wartość>. Lista poprawnych pól mmp, które mogą być ustawione tą komendą, może zostać wyświetlona za pomocą: B<set_mmp_value -l>.

source: I<set_super_value field value>
pl: B<set_super_value> I<pole wartość>

source: Set the superblock field I<field> to I<value.> The list of valid superblock fields which can be set via this command can be displayed by using the command: B<set_super_value -l>
pl: Ustawia pole superbloku I<pole> na wartość I<wartość>. Wszystkie prawidłowe pola superbloku, które mogą być ustawione tą komendą, mogą zostać wyświetlone za pomocą: B<set_super_value -l>

source: I<show_super_stats [-h]>
pl: B<show_super_stats> [B<-h>]

source: List the contents of the super block and the block group descriptors. If the I<-h> flag is given, only print out the superblock contents.
pl: Wyświetla zawartość superbloku i deskryptorów grup bloków. Jeżeli podana jest flaga I<-h>, wypisywana jest tylko zawartość superbloku.

source: I<stat filespec>
pl: B<stat> I<określ-pliku>

source: Display the contents of the inode structure of the inode I<filespec>.
pl: Wyświetla zawartość struktury i-węzła o nazwie I<określ-pliku>.

source: I<testb block [count]>
pl: B<testb> I<blok> [I<liczba>]

source: Test if the block number I<block> is marked as allocated in the block bitmap. If the optional argument I<count> is present, then I<count> blocks starting at block number I<block> will be tested.
pl: Sprawdza, czy blok o numerze I<blok> jest zaznaczony jako zaalokowany w mapie bitowej bloku. Jeżeli podany jest opcjonalny argument I<liczba>, wtedy zostanie sprawdzona I<liczba> bloków zaczynając od bloku o numerze I<blok>.

source: I<testi filespec>
pl: B<testi> I<okresl-pliku>

source: Test if the inode I<filespec> is marked as allocated in the inode bitmap.
pl: Sprawdza, czy i-węzeł I<określ-pliku> jest zaznaczony jako zaalokowany w mapie bitowej bloku.

source: I<undel E<lt>inode numE<gt> [pathname]>
pl: B<undel> B<E<lt>>I<numer-i-węzła>B<E<gt>> [I<ścieżka>]

source: Undelete the specified inode number (which must be surrounded by angle brackets) so that it and its blocks are marked in use, and optionally link the recovered inode to the specified pathname. The B<e2fsck> command should always be run after using the B<undel> command to recover deleted files.
pl: Odwołuje usunięcie podanego numeru i-węzła (który musi być ujęty w nawiasy trójkątne), dzięki czemu jego bloki są oznaczane jako w użyciu i opcjonalnie dowiązuje odzyskany i-węzeł do podanej ścieżki. Po użyciu komendy B<undel> powinno się zawsze uruchomić B<e2fsck>, w celu odzyskania usuniętych plików.

source: Note that if you are recovering a large number of deleted files, linking the inode to a directory may require the directory to be expanded, which could allocate a block that had been used by one of the yet-to-be-undeleted files. So it is safer to undelete all of the inodes without specifying a destination pathname, and then in a separate pass, use the debugfs B<link> command to link the inode to the destination pathname, or use B<e2fsck> to check the filesystem and link all of the recovered inodes to the lost+found directory.
pl: Proszę zauważyć, że jeśli odzyskuje się dużą liczbę usuniętych plików, to dowiązywanie i-węzła do katalogu może wymagać rozwinięcia katalogu, co może spowodować alokację bloku, który był wcześniej użyty przez jeden z plików do odzyskania. Jest więc bezpieczniej odzyskać wszystkie i-węzły bez podawania ścieżki docelowej, a następnie, w kolejnym przebiegu, użyć komendy B<link>, która dowiązuje i-węzeł do ścieżki docelowej, lub użyć B<e2fsck> do sprawdzenia systemu plików i dowiązania wszystkich odzyskanych i-węzłów do katalogu lost+found.

source: I<unlink pathname>
pl: B<unlink> I<ścieżka>

source: Remove the link specified by I<pathname> to an inode. Note this does not adjust the inode reference counts.
pl: Usuwa dowiązanie do i-węzła, określone przez I<ścieżkę>. Proszę zauważyć, że nie dostosowuje to odpowiednio licznika odwołań w i-węźle.

source: I<write source_file out_file>
pl: B<write> I<plik-źródłowy plik-wyjściowy>

source: Create a file in the filesystem named I<out_file>, and copy the contents of I<source_file> into the destination file.
pl: Tworzy w systemie plików plik o nazwie I<plik-wyjściowy>, i kopiuje do niego zawartość pliku I<plik-źródłowy>.

source: ENVIRONMENT VARIABLES
pl: ZMIENNE ŚRODOWISKA

source: B<DEBUGFS_PAGER, PAGER>
pl: B<DEBUGFS_PAGER>, B<PAGER>

source: The B<debugfs> program always pipes the output of the some commands through a pager program. These commands include: I<show_super_stats>, I<list_directory>, I<show_inode_info>, I<list_deleted_inodes>, and I<htree_dump>. The specific pager can explicitly specified by the B<DEBUGFS_PAGER> environment variable, and if it is not set, by the B<PAGER> environment variable.
pl: Program B<debugfs> zawsze przesyła w potoku wyjście niektórych komend przez program stronicujący. Są to następujące komendy: B<show_super_stats>, B<list_directory>, B<show_inode_info>, B<list_deleted_inodes> i B<htree_dump>. Można podać określony program stronicujący za pomocą zmiennej środowiskowej B<DEBUGFS_PAGER> lub, jeśli nie jest ustawiona, B<PAGER>.

source: Note that since a pager is always used, the B<less>(1) pager is not particularly appropriate, since it clears the screen before displaying the output of the command and clears the output the screen when the pager is exited. Many users prefer to use the B<less>(1) pager for most purposes, which is why the B<DEBUGFS_PAGER> environment variable is available to override the more general B<PAGER> environment variable.
pl: Proszę zauważyć, że ponieważ program stronicujący jest używany zawsze, to B<less>(1) nie jest szczególnie dobry, ponieważ czyści ekran przed wyświetleniem wyjścia komendy i czyści ekran, po wyjściu programu stronicującego. Wielu użytkowników preferuje używanie B<less>(1) do większości zastosowań i jest to powód, dla którego dostępna jest zmienna środowiskowa B<DEBUGFS_PAGER>, która przesłania ogólniejszą zmienną środowiskową B<PAGER>.

source: AUTHOR
pl: AUTOR

source: B<debugfs> was written by Theodore Ts'o E<lt>tytso@mit.eduE<gt>.
pl: B<debugfs> zostało napisane przez Theodore Ts'o E<lt>tytso@mit.eduE<gt>.

source: SEE ALSO
pl: ZOBACZ TAKŻE
