Repository: eurolinux-enterprise-linux-sources/man-pages-pl
Catalog: src/po/man8/fdisk.8.po
Languages: pl

source: June 2010
pl: czerwiec 2010

source: System Administration
pl: Administracja systemem

source: NAME
pl: NAZWA

source: fdisk - manipulate disk partition table
pl: fdisk - obsługa dyskowej tablicy partycji

source: SYNOPSIS
pl: SKŁADNIA

source: B<fdisk> [B<-uc>] [B<-b> I<sectorsize>] [B<-C> I<cyls>] [B<-H> I<heads>] [B<-S> I<sects>] I<device>
pl: B<fdisk> [B<-uc>] [B<-b> I<rozmiar-sektora>] [B<-C> I<cylindry>] [B<-H> I<głowice>] [B<-S> I<sektory>] I<urządzenie>

source: B<fdisk -l> [B<-u>] [I<device>...]
pl: B<fdisk -l> [B<-u>] [I<urządzenie>...]

source: B<fdisk -s> I<partition>...
pl: B<fdisk -s> I<partycja>...

source: DESCRIPTION
pl: OPIS

source: B<fdisk> (in the first form of invocation) is a menu-driven program for creation and manipulation of partition tables. It understands DOS-type partition tables and BSD- or SUN-type disklabels.
pl: B<fdisk> (w pierwszej wersji jego wywołania) to obsługiwany z pomocą menu program do tworzenia i zmieniania tablicy partycji dysku twardego. Rozumie partycje DOS-owe oraz etykiety dysków typu BSD lub SUN-a.

source: B<fdisk> does not understand GUID partition tables (GPTs) and it is not designed for large partitions. In these cases, use the more advanced GNU B<parted>(8).
pl: B<fdisk> nie potrafi obsłużyć tablic partycji GUID (GPT) i nie jest przeznaczony do obsługi dużych partycji. W tych przypadkach, proszę użyć bardziej zaawansowanego GNU B<parted>(8).

source: B<fdisk> does not use DOS-compatible mode and cylinders as display units by default. The old deprecated DOS behavior can be enabled with the '-c=dos -u=cylinders' command-line options.
pl: B<fdisk> nie używa trybu kompatybilnego z DOS-em i wyświetlania cylindrów jako jednostek domyślnych. To przestarzałe zachowanie DOS-a można włączyć opcją wiersza poleceń "-c=dos -u=cylinders".

source: Hard disks can be divided into one or more logical disks called I<partitions>. This division is recorded in the I<partition table>, found in sector 0 of the disk. (In the BSD world one talks about `disk slices' and a `disklabel'.)
pl: Dyski twarde mogą być podzielone na jeden lub więcej logicznych dysków zwanych I<partycjami>. Podział ten jest zapisany w I<tablicy partycji> znajdującej się w sektorze 0 dysku (w świecie BSD mówi się o tzw. plastrach dyskowych "disk slice" i etykietach dysku "disklabel).

source: Linux needs at least one partition, namely for its root file system. It can use swap files and/or swap partitions, but the latter are more efficient. So, usually one will want a second Linux partition dedicated as swap partition. On Intel-compatible hardware, the BIOS that boots the system can often only access the first 1024 cylinders of the disk. For this reason people with large disks often create a third partition, just a few MB large, typically mounted on I</boot>, to store the kernel image and a few auxiliary files needed at boot time, so as to make sure that this stuff is accessible to the BIOS. There may be reasons of security, ease of administration and backup, or testing, to use more than the minimum number of partitions.
pl: Linux potrzebuje przynajmniej jednej partycji \(em mianowicie partycji przeznaczonej na główny system plików. Może używać plików i/lub partycji wymiany, ale te drugie są bardziej wydajne. Tak więc, zazwyczaj używana jest druga partycja linuksowa przeznaczona na partycję wymiany (tzw. swap). Na komputerach o architekturze zgodnej z Intelem, BIOS, używany do uruchamiania systemu, często ma dostęp tylko do pierwszych 1024 cylindrów dysku. Z tego powodu osoby mające duże dyski często tworzą trzecią partycję o rozmiarze kilku MB, zazwyczaj montowaną w katalogu I</boot>, która przechowuje obraz jądra i kilka dodatkowych plików potrzebnych w czasie uruchamiania systemu, żeby mieć pewność, że te rzeczy są dostępne dla BIOS-u. Mogą być różne przyczyny, związane z bezpieczeństwem, ułatwieniem administrowania i tworzenia kopii zapasowych lub testowaniem, żeby używać większej liczby partycji niż to minimum.

source: DEVICES
pl: URZĄDZENIA

source: The I<device> is usually /dev/sda, /dev/sdb or so. A device name refers to the entire disk. Old systems without libata (a library used inside the Linux kernel to support ATA host controllers and devices) make a difference between IDE and SCSI disks. In such cases the device name will be /dev/hd* (IDE) or /dev/sd* (SCSI).
pl: I<Urządzenie> jest to z reguły /dev/sda, /dev/sdb itp. Nazwy urządzeń odnoszą się do całego dysku. Stare systemy bez libata (biblioteki używanej wewnątrz jądra Linux do obsługi kontrolerów i urządzeń ATA) rozróżniają dyski IDE i SCSI. W takich przypadkach nazwami urządzeń będą /dev/hd* (IDE) lub /dev/sd* (SCSI).

source: The I<partition> is a device name followed by a partition number. For example, /dev/sda1 is the first partition on the first hard disk in the system. See also Linux kernel documentation (the Documentation/devices.txt file).
pl: I<Partycja> to nazwa urządzenia, za którą następuje numer partycji. Na przykład, /dev/sda1 jest pierwszą partycją pierwszego dysku twardego w systemie. Proszę również zapoznać się z dokumentacją jądra Linux (plik Documentation/devices.txt).

source: DISK LABELS
pl: ETYKIETY DYSKU

source: A BSD/SUN-type disklabel can describe 8 partitions, the third of which should be a `whole disk' partition. Do not start a partition that actually uses its first sector (like a swap partition) at cylinder 0, since that will destroy the disklabel.
pl: Etykieta dysku typu BSD/SUN może opisywać 8 partycji, z których trzecia powinna być specjalną partycją oznaczającą cały dysk. Partycji, która używa swojego pierwszego sektora (jak na przykład partycja wymiany) nie należy umieszczać w cylindrze 0, ponieważ zniszczy to etykietę dysku.

source: An IRIX/SGI-type disklabel can describe 16 partitions, the eleventh of which should be an entire `volume' partition, while the ninth should be labeled `volume header'. The volume header will also cover the partition table, i.e., it starts at block zero and extends by default over five cylinders. The remaining space in the volume header may be used by header directory entries. No partitions may overlap with the volume header. Also do not change its type or make some filesystem on it, since you will lose the partition table. Use this type of label only when working with Linux on IRIX/SGI machines or IRIX/SGI disks under Linux.
pl: Etykieta dysku typu IRIX/SGI może opisywać 16 partycji, z których jedenasta powinna być partycją całego "woluminu", natomiast dziewiąta powinna być tzw. "nagłówkiem woluminu". Nagłówek woluminu także pokrywa całą tablicę partycji, tzn. zaczyna się w bloku zerowym i domyślnie ciągnie się przez pięć cylindrów. Pozostałe miejsce w nagłówku woluminu może być użyte przez wpisy głównych katalogów. Żadna partycja nie może nachodzić na nagłówek woluminu. Także, nie należy zmieniać typu nagłówka woluminu, ani tworzyć na nim systemu plików, ponieważ spowoduje to utratę tablicy partycji. Proszę używać tego typu etykiety dysku tylko podczas pracy z Linuksem na komputerach IRIX/SGI lub podczas pracy z dyskami IRIX/SGI pod Linuksem.

source: A DOS-type partition table can describe an unlimited number of partitions. In sector 0 there is room for the description of 4 partitions (called `primary'). One of these may be an extended partition; this is a box holding logical partitions, with descriptors found in a linked list of sectors, each preceding the corresponding logical partitions. The four primary partitions, present or not, get numbers 1-4. Logical partitions start numbering from 5.
pl: Tablica partycji typu DOS może opisać nieograniczoną liczbę partycji. W sektorze 0 jest miejsce na opis 4 partycji (zwanych podstawowymi \(em `primary'). Jedna z nich może być partycją rozszerzoną; jest ona jakby pudełkiem zawierającym partycje logiczne, których deskryptory można znaleźć w wiązanej liście sektorów, z których każdy poprzedza odpowiadającą partycję logiczną. Cztery podstawowe partycje, niezależnie od tego czy są obecne, czy nie, otrzymują numery od 1 do 4. Numery partycji logicznych zaczynają się od 5.

source: In a DOS-type partition table the starting offset and the size of each partition is stored in two ways: as an absolute number of sectors (given in 32 bits), and as a Cylinders/Heads/Sectors triple (given in 10+8+6 bits). The former is OK -- with 512-byte sectors this will work up to 2 TB. The latter has two problems. First, these C/H/S fields can be filled only when the number of heads and the number of sectors per track are known. And second, even if we know what these numbers should be, the 24 bits that are available do not suffice. DOS uses C/H/S only, Windows uses both, Linux never uses C/H/S.
pl: W tablicy partycji typu DOS początkowe przesunięcie (`offset') i rozmiar każdej partycji przechowywany jest na dwa sposoby: jako bezwzględna liczba sektorów (zapisywana na 32 bitach) i jako trójka Cylindry/Głowice/Sektory (Cylinders/Heads/Sectors) (zapisywana na 10+8+6 bitach). Pierwszy zapis jest w porządku - przy 512-bajtowych sektorach będzie działał aż do 2 TB. W przypadku drugiego zapisu występują dwa małe problemy. Przede wszystkim pola C/H/S mogą być wypełnione tylko wtedy, gdy znana jest liczba głowic oraz liczba sektorów na ścieżce. Po drugie, nawet jeżeli te liczby są znane, to te 24 bity, które są dostępne, nie wystarczają. DOS używa tylko C/H/S, Windows \(em obu, a Linux nigdy nie używa C/H/S.

source: If possible, B<fdisk> will obtain the disk geometry automatically. This is not necessarily the physical disk geometry (indeed, modern disks do not really have anything like a physical geometry, certainly not something that can be described in simplistic Cylinders/Heads/Sectors form), but it is the disk geometry that MS-DOS uses for the partition table.
pl: Jeśli jest to możliwe, B<fdisk> automatycznie uzyska informacje o geometrii dysku. Niekoniecznie musi to być fizyczna geometria dysku (co więcej, nowoczesne dyski w rzeczywistości nie mają czegoś takiego jak fizyczna geometria, a w każdym razie nie mają niczego, co mogłoby być opisane w prostej postaci cylindry/głowice/sektory), lecz geometria, której używa MS-DOS dla tablicy partycji.

source: Usually all goes well by default, and there are no problems if Linux is the only system on the disk. However, if the disk has to be shared with other operating systems, it is often a good idea to let an fdisk from another operating system make at least one partition. When Linux boots it looks at the partition table, and tries to deduce what (fake) geometry is required for good cooperation with other systems.
pl: Zazwyczaj wszystko idzie dobrze i nie ma żadnych problemów, jeżeli Linux jest jedynym systemem na dysku. Jednakże, jeśli dysk będzie dzielony z innymi systemami operacyjnymi, to dobrym pomysłem jest utworzenie co najmniej jednej partycji fdiskiem pochodzącym z innego systemu operacyjnego. Linux, podczas uruchamiania, przegląda tablicę partycji i stara się wywnioskować, jaka (fałszywa) geometria dysku jest wymagana, żeby mógł dobrze współpracować z innymi systemami.

source: Whenever a partition table is printed out, a consistency check is performed on the partition table entries. This check verifies that the physical and logical start and end points are identical, and that each partition starts and ends on a cylinder boundary (except for the first partition).
pl: Gdy wypisywana jest tablica partycji, dokonywane jest sprawdzenie konsystencji wpisów tablicy. Sprawdzane jest, czy fizyczne i logiczne punkty startowe i końcowe są takie same, oraz czy partycja rozpoczyna się i kończy w granicach cylindrów (poza pierwszą partycją).

source: Some versions of MS-DOS create a first partition which does not begin on a cylinder boundary, but on sector 2 of the first cylinder. Partitions beginning in cylinder 1 cannot begin on a cylinder boundary, but this is unlikely to cause difficulty unless you have OS/2 on your machine.
pl: Niektóre wersje MS-DOS tworzą pierwszą partycję, która nie rozpoczyna się na granicy cylindra, lecz na 2 sektorze pierwszego cylindra. Partycje rozpoczynające się na cylindrze 1 nie mogą rozpoczynać się na granicy cylindra, lecz raczej nie powinno to sprawiać problemów, chyba że używany jest OS/2.

source: A sync() and an ioctl(BLKRRPART) (reread partition table from disk) are performed before exiting when the partition table has been updated. Long ago it used to be necessary to reboot after the use of fdisk. I do not think this is the case anymore -- indeed, rebooting too quickly might cause loss of not-yet-written data. Note that both the kernel and the disk hardware may buffer data.
pl: Funkcje sync() i ioctl(BLKRRPART) są wywoływane (o ile zmieniono tablicę partycji) przed wyjściem, kiedy tablica partycji zostanie już zaktualizowana. Dawno temu było konieczne przeładowanie systemu (reboot) po użyciu fdiska. Teraz nie powinno być takiej potrzeby; co więcej, zbyt szybkie przeładowanie systemu może spowodować utratę jeszcze nie zapisanych danych. Proszę zauważyć, że zarówno jądro, jak i dysk mogą buforować dane.

source: DOS 6.x WARNING
pl: OSTRZEŻENIE DOS 6.x

source: The DOS 6.x FORMAT command looks for some information in the first sector of the data area of the partition, and treats this information as more reliable than the information in the partition table. DOS FORMAT expects DOS FDISK to clear the first 512 bytes of the data area of a partition whenever a size change occurs. DOS FORMAT will look at this extra information even if the /U flag is given -- we consider this a bug in DOS FORMAT and DOS FDISK.
pl: Komenda FORMAT z DOS 6.x szuka informacji w pierwszym sektorze obszaru danych partycji i traktuje je jako godniejsze zaufania niż informacje z tablicy partycji. Dosowy FORMAT oczekuje od dosowego FDISK-a, że ten wyczyści pierwsze 512 bajtów obszarów danych przy każdej zmianie rozmiarów. Dosowy FORMAT zajrzy do tych dodatkowych danych nawet z flagą /U -- uważamy to za błąd tych programów.

source: The bottom line is that if you use cfdisk or fdisk to change the size of a DOS partition table entry, then you must also use B<dd> to zero the first 512 bytes of that partition before using DOS FORMAT to format the partition. For example, if you were using cfdisk to make a DOS partition table entry for /dev/sda1, then (after exiting fdisk or cfdisk and rebooting Linux so that the partition table information is valid) you would use the command "dd if=/dev/zero of=/dev/sda1 bs=512 count=1" to zero the first 512 bytes of the partition.
pl: Tak więc używając cfdiska lub fdiska do zmiany rozmiaru partycji dosowej, należy też użyć B<dd> do wyzerowania pierwszych 512 bajtów tej partycji przed użyciem dosowego FORMAT. Na przykład, po utworzeniu dosowej partycji /dev/sda1programem cfdisk (po wyjściu z fdiska lub cfdiska i przeładowaniu Linuksa, dzięki czemu informacje o tablicy partycji będą poprawne), powinno się wykonać polecenie "dd if=/dev/zero of=/dev/hda1 bs=512 count=1", które zeruje pierwszych 512 bajtów partycji.

source: B<BE EXTREMELY CAREFUL> if you use the B<dd> command, since a small typo can make all of the data on your disk useless.
pl: B<BĄDŹ NIEWYOBRAŻALNIE OSTROŻNY> przy używaniu komendy B<dd>, gdyż mała pomyłka może spowodować zniszczenie wszystkich danych z dysku.

source: For best results, you should always use an OS-specific partition table program. For example, you should make DOS partitions with the DOS FDISK program and Linux partitions with the Linux fdisk or Linux cfdisk program.
pl: Dla najlepszych wyników, zawsze powinno się używać fdiska specyficznego dla danego systemowi operacyjnemu. Na przykład, partycje dosowe powinno się tworzyć dosowym FDISK-iem, a linuksowe \(em linuksowym fdiskiem lub cfdiskiem.

source: OPTIONS
pl: OPCJE

source: B<-b >I<sectorsize>
pl: B<-b >I<rozmiar-sektora>

source: Specify the sector size of the disk. Valid values are 512, 1024, 2048 or 4096. (Recent kernels know the sector size. Use this only on old kernels or to override the kernel's ideas.) Since util-linux-2.17, fdisk differentiates between logical and physical sector size. This option changes both sector sizes to I<sectorsize>B<.>
pl: Określa rozmiar sektora dysku. Możliwe wartości są następująca: 512, 1024, 2048 lub 4096. (Ostatnie jądra znają rozmiar sektora. Proszę używać tej opcji tylko dla starych jąder lub w celu nadpisania wartości podanej przez jądro). Od util-linux-2.17 fdisk rozróżnia logiczny i fizyczny rozmiar sektora. Ta opcja zmienia obie wartości rozmiarów sektora na I<rozmiar-sektora>.

source: B<-c>I<[=mode]>
pl: B<-c>[I<=tryb>]

source: Specify the compatiblity mode, 'dos' or 'nondos'. The default is non-DOS mode. For backward compatibility, it is possible to use the option without the E<lt>modeE<gt> argument -- then the default is used. Note that the optional E<lt>modeE<gt> argument cannot be separated from the -c option by a space, the correct form is for example '-c=dos'.
pl: Określa tryb kompatybilności, "dos" lub "nondos". Domyślnym trybem jest niedosowy. Aby zachować kompatybilność wsteczną, możliwe jest użycie tej opcji bez argumentu E<lt>trybE<gt> - używana jest wówczas wartość domyślna. Proszę zauważyć, że opcjonalny argument E<lt>trybE<gt> nie może być oddzielony od opcji -c spacją, poprawną formą jest np. "-c=dos".

source: B<-C >I<cyls>
pl: B<-C >I<cylindry>

source: Specify the number of cylinders of the disk. I have no idea why anybody would want to do so.
pl: Określa liczbę cylindrów dysku. Prawdopodobnie nie ma osoby, która miałaby powód aby używać tej opcji.

source: B<-H >I<heads>
pl: B<-H >I<głowice>

source: Specify the number of heads of the disk. (Not the physical number, of course, but the number used for partition tables.) Reasonable values are 255 and 16.
pl: Określa liczbę głowic dysku (oczywiście nie ich fizyczną liczbę, lecz liczbę używaną do tablic partycji). Rozsądnymi wartościami są 255 i 16.

source: B<-S >I<sects>
pl: B<-S >I<sektory>

source: Specify the number of sectors per track of the disk. (Not the physical number, of course, but the number used for partition tables.) A reasonable value is 63.
pl: Określa liczbę sektorów dysku na ścieżkę (oczywiście nie ich fizyczną liczbę, lecz liczbę używaną do tablic partycji). Rozsądną wartością jest 63.

source: Print help and then exit.
pl: Wyświetla pomoc i kończy pracę.

source: List the partition tables for the specified devices and then exit. If no devices are given, those mentioned in I</proc/partitions> (if that exists) are used.
pl: Wypisuje tablice partycji dla podanych urządzeń i kończy działanie. Jeżeli nie podano żadnych urządzeń, to używane są urządzenia wymienione w pliku I</proc/partitions> (o ile taki istnieje).

source: B<-s >I<partition...>
pl: B<-s >I<partycja>...

source: Print the size (in blocks) of each given partition.
pl: Wypisuje rozmiar każdej podanej partycji (w blokach).

source: B<-u>I<[=unit]>
pl: B<-u>[I<=jednostka>]

source: When listing partition tables, show sizes in 'sectors' or in 'cylinders'. The default is to show sizes in sectors. For backward compatibility, it is possible to use the option without the E<lt>unitsE<gt> argument -- then the default is used. Note that the optional E<lt>unitE<gt> argument cannot be separated from the -u option by a space, the correct form is for example '-u=cylinders'.
pl: Podczas wypisywania tablic partycji pokazuje rozmiary w "sectors" (sektorach) lub w "cylinders" (cylindrach). Domyślnie używane są sektory. Ze względu na kompatybilność wsteczną, możliwe jest użycie tej opcji bez argumentu E<lt>jednostkiE<gt> - używana jest wówczas wartość domyślna. Proszę zauważyć, że opcjonalny argument E<lt>jednostkiE<gt> nie może być oddzielony od opcji -u spacją, poprawną formą jest np. "-u=cylinders".

source: Print version number of B<fdisk> program and exit.
pl: Wypisuje numer wersji B<fdiska> i kończy działanie.

source: BUGS
pl: BŁĘDY

source: There are several *fdisk programs around. Each has its problems and strengths. Try them in the order B<cfdisk>, B<fdisk>, B<sfdisk>. (Indeed, B<cfdisk> is a beautiful program that has strict requirements on the partition tables it accepts, and produces high quality partition tables. Use it if you can. B<fdisk> is a buggy program that does fuzzy things - usually it happens to produce reasonable results. Its single advantage is that it has some support for BSD disk labels and other non-DOS partition tables. Avoid it if you can. B<sfdisk> is for hackers only -- the user interface is terrible, but it is more correct than fdisk and more powerful than both fdisk and cfdisk. Moreover, it can be used noninteractively.)
pl: Istnieje kilka różnych programów *fdisk. Każdy z nich ma swoje problemy i zalety. Prosimy wypróbować ich w następującej kolejności: B<cfdisk>, B<fdisk>, B<sfdisk>. (Istotnie, B<cfdisk> jest pięknym programem, mającym surowe wymagania co do tablic partycji, które akceptuje, tworzącym tablice partycji wysokiej jakości. Należy go używać, jeżeli tylko jest taka możliwość. B<fdisk> jest programem mającym wiele błędów, robiącym mętne rzeczy \(em zazwyczaj zdarza mu się dać sensowne wyniki. Jego pojedynczą zaletą jest obsługa etykiet dysków typu BSD i innych nie-DOS-owych tablic partycji. Należy go unikać, jeżeli tylko jest taka możliwość. B<sfdisk> jest programem tylko dla hakerów \(em interfejs użytkownika jest okropny, ale program jest poprawniejszy od fdiska i potężniejszy od zarówno fdiska, jak i cfdiska. Co więcej, może być używany nieinteraktywnie).

source: These days there also is B<parted>. The cfdisk interface is nicer, but parted does much more: it not only resizes partitions, but also the filesystems that live in them.
pl: Obecnie istnieje także program B<parted>. Interfejs użytkownika cfdisk jest lepszy, ale parted potrafi o wiele więcej: nie tylko zmieniać wielkość partycji, ale również systemów plików, które się na nich znajdują.

source: The IRIX/SGI-type disklabel is currently not supported by the kernel. Moreover, IRIX/SGI header directories are not fully supported yet.
pl: Etykiety dysku typu IRIX/SGI nie są obecnie obsługiwane przez jądro. Co więcej, katalogi główkowe (header directories) IRIX/SGI nie są jeszcze w pełni obsługiwane.

source: The option `dump partition table to file' is missing.
pl: Brak opcji "zapisz tablicę partycji do pliku".

source: SEE ALSO
pl: ZOBACZ TAKŻE

source: AVAILABILITY
pl: DOSTĘPNOŚĆ

source: The fdisk command is part of the util-linux package and is available from ftp://ftp.kernel.org/pub/linux/utils/util-linux/.
pl: Polecenie fdisk jest częścią pakietu util-linux i jest dostępne pod adresem ftp://ftp.kernel.org/pub/linux/utils/util-linux/.
