Repository: eurolinux-enterprise-linux-sources/man-pages-pl
Catalog: src/po/man8/lilo.8.po
Languages: pl

source: 07 Oct 2005
pl: 7 października 2005

source: NAME
pl: NAZWA

source: lilo - install boot loader
pl: lilo - instaluje program rozruchowy

source: SYNOPSIS
pl: SKŁADNIA

source: Main function:
pl: Podstawowe zastosowanie:

source: B</sbin/lilo> - install boot loader
pl: B</sbin/lilo> - instaluje program rozruchowy

source: Auxiliary uses:
pl: Dodatkowe zastosowania:

source: B</sbin/lilo -A> - activate/show active partition
pl: B</sbin/lilo -A> - aktywuje/pokazuje aktywną partycję

source: B</sbin/lilo -E> - edit header or update a bitmap file
pl: B</sbin/lilo -E> - edytuje nagłówek lub aktualizuje plik mapy bitowej

source: B</sbin/lilo -I> - inquire path name of current kernel
pl: B</sbin/lilo -I> - wyświetla ścieżkę do bieżącego jądra

source: B</sbin/lilo -M > - write a Master Boot Loader on a device
pl: B</sbin/lilo -M > - zapisuje Master Boot Record (główny sektor rozruchowy) na urządzeniu

source: B</sbin/lilo -q> - query map
pl: B</sbin/lilo -q> - wyświetla mapę

source: B</sbin/lilo -R> - set default command line for next reboot
pl: B</sbin/lilo -R> - ustawia domyślny wiersz poleceń przy starcie systemu

source: B</sbin/lilo -T> - tell more about specified topic
pl: B</sbin/lilo -T> - mówi więcej o podanym zagadnieniu

source: B</sbin/lilo {-u|-U}> - uninstall LILO boot loader
pl: B</sbin/lilo >{B<-u>|B<-U>} - dezinstaluje program rozruchowy LILO

source: DESCRIPTION
pl: OPIS

source: B<lilo> installs a boot loader that will be activated the next time you boot your system. The default configuration file I</etc/lilo.conf> (see 'man lilo.conf') will contain most options, but many, including those which override the configuration file, may be specified on the command line.
pl: B<lilo> instaluje program rozruchowy, który zostanie uaktywniony przy następnym uruchomieniu komputera. Domyślny plik konfiguracyjny I</etc/lilo.conf> (patrz "man lilo.conf") zawiera większość opcji, lecz wiele, w tych te, które przesłaniają plik konfiguracyjny, może zostać podanych w wierszu polecenia.

source: B<-\^A >I<master-device [ N ]>
pl: B<-\^A >I<główne-urządzenie> [ I<N> ]

source: Used with a single argument, inquire of active partition on device I<master-device>; e.g., I</dev/hda>. With N==0, deactivate all partitions on the device. With N in the range [1..n], activate the specified partition and deactivate all others. Normally, only primary partitions [1..4] may be activated, but if the Extended Master Boot Loader is present on the Master Boot Record of the device (see the I<-M> option), any partition may be made active. Whether the actual OS in the partition will boot from a logical partition depends on the characteristics of the OS. LILO boot records for Linux may be booted from a logical partition.
pl: Użyte z pojedynczym argumentem, wyświetla aktywną partycję na urządzeniu I<główne-urządzenie>; np. I</dev/hda>. Z N=0, dezaktywuje wszystkie partycje na urządzeniu. Gdy N będzie w zakresie [1..n], aktywuje podaną partycje, dezaktywując wszystkie pozostałe. Zwykle tylko partycje podstawowe [1..4] mogą być aktywowane, lecz jeśli w głównym sektorze rozruchowym (MBR) obecny jest rozszerzony główny program rozruchowy (patrz opcja B<-M>), to uaktywniona może być dowolna partycja. To, czy dany system operacyjny będzie się w stanie uruchomić z partycji partycji logicznej, zależy od jego charakterystyki. Linuksowy sektor rozruchowy LILO może być uruchomiony z partycji logicznej.

source: B<-\^b >I<bootdev>
pl: B<-\^b >I<urządzenie-rozruchowe>

source: Specify the boot device; i.e., where the boot loader will be installed. "-b /dev/hda" specifies the Master Boot Record; "-b /dev/sdb5" specifies the first logical partition on the second SATA disk.
pl: Ustala urządzenie rozruchowe; przykładowo, gdzie program rozruchowy będzie zainstalowany. "-b /dev/hda" ustala główny sektor rozruchowy (MBR); "-b /dev/sdb5" ustala pierwszą partycję logiczną na drugim dysku SATA.

source: B<-\^B >I<bitmap-file>
pl: B<-\^B >I<plik-mapy-bitowej>

source: Specify a bitmap file for the boot-time graphics screen, preferably one already pre-processed with the 'lilo -E' command.
pl: Ustala plik mapy bitowej z graficznym ekranem wykorzystywanym w czasie uruchamiania systemu, najlepiej przygotowanym wcześniej za pomocą polecenia B<lilo -E>.

source: Enable map compaction. This will merge read requests from adjacent sectors. Speeds up the booting (especially from floppy).
pl: Włącza kompresję mapy. Ta opcja połączy żądania odczytu z sąsiednich sektorów. Przyspiesza to startowanie (szczególnie z dyskietki).

source: B<-\^C >I<config-file>
pl: B<-\^C >I<plik-konfiguracyjny>

source: B<lilo> Specify an alternate pathname for the configuration file. This option overrides the use of the default configuration file, I</etc/lilo.conf>.
pl: B<lilo> odczytuje informacje o plikach do mapowania z pliku konfiguracyjnego, domyślnie I</etc/lilo.conf>. Ta opcja wyznacza inny plik konfiguracyjny.

source: B<-\^d >I<delay>
pl: B<-\^d >I<opóźnienie>

source: Specifies the delay time in tenths of a second (20 = 2 sec) before automatically booting the first image. Gives you time to interrupt the automatic boot process with Shift, Alt, Ctrl, ScrollLock, or CapsLock. If interrupted, the `boot:' prompt is displayed. This switch is overridden by the appearance of I<prompt> in the configuration file.
pl: Ustala opóźnienie w dziesiętnych częściach sekundy (20 = 2 sek.) przed automatycznym uruchomieniem pierwszego obrazu. To daje czas na przerwanie automatycznego procesu startu klawiszem Shift, Alt, Ctrl, ScrollLock lub CapsLock. Po takim przerwaniu wyświetlona zostanie zachęta "boot:". Ta flaga zostanie nadpisana, gdy w pliku konfiguracyjnym znajduje się I<prompt>.

source: B<-\^D >I<label>
pl: B<-\^D >I<etykieta>

source: Use the kernel with the given label, instead of the first one in the list, as the default kernel to boot.
pl: Używa jądra o podanej etykiecie, zamiast pierwszego na liście, jako domyślnego jądra do wystartowania.

source: B<-\^E >I<filename.ext>
pl: B<-\^E >I<nazwa_pliku.roz>

source: If B<.ext> is B<.bmp>, then take the file to be a bitmap graphic file for use in the "bitmap=" configuration file directive. Enter an interactive editor to create or update the color/placement information in the bitmap file LILO header. (see 'bmp-colors', 'bmp-table', and 'bmp-timer' on the man page for 'lilo.conf(5)'.)
pl: Gdy I<.roz> to B<.bmp>, zakłada się, że plik ten jest plikiem graficznym do użycia w konfiguracyjnej dyrektywie "bitmap=". Proszę uruchomić interaktywny edytor aby utworzyć lub zmienić kolor/informacje o położeniu nagłówku LILO pliku z mapą bitową (patrz "bmp-colors", bmp-table" i "bmp-timer" na stronie podręcznika B<lilo.conf>(5)).

source: If B<.ext> is B<.dat>, then take the file to be a configuration file which specifies bitmap graphic parameters, which are transferred into the LILO header in the bitmap file of the same name.
pl: Gdy I<.roz> to B<.dat>, zakłada się, że plik ten jest plikiem konfiguracyjnym z podanymi parametrami graficznej mapy bitowej, które zamieniane są na nagłówek LILO w pliku z mapą bitową o takiej samej nazwie.

source: When a B<.bmp> file is modified using a graphics editor (e.g., GIMP), the LILO header will be lost. It can be restored using the B<.dat> file, which is used as a text-based backup for the LILO header information.
pl: Gdy plik B<.bmp> będzie modyfikowany za pomocą edytora graficznego (np. GIMP-a), to nagłówek LILO zostanie utracony. Można go odzyskać używając pliku B<.dat>, który służy za tekstową kopię zapasową informacji nagłówkowych LILO.

source: B<-\^f >I<disk-tab>
pl: B<-\^f >I<tablica-dysku>

source: Specify disk geometry parameter file. (The default is I</etc/disktab>.)
pl: Ustala plik z parametrami geometrii dysku (domyślnym jest I</etc/disktab>).

source: Override boot sector check for filesystems (e.g., swap, XFS, ...) which might be destroyed by the installation of the LILO boot sector on the first sector of the partition. These filesystems use the first sector as a superblock.
pl: Unieważnia sprawdzanie sektora startowego dla systemów plików (np. swap, XFS, ...), które mogą być zniszczone przez instalację sektora startowego LILO na pierwszym sektorze partycji. Te systemy plików używają pierwszego sektora jako superbloku.

source: Compare with "-P ignore", which bypasses certain partition table checks.
pl: Proszę porównać z B<-P ignore>, które obchodzi sprawdzenie danej partycji.

source: Generate cylinder/head/sector (geometric) disk addresses. Limited to cylinders up to 1023. Forces compatibility with older versions of LILO.
pl: Generuje adresy cylinder/głowica/sektor (geometryczny) dysku. Jest to ograniczone do 1023 cylindrów. Wymusza kompatybilność ze starszymi wersjami LILO.

source: Override fatal halt when a RAID array does not have all disks active.
pl: Obchodzi zatrzymanie krytyczne, gdy macierz RAID nie posiada wszystkich aktywnych dysków.

source: B<-\^i >I<boot-loader>
pl: B<-\^i >I<program-rozruchowy>

source: Specify a file to be used as the new boot loader. (The default is I</boot/boot.b>.)
pl: Wyznacza plik używany jako nowy program rozruchowy (domyślnym jest I</boot/boot.b>).

source: B<-I >I<label [D|a|i|k|r|R]>
pl: B<-\^I >I<etykieta> [B<D>|B<a>|B<i>|B<k>|B<r>|B<R>]

source: B<label> is taken to be the name of an image specified in the configuration file. This command will print the path name of the corresponding kernel file, keytable file, initial ramdisk file, root specification, or "append=" string ("i", "k", "r", "R", or "a" option). The "D" option ignores the B<label> parameter, and prints the default "image=" label, or first "image=" label if no default B<image> is specified.
pl: I<Etykieta> jest brana z nazwy obrazu podanego w pliku konfiguracyjnym. To polecenie wyświetli odpowiadającą etykiecie nazwę pliku jądra, pliku tablicy klawiszy, początkowego pliku ramdysku, określeniu korzenia lub łańcucha "append=" (opcja "i", "k", "r", "R" lub "a"). Opcja "d" ignoruje parametr I<etykieta> i wypisuje domyślną etykietę "image=" lub pierwszą etykietę "image=", jeśli nie podano domyślnego B<image>.

source: Generate 24-bit linear sector addresses instead of cylinder/head/sector addresses.
pl: Generuje 24-bitowe liniowe adresy sektorów, zamiast adresów cylindrów/głowic/sektorów.

source: Generate 32-bit Logical Block Addresses instead of cylinder/head/sector addresses, allowing access to all partitions on disks with more than 1024 cylinders.
pl: Generuje 32-bitowe Logiczne Adresy Bloków (Logical Block Addresses), zamiast adresów cylindrów/głowic/sektorów. Pozwala to na dostęp do wszystkich partycji na dyskach mających więcej niż 1024 cylindry.

source: B<-\^m >I<map-file>
pl: B<-\^m >I<plik-mapy>

source: Use specified map file instead of the default.
pl: Używa podanego pliku mapy zamiast domyślnego.

source: B<-\^M >I<master-device >B<[mbr|ext]>
pl: B<-\^M >I<główne-urządzenie> [B<mbr>|B<ext>]

source: Install a Master Boot Record on the device specified as I<master-device>, selecting the Standard or Extended Master Boot Loader per the option. The primary partition table on I<master-device> is undisturbed. If no valid Volume-ID (serial number) is present, then generate one and write it to the MBR. If B<mbr> is specified, the Standard Master Boot Loader will search partitions 1-4 for an active flag, and boot the flagged partition. Only one active flag is allowed. If B<ext> is specified, the search for an active partition will include extended partitions as well. The presence of the Extended Master Boot Loader on the Master Boot Record (MBR = sector 0) of a disk affects the operation of the I<-A> option.
pl: Instaluje główny sektor rozruchowy (MBR) na urządzeniu podanym jako I<główne-urządzenie>, wybierając standardowy lub rozszerzony główny program ładujący, zgodnie z opcją. Podstawowa tablica partycji na I<główne-urządzenie> pozostaje w nienaruszonym stanie. Gdy numer seryjny urządzenia nie jest obecny, generowany jest nowy i zapisywany w MBR. Jeśli poda się B<mbr>, to standardowy główny program ładujący przeszuka partycje 1-4 szukając partycji z flagą active (aktywna) i uruchomi się z tej partycji. Dozwolona jest tylko jedna partycja oznaczona jako aktywna. Jeśli poda się B<ext>, przeszukiwanie obejmie również partycje rozszerzone. Obecność rozszerzonego głównego programu ładującego w głównym sektorze rozruchowym (MBR = sektor 0) dysku, wpływa na działanie opcji B<-A>.

source: Require interactive entry of all passwords specified as B<""> in the configuration file.
pl: Wymaga interaktywnego wpisania wszystkich haseł podanych w pliku konfiguracyjnym jako B<"">.

source: B<-\^P >I<{fix|ignore|E<lt>global-optionE<gt>}>
pl: B<-\^P >{B<fix>|B<ignore>|I<opcja-globalna>}

source: Fix or ignore `corrupt' partition tables, i.e., partition tables with linear and cylinder/head/sector addresses that do not correspond. Always try I<-P ignore> first, as I<-P fix> will re-write the partition table, possibly destroying all partitions on the disk.
pl: Naprawienie lub zignorowanie błędnych tablic partycji, tzn. tablicy partycji z niepasującymi adresami sektora/głowicy/cylindra. Najpierw należy zawsze spróbować użyć B<-P ignore> gdyż B<-P fix> nadpisze tablicę partycji, być może niszcząc wszystkie partycje na dysku.

source: I<-P ignore> is also used to bypass the partition table check for partition types within the partition table which might not allow the installation of a LILO boot sector. Compare with the "-F" flag, which overrides the check of the actual boot sector.
pl: B<-P ignore> jest używane także po to aby obejść sprawdzanie tablicy partycji w poszukiwaniu typów partycji, które mogą nie pozwalać na instalację sektora startowego LILO. Proszę porównać z flagą "-F" flag, która unieważnia sprawdzanie bieżącego sektora rozruchowego.

source: I<-P E<lt>global-optionE<gt>> allows the passing of any global option which may appear in the global section (top) of the configuration file (/etc/lilo.conf). For instance, I<-P nowarn> will pass the "nowarn" option, just as though "nowarn" appeared in the configuration file (same as the "-w" switch). Similarly, I<-P timeout=50> will add or override the "timeout=" line in the configuration file. Note that the general I<-P> switch actually duplicates a number of command line option switches. However, it is not strictly the same as some switches whick cause an override of other options; e.g., "-g" (-P geometric), "-L" (-P lba32).
pl: B<-P> I<opcja globalna> pozwala na przekazanie dowolnej opcji, która może pojawić się w sekcji globalnej (u góry) pliku konfiguracyjnego (/etc/lilo.conf). Na przykład B<-P nowarn> przekaże opcję "nowarn", tak jakby "nowarn" pojawiło się pliku konfiguracyjnym (tak samo, jak przełącznik "-w"). Podobnie, B<-P timeout=50> doda lub przesłoni wiersz "timeout=" w pliku konfiguracyjnym. Proszę zauważyć, że przełącznik B<-P> w rzeczywistości dubluje wiele przełączników wiersza polecenia. Jednak nie jest to dokładnie to samo, ponieważ niektóre przełączniki przesłaniają inne opcje, np. "-g" (-P geometric), "-L" (-P lba32).

source: List the currently mapped files. B<lilo> maintains a file, by default I</boot/map>, containing the name and location of the kernel(s) to boot. This option will list the names therein. Use with B<-v> for more detailed information about the installed boot loader.
pl: Wyświetla aktualnie mapowane pliki. B<lilo> tworzy plik, domyślnie I</boot/map>, zawierający nazwę i lokalizację jąder startowych. Ta opcja wyświetli te nazwy. Proszę użyć wraz z opcją B<-v> aby uzyskać bardziej szczegółową informację na temat zainstalowanych programów rozruchowych.

source: B<-\^r >I<root-directory>
pl: B<-\^r >I<główny-katalog>

source: Before doing anything else, do a I<chroot> to the indicated directory. The new root directory must contain a I</dev> directory, and may need a I</boot> directory. It may also need an I</etc/lilo.conf> file.
pl: Wykonuje I<chroot> do podanego katalogu przed podjęciem jakiegokolwiek działania. Nowy katalog główny musi zawierać katalog I</dev> i może potrzebować katalogu I</boot>. Może być także potrzebny plik I</etc/lilo.conf>.

source: B<-\^R >I<command line>
pl: B<-\^R >I<wiersz poleceń>

source: This option sets the default command for the boot loader the next time it executes. The boot loader will then erase this line: this is a once-only command. It is typically used in reboot scripts, just before calling `shutdown -r'. Used without any arguments, it will cancel a I<lock>-ed or I<fallback> command line.
pl: Ta opcja zmienia domyślną linię poleceń dla programu rozruchowego podczas jego następnego uruchomienia. Potem linia ta zostanie usunięta, jest ona tylko jednorazowa. Na ogół jest to wykorzystywane w skryptach zamykania systemu, zaraz przed wywołaniem `shutdown -r'. Użyte bez żadnego argumentu anuluje I<zablokowaną> lub I<przywróci> linię komend.

source: B<-\^s >I<save-file>
pl: B<-\^s >I<plik-zapisu>

source: When B<lilo> writes a new boot sector, it preserves the former contents of the sector in a file, named by default I</boot/boot.NNNN>, where NNNN is the hexadecimal representation of the major and minor device numbers of the drive/partition. This option specifies the backup save file in one of three ways: a save directory (default is '/boot') using the default filename 'boot.NNNN' in the specified directory; a pathname template to which '.NNNN' is appended (default would be '/boot/boot'); or the full pathname of the file, which must include the correct '.NNNN' suffix. When used with the B<-u> option, the full file pathname must be specified.
pl: Gdy B<lilo> nadpisuje sektor rozruchowy, zachowuje jego starą zawartość w pliku, domyślnie jest to I</boot/boot.NNNN> gdzie NNNN jest szesnastkowym przedstawieniem głównego i pobocznego numeru urządzenia dysku/partycji. Ta opcja wyznacza zapasowy plik zapisu na jeden z trzech sposobów: katalog zapisu (domyślnym jest "/boot") używając domyślnej nazwy pliku "boot.NNNN" w podanym katalogu; szablon ścieżki, do którego dopisywane jest ".NNNN" (domyślnym byłby "/boot/boot"); pełna nazwa ścieżki pliku, która musi zawierać poprawny przyrostek ".NNNN". Z opcją B<-u> konieczne jest podanie pełnej ścieżki pliku.

source: B<-\^S >I<save-file>
pl: B<-\^S >I<plik-zapisu>

source: Normally, B<lilo> will not overwrite an existing boot sector save file. This options says that overwriting is to be forced. As with B<-s>, the specification may be of a save directory, pathname template, or full pathname (which includes the '.NNNN' suffix.)
pl: Normalnie B<lilo> nie nadpisze istniejącego zapisanego pliku. Ta opcja mówi, że nadpisywanie jest wymuszone. Tak jak z B<-s> określeniem musi być katalog zapisu, szablon nazwy lub pełna ścieżka (zawierająca przyrostek ".NNNN").

source: Test only. Do not really write a new boot sector or map file. Use together with B<-v> to find out what B<lilo> is about to do.
pl: Test. Nic nie jest zapisywane do sektora rozruchowego sektora ani do pliku mapy. Użyte razem z opcją B<-v> wyświetla co B<lilo> ma zamiar robić.

source: B<-\^T >I<option>
pl: B<-\^T >I<opcja>

source: Print out system information, some of it extracted from the system bios. This is more convenient than booting the LILO diagnostic floppy on problem systems. I<option> may be any one of the following:
pl: Wypisuje informacje systemową, z której część pochodzi z BIOS-u. Jest to wygodniejsze od uruchamiania diagnostycznej dyskietki LILO. I<opcja> może być każdą z podanych:

source: help - print a list of available diagnostics ChRul - list the partition types subject to Change-Rules EBDA - list Extended BIOS Data Area information geom=E<lt>driveE<gt> list drive geometry for bios drive; e.g., geom=0x80 geom - list drive geometry for all drives table=E<lt>driveE<gt> list the primary partition table; e.g., table=/dev/sda video - list graphic modes available to boot loader
pl: help - wypisuje listę dostępnych diagnostyk ChRul - wypisuje typy partycji podlegające Zasadom-Zmian (Change-Rules) EBDA - wypisuje informacje o Rozszerzonym Obszarze Danych BIOSU (Extended BIOS Data Area) geom=E<lt>dyskE<gt> wypisuje geometrię dysku np. geom=0x80 geom - wypisuje geometrię dla wszystkich dysków table=E<lt>dyskE<gt> wypisuje podstawową tablicę partycji; np. table=/dev/sda video - wypisuje dostępne tryby graficzne programu rozruchowego

source: B<-\^u >I<[device-name]>
pl: B<-\^u >[I<nazwa-urządzenia>]

source: Uninstall I<lilo> by copying the saved boot sector back. The '-s' and '-C' switches may be used with this option. The I<device-name> is optional. A time-stamp is checked.
pl: Dezinstalacja I<lilo>, poprzez powrotne skopiowanie zapisanego wcześniej sektora rozruchowego. Wraz z tą opcją użyte mogą być parametry '-s' i '-C'. I<Nazwa-urządzenia> jest opcjonalna. Sprawdzany jest czas i data pliku.

source: B<-\^U >I<[device-name]>
pl: B<-\^U >[I<nazwa-urządzenia>]

source: Idem, but do not check the time-stamp.
pl: Tak jak powyżej, ale bez sprawdzenia czasu i daty.

source: Increase verbosity. Giving one to five B<-v> options will make lilo more verbose, or use, B<-v> I<n> (n=1..5) to set verbosity level 'I<n>'.
pl: Zwiększenie poziomu komunikatów. Podanie od jednej do pięciu opcji B<-v> sprawi, że lilo wyświetli więcej komunikatów. Można użyć także B<-v> I<n> (n=1..5) aby ustawić poziom komunikatów na "I<n>".

source: Print version number.
pl: Wyświetla numer wersji.

source: Used as B<-w> or B<-w->, suppress warning messages. Used as B<-w+>, override I<nowarn> in the configuration file, and show warning messages.
pl: Jako B<-w> lub B<-w-> - wyłącza ostrzeżenia. Użyte jako B<-w+> przesłania I<nowarn> z pliku konfiguracyjnego i pokazuje ostrzeżenia.

source: B<-\^x >I<option>
pl: B<-\^x >I<opcja>

source: For RAID installations only. The option may be any of the keywords I<none>, I<auto>, I<mbr>, I<mbr-only>, or a comma separated list of additional boot devices (no spaces allowed in the list).
pl: Tylko dla instalacji RAID. Opcja może być każdym ze słów kluczowych B<none>, B<auto>, B<mbr>, B<mbr-only>, lub oddzieloną przecinkami listą dodatkowych urządzeń startowych (lista nie może zawierać spacji).

source: Reserved for LILO internal use. May produce different output for different LILO versions. The line beginning "CFLAGS=" will contain the compiler options used to generate this version of LILO.
pl: Zarezerwowane do wewnętrznego użycia przez LILO. Może dawać różne wyniki dla różnych wersji LILO. Linia zaczynająca się od "CFLAGS=" zawiera opcje kompilatora użyte do utworzenia tej wersji LILO.

source: When used with the `-M' switch, clears the Volume-ID. Usually used in the following sequence to generate a new Volume-ID:
pl: Gdy użyte z opcją "-M", usuwa numer seryjny urządzenia. Przeważnie opcja ta używana jest w następującej sekwencji do wygenerowania nowego numeru seryjnego urządzenia:

source: B<-\^Z >I<option>
pl: B<-\^Z >I<opcja>

source: Tells the boot installer whether special precautions need to be taken because the BIOS fails to pass the correct device code in DL (-Z0). Or may specify that the BIOS always gets DL right (-Z1). Corresponds to, and overrides, the configuration file option 'bios-passes-dl='.
pl: Przekazuje programowi rozruchowego, że konieczna jest specjalna uwaga, ponieważ BIOS nie przekazuje poprawnego kodu urządzenia w DL (-Z0). Lub daje informacje, że BIOS zawsze przekazuje poprawny kod (-Z1). Odnosi się do, i przesłania, opcję pliku konfiguracyjnego "bios-passes-dl=".

source: The above command line options correspond to the key words in the config file indicated below.
pl: Powyższe opcje linii poleceń odpowiadają podanym poniżej słowom kluczowym w pliku konfiguracyjnym.

source: -B file.bmp bitmap=file.bmp
pl: -B plik.bmp bitmap=plik.bmp

source: -d dsec delay=dsec
pl: -d dsek delay=dsek

source: -D label default=label
pl: -D etykieta default=etykieta
