Repository: eurolinux-enterprise-linux-sources/man-pages-pl
Catalog: src/po/man8/lilo.8.po
Languages: pl

source: -f file disktab=file
pl: -f plik disktab=plik

source: -m mapfile map=mapfile
pl: -m plik-mapy map=plik-mapy

source: -s file backup=file
pl: -s plik backup=plik

source: -S file force-backup=file
pl: -S plik force-backup=plik

source: -x option raid-extra-boot=option
pl: -x opcja raid-extra-boot=opcja

source: -Z option bios-passes-dl=option
pl: -Z opcja bios-passes-dl=opcja

source: BOOT OPTIONS
pl: OPCJE ROZRUCHOWE

source: The options described here may be specified at boot time on the command line when a kernel image is booted. These options are processed by LILO, and are removed from the command line before it is passed to the kernel, unless otherwise noted.
pl: Opcje podane tutaj mogą być podane z linii komend gdy ładowany jest obraz jądra. Opcje te są przetwarzane przez LILO i usuwane z linii komend przekazywanej do jądra, chyba że zaznaczono inaczej.

source: Locks the command line, as though 'lock' had been specified in 'lilo.conf.'
pl: Blokuje linię komend, tak jakby "lock" było podane w pliku "lilo.conf".

source: B<mem=###[,K,M,G]>
pl: B<mem=>I<###>[,B<K>,B<M>,B<G>]

source: Specifies the maximum memory in the system in bytes, kilobytes, megabytes, or gigabytes. This option is not removed from the command line, and is always passed to the kernel.
pl: Ustala maksymalną ilość pamięci w systemie w bajtach, kilobajtach, megabajtach lub gigabajtach. Ta opcja nie jest usuwana z linii komend i jest zawsze przekazywana do jądra.

source: Suppresses the BIOS data check. This option is reserved for use with non-IBM-compliant BIOS's which hang with the lines:
pl: Wyłącza pobieranie danych z BIOS-u. Opcja ta jest zarezerwowana do użytku z BIOS-ami niekompatybilnymi z IBM, które zawieszają się na liniach:

source: B<vga=[ASK,EXT,EXTENDED,NORMAL,###,0x###]>
pl: B<vga=>[B<ASK>,B<EXT>,B<EXTENDED>,B<NORMAL>,I<###>,B<0x>I<###>]

source: Allows overriding the default video mode upon kernel startup.
pl: Pozwala unieważnić domyślny tryb wideo podczas startu jądra.

source: BOOT ERRORS
pl: BŁĘDY ŁADOWANIA SYSTEMU

source: The boot process takes place in two stages. The first stage loader is a single sector, and is loaded by the BIOS or by the loader in the MBR. It loads the multi-sector second stage loader, but is very space limited. When the first stage loader gets control, it types the letter "L"; when it is ready to transfer control to the second stage loader it types the letter "I". If any error occurs, like a disk read error, it will put out a hexadecimal error code, and then it will re-try the operation. All hex error codes are BIOS return values, except for the lilo-generated 40, 99 and 9A. A partial list of error codes follows:
pl: Proces ładowania systemu dzieli się na dwa etapy. Program ładujący pierwszego stopnia jest pojedynczym sektorem i ładowany jest przez BIOS lub przez program ładujący do MBR. Ładuje on wielosektorowy program ładujący drugiego stopnia, lecz jest bardzo ograniczonej wielkości. Gdy program ładujący pierwszego stopnia przejmuje kontrolę, wypisuje literę "L"; gdy jest gotowy przekazać kontrolę programu ładującemu drugiego stopnia wypisuje literę "I". Gdy wystąpi jakikolwiek błąd, np. błąd odczytu z dysku, wypisany będzie szesnastkowy kod błędu i operacja zostanie powtórzona. Wszystkie szesnastkowe kody błędów są wartościami zwracanymi przez BIOS, z wyjątkiem wartości 40, 99 i 9A, które są generowane przez LILO. A oto częściowa lista kodów błędów:

source: 00 no error
pl: 00 brak błędu

source: 01 invalid disk command
pl: 01 błędna komenda dyskowa (disc command)

source: 02 address mark not found
pl: 02 nie znaleziono oznaczenia adresu

source: 03 disk write-protected
pl: 03 dysk zabezpieczony przed zapisem

source: 04 sector not found
pl: 04 nie znaleziono sektora

source: 06 floppy disk removed
pl: 06 wysunięto dyskietkę

source: 08 DMA overrun
pl: 08 przekroczenie (overrun) DMA

source: 0A bad sector flag
pl: 0A zła flaga sektora

source: 0B bad track flag
pl: 0B zła flaga ścieżki (track flag)

source: 20 controller failure
pl: 20 błąd kontrolera

source: 40 seek failure (BIOS)
pl: 40 błąd szukania (seek failure) (BIOS)

source: 99 invalid second stage index sector (LILO)
pl: 99 błędny sektor indeksu drugiego stopnia (LILO)

source: 9A no second stage loader signature (LILO)
pl: 9A brak sygnatury programu ładującego drugiego stopnia (LILO)

source: AA drive not ready
pl: AA dysk nie jest gotowy

source: FF sense operation failed
pl: FF błąd operacji odczytu elektrycznego (sense operation)

source: Error code 40 is generated by the BIOS, or by LILO during the conversion of a linear (24-bit) disk address to a geometric (C:H:S) address. On older systems which do not support lba32 (32-bit) addressing, this error may also be generated. Errors 99 and 9A usually mean the map file (-m or map=) is not readable, likely because LILO was not re-run after some system change, or there is a geometry mis-match between what LILO used (lilo -v3 to display) and what is actually being used by the BIOS (one of the lilo diagnostic disks, available in the source distribution, may be needed to diagnose this problem).
pl: Kod błędu nr 40 jest generowany przez BIOS lub przez LILO podczas konwersji liniowego (24-bitowego) adresu dyskowego na adres geometryczny (C:H:S). Błąd ten może być wywołany także na starszych systemach, które nie obsługują adresowania lba32 (32-bitowego). Błędy 99 oraz 9A najczęściej oznaczają, że nie da się odczytać pliku mapy (-m lub map=), np. gdy LILO nie zostało uruchomione po jakiejś zmianie systemowej, lub jest nieścisłość pomiędzy tym, czego użyło LILO (lilo -v3 aby wyświetlić), a tym co jest aktualnie używane przez BIOS (do zdiagnozowania tego problemu może być potrzebna jedna z dyskietek diagnostycznych, dostępnych w źródłowej dystrybucji).

source: When the second stage loader has received control from the first stage, it prints the letter "L", and when it has initialized itself, including verifying the "Descriptor Table" - the list of kernels/others to boot - it will print the letter "O", to form the full word "LILO", in uppercase.
pl: Gdy program ładujący drugiego stopnia otrzyma kontrolę od tego pierwszego stopnia, wypisuje literę "L", a po zainicjowaniu się, włączając weryfikację "Tablicy Deskryptorów" - listy jąder/innych do załadowania - wypisze literę "O", formując całe słowo "LILO" pisane wielkimi literami.

source: All second stage loader error messages are English text, and try to pinpoint, more or less successfully, the point of failure.
pl: Wszystkie błędy programu ładującego drugiego stopnia są wiadomościami w języku angielskim i próbują wskazać, mniej lub bardziej udanie, istotę błędu.

source: INCOMPATIBILITIES
pl: NIEKOMPATYBILNOŚCI

source: B<lilo> is known to have problems with the I<reiserfs> introduced with the 2.2.x kernels, unless the file system is mounted with the 'notail' option. This incompatibility has been resolved with reiserfs 3.6.18 and lilo 21.6. I<reiser4> introduced with the 2.5.x kernels requires lilo 22.5.2 or later.
pl: Znanym problemem B<lilo> jest problem z I<reiserfs> wprowadzonym w jądrach 2.2.x, chyba że system jest montowany z opcją "notail". Ta niekompatybilność zastała rozwiązana w reiserfs 3.6.18 i w lilo 21.6. I<reiser4> wprowadzony w jądrach 2.5.x wymaga lilo 22.5.2 lub późniejszego.

source: Beginning with version 22.0, RAID installations write the boot record to the RAID partition. Conditional writing of MBRs may occur to aid in making the RAID set bootable in a recovery situation, but all default actions may be overridden. Action similar to previous versions is achieved using the `-x mbr-only' switch.
pl: Zaczynając od wersji 22.0, instalacje RAID zapisują wpis rozruchowy na partycji RAID. Warunkowe zapisywanie MBR-u może pomóc w ustawieniu RAID-a jako ładujący (bootable) podczas odzyskiwania, lecz wszystkie domyślne działania mogą zostać unieważnione. Działanie podobne do poprzedniej wersji jest osiągnięte dzięki opcji "-x mbr-only".

source: BUGS
pl: BŁĘDY

source: Configuration file options `backup' and `force-backup' should specify a backup directory or backup file pathname template on all RAID installations. Use of an explicit filename may not allow multiple backup files to be created correctly. It is best to use the default mechanism, as it works correctly in all cases.
pl: Opcje pliku konfiguracyjnego "backup" i "force-backup" powinny określać katalog zapasowy lub szablon ścieżki pliku zapasowego na wszystkich instalacjach RAID. Użycie jawnej nazwy pliku może nie pozwolić na poprawne utworzenie wielu plików zapasowych. Najlepiej jest używać mechanizmu domyślnego, ponieważ działa on poprawnie we wszystkich przypadkach.

source: SEE ALSO
pl: ZOBACZ TAKŻE

source: The lilo distribution comes with very extensive TeX documentation through Version 21. Text file README's in the source directory provide updates on more recent topics. This can be found in /usr/share/doc/lilo-doc/ on Debian-based systems.
pl: Dystrybucja lilo posiada bardzo rozbudowaną dokumentację (wersja 21). Tekstowy plik README znajdujący się w katalogu źródeł udostępnia aktualizacje nt. nowszych spraw. W systemach opartych na Debianie, można go znaleźć w /usr/share/doc/lilo-doc/.

source: AUTHORS
pl: AUTORZY

source: Werner Almesberger E<lt>almesber@lrc.epfl.chE<gt> (versions 0 to 21)
pl: Werner Almesberger E<lt>almesber@lrc.epfl.chE<gt> (wersje od 0 do 21)

source: John Coffman E<lt>johninsd@san.rr.comE<gt> (21.2 to present date)
pl: John Coffman E<lt>johninsd@san.rr.comE<gt> (21.2 do teraz)
