Repository: eurolinux-enterprise-linux-sources/man-pages-pl
Catalog: src/po/man8/mount.8.po
Languages: pl

source: Data ordering is not preserved - data may be written into the main filesystem after its metadata has been committed to the journal. This is rumoured to be the highest-throughput option. It guarantees internal filesystem integrity, however it can allow old data to appear in files after a crash and journal recovery.
pl: Nie jest zachowywany porządek danych - mogą one zostać zapisane do głównego systemu plików po zapisaniu metadanych do dziennika. Chodzą słuchy, że jest to opcja zapewniająca największą wydajność. Zachowuje integralność systemu plików, jednakże po krachu systemu i odtwarzaniu dziennika w plikach mogą się pojawić stare dane.

source: This enables/disables barriers. barrier=0 disables it, barrier=1 enables it. Write barriers enforce proper on-disk ordering of journal commits, making volatile disk write caches safe to use, at some performance penalty. The ext3 filesystem does not enable write barriers by default. Be sure to enable barriers unless your disks are battery-backed one way or another. Otherwise you risk filesystem corruption in case of power failure.
pl: Włącza/wyłącza bariery (barriers). barrier=0 wyłącza je, barrier=1 włącza. Bariery zapisu wymuszają poprawną kolejność wpisów dziennika na dysku, czyniąc ulotne bufory zapisu dysku bezpieczne w użyciu, z pewnym obniżeniem wydajności. System plików ext3 nie włącza domyślnie barier zapisu. Proszę się upewnić, że bariery są włączone, chyba że dyski mają w jakiś sposób zabezpieczone zasilanie. W przeciwnym wypadku istnieje ryzyko błędu w systemie plików w przypadku nagłego braku zasilania.

source: B<commit=>I<nrsec>
pl: B<commit=>I<liczba-sekund>

source: Sync all data and metadata every I<nrsec> seconds. The default value is 5 seconds. Zero means default.
pl: Synchronizuje wszystkie dane i metadane co I<liczba-sekund> sekund. Domyślną wartością jest 5 sekund. Zero oznacza wartość domyślną.

source: Enable Extended User Attributes. See the B<attr>(5) manual page.
pl: Włącza rozszerzone atrybuty użytkownika (Extended User Attributes). Patrz strona podręcznika B<attr>(5).

source: Enable POSIX Access Control Lists. See the B<acl>(5) manual page.
pl: Włącza listy kontroli dostępu (Acces Control Lists) POSIX. Patrz strona podręcznika B<acl>(5).

source: Mount options for ext4
pl: Opcje montowania do ext4

source: The ext4 filesystem is an advanced level of the ext3 filesystem which incorporates scalability and reliability enhancements for supporting large filesystem.
pl: System plików ext4 jest zaawansowaną postacią ext3, która posiada rozszerzenia skalowalności i niezawodności, pomocne w przypadku dużych systemów plików.

source: The options B<journal_dev, noload, data, commit, orlov, oldalloc, [no]user_xattr> B<[no]acl, bsddf, minixdf, debug, errors, data_err, grpid, bsdgroups, nogrpid> B<sysvgroups, resgid, resuid, sb, quota, noquota, grpquota and usrquota> are backwardly compatible with ext3 or ext2.
pl: Opcje B<journal_dev, noload, data, commit, orlov, oldalloc, [no]user_xattr> B<[no]acl, bsddf, minixdf, debug, errors, data_err, grpid, bsdgroups, nogrpid> B<sysvgroups, resgid, resuid, sb, quota, noquota, grpquota> i B<usrquota> są wstecznie kompatybilne z ext3 i ext2.

source: Enable checksumming of the journal transactions. This will allow the recovery code in e2fsck and the kernel to detect corruption in the kernel. It is a compatible change and will be ignored by older kernels.
pl: Włącza tworzenie sum kontrolnych transakcji dziennika. Pozwala to na wykrycie błędów w jądrze przez kod odzyskiwania w e2fsck i samo jądro. Jest to zmiana kompatybilna, ignorowana przez starsze jądra.

source: Commit block can be written to disk without waiting for descriptor blocks. If enabled older kernels cannot mount the device. This will enable 'journal_checksum' internally.
pl: Zatwierdzany blok może być zapisany na dysk bez czekania na bloki deskryptora. Jeśli jest włączona, starsze jądra nie mogą zamontować danego urządzenia. Opcja włącza wewnętrznie również "journal_checksum".

source: Update the ext4 filesystem's journal to the current format.
pl: Aktualizuje dziennik systemu plików ext4 do obecnego formatu.

source: This enables/disables the use of write barriers in the jbd code. barrier=0 disables, barrier=1 enables. This also requires an IO stack which can support barriers, and if jbd gets an error on a barrier write, it will disable again with a warning. Write barriers enforce proper on-disk ordering of journal commits, making volatile disk write caches safe to use, at some performance penalty. If your disks are battery-backed in one way or another, disabling barriers may safely improve performance. The mount options "barrier" and "nobarrier" can also be used to enable or disable barriers, for consistency with other ext4 mount options.
pl: Włącza/wyłącza wykorzystanie barier zapisu przy kodzie jbd. barrier=0 wyłącza ją, a barrier=1 włącza. Opcja wymaga stosu wejścia/wyjścia zdolnego obsłużyć bariery; jeśli jbd otrzyma błąd przy zapisie barier wyłączy tę opcję ponownie, wypisując ostrzeżenie. Bariery zapisu wymuszają poprawną kolejność wpisów dziennika na dysku, czyniąc ulotne bufory zapisu dysku bezpieczne w użyciu, z pewnym obniżeniem wydajności. Jeśli dyski mają w jakiś sposób zabezpieczone zasilanie, to wyłączenie barier może w bezpieczny sposób poprawić wydajność. Do włączenia lub wyłączenia barier można również użyć opcji montowania, odpowiednio, "barrier" i "nobarrier", aby zachować spójność z innymi opcjami montowania ext4.

source: The ext4 filesystem enables write barriers by default.
pl: Domyślnie, system plików ext4 posiada włączone bariery zapisu.

source: This tuning parameter controls the maximum number of inode table blocks that ext4's inode table readahead algorithm will pre-read into the buffer cache. The default value is 32 blocks.
pl: Ten parametr kontroluje maksymalną liczbę bloków tablicy i-węzłów, które algorytm czytania z wyprzedzeniem tablicy i-węzłów ext4 będzie ładował wstępnie do podręcznego buforu. Domyślną wartością są 32 bloki.

source: Number of filesystem blocks that mballoc will try to use for allocation size and alignment. For RAID5/6 systems this should be the number of data disks * RAID chunk size in filesystem blocks.
pl: Liczba bloków systemu plików, które mballoc będzie próbował używać do rozmiaru alokowania i wyrównywania. Do systemów RAID 5/6 powinna być to liczba dysków z danymi * rozmiar części (chunk) RAID w blokach systemu plików.

source: Deferring block allocation until write-out time.
pl: Odroczona alokacja bloków do czasu zapisu.

source: Disable delayed allocation. Blocks are allocated when data is copied from user to page cache.
pl: Wyłącza odroczoną alokacją. Bloki są alokowane gdy dane są kopiowane z buforów (cache) użytkownika do buforów stronicowania.

source: B<max_batch_time=>I<usec>
pl: B<max_batch_time=>I<mikrosekundy>

source: Maximum amount of time ext4 should wait for additional filesystem operations to be batch together with a synchronous write operation. Since a synchronous write operation is going to force a commit and then a wait for the I/O complete, it doesn't cost much, and can be a huge throughput win, we wait for a small amount of time to see if any other transactions can piggyback on the synchronous write. The algorithm used is designed to automatically tune for the speed of the disk, by measuring the amount of time (on average) that it takes to finish committing a transaction. Call this time the "commit time". If the time that the transaction has been running is less than the commit time, ext4 will try sleeping for the commit time to see if other operations will join the transaction. The commit time is capped by the max_batch_time, which defaults to 15000us (15ms). This optimization can be turned off entirely by setting max_batch_time to 0.
pl: Maksymalny czas, jaki ext4 powinien czekać na łączne, wsadowe wykonanie przez system plików dodatkowych operacji, za pomocą synchronicznej operacji zapisu. Ponieważ synchroniczna operacja zapisu wymusza wykonanie zapisu, a następnie czeka na zakończenie wejścia/wyjścia, nie kosztując zbyt dużo i potencjalnie wykazując się znacznym zyskiem przepływności, czekamy przez krótki czas sprawdzając, czy nie można przy okazji zapisu synchronicznego dokonać również innych transakcji zapisu. Używany algorytm jest zaprojektowany w celu automatycznego dostosowania do szybkości dysku, mierząc (średni) czas jaki potrzebny jest do zakończenia wprowadzania transakcji w życie. Można nazwać ten czas "czasem wykonania". Jeśli czas, przez jaki działa transakcja jest mniejszy od czasu wykonania, to ext4 spróbuje wstrzymać się przez czas wykonania, sprawdzając, czy inne operacje nie mogą dołączyć się do transakcji. Czas wykonania jest ograniczony wielkością max_batch_time, która domyślnie wynosi 15000 mikrosekund (15ms). Ta optymalizacja może być całkowicie wyłączona przez ustawienie wartości max_batch_time na 0.

source: B<min_batch_time=>I<usec>
pl: B<min_batch_time=>I<mikrosekundy>

source: This parameter sets the commit time (as described above) to be at least min_batch_time. It defaults to zero microseconds. Increasing this parameter may improve the throughput of multi-threaded, synchronous workloads on very fast disks, at the cost of increasing latency.
pl: Parametr ustawia czas wykonania (jak opisano powyżej) na minimum min_batch_time. Domyślnie jest to 0 mikrosekund. Zwiększanie tej wartości może poprawić przepływność przy wielowątkowym, synchronicznym obciążeniu i bardzo szybkich dyskach, kosztem zwiększonych opóźnień.

source: The I/O priority (from 0 to 7, where 0 is the highest priorty) which should be used for I/O operations submitted by kjournald2 during a commit operation. This defaults to 3, which is a slightly higher priority than the default I/O priority.
pl: Priorytet wejścia/wyjścia (od 0 do 7, gdzie 0 jest najwyższym priorytetem), który powinien być użyty do operacji wejścia/wyjścia przedstawionych przez kjournald2 podczas operacji wykonania. Domyślnie zostanie użyta wartość 3, która jest nieznacznie wyższym priorytetem, niż domyślny priorytet wejścia/wyjścia.

source: Simulate the effects of calling ext4_abort() for debugging purposes. This is normally used while remounting a filesystem which is already mounted.
pl: Symuluje efekt wywołania funkcji ext4_abort() w celach debugowania. Jest ona zwykle używana podczas ponownego montowania systemu plików, który został już zamontowany.

source: Many broken applications don't use fsync() when replacing existing files via patterns such as
pl: Wiele złych aplikacji nie używa fsync() podczas zastępowania plików za pomocą wzorców takich jak

source: or worse yet
pl: lub nawet gorzej

source: If auto_da_alloc is enabled, ext4 will detect the replace-via-rename and replace-via-truncate patterns and force that any delayed allocation blocks are allocated such that at the next journal commit, in the default data=ordered mode, the data blocks of the new file are forced to disk before the rename() operation is committed. This provides roughly the same level of guarantees as ext3, and avoids the "zero-length" problem that can happen when a system crashes before the delayed allocation blocks are forced to disk.
pl: Jeśli opcja auto_da_alloc jest włączona, ext4 będzie wykrywał wzorce zamień-zmieniając-nazwę i zamień-obcinając i wymuszał sytuację, że bloki mające być zaalokowane z opóźnieniem są alokowane w następnym wprowadzeniu dziennika, w domyślnym trybie data=ordered, a zapis bloków danych nowego pliku jest wymuszany przed zatwierdzeniem operacji rename(). Zapewnia to podobny poziom bezpieczeństwa co ext3 i zapobiega problemowi "plików zerowej długości", który mógłby się pojawić przy załamaniu systemu przed zapisem bloków o opóźnionej alokacji.

source: Controls whether ext4 should issue discard/TRIM commands to the underlying block device when blocks are freed. This is useful for SSD devices and sparse/thinly-provisioned LUNs, but it is off by default until sufficient testing has been done.
pl: Kontroluje, czy ext4 powinien przeprowadzać polecenia discard/TRIM na podległym urządzeniu blokowym, gdy bloki są zwalniane. Jest to przydatne w przypadku urządzeń SSD i alokowania elastycznego/"rzadkiego" w jednostkach LUN, ale domyślnie jest wyłączone do czasu odpowiedniego przetestowania tej opcji.

source: Allows to resize filesystem to the end of the last existing block group, further resize has to be done with resize2fs either online, or offline. It can be used only with conjunction with remount.
pl: Pozwala na zmianę rozmiaru systemu plików do końca ostatniej istniejącej grupy bloków, dalsze zmiany muszą być wykonane za pomocą resize2fs albo online, albo offline. Może być użyta tylko w połączeniu z ponownym zamontowaniem.

source: This options allows to enables/disables the in-kernel facility for tracking filesystem metadata blocks within internal data structures. This allows multi- block allocator and other routines to quickly locate extents which might overlap with filesystem metadata blocks. This option is intended for debugging purposes and since it negatively affects the performance, it is off by default.
pl: Opcja pozwala na włączenie/wyłączenie wbudowanej w jądro możliwości śledzenia bloków metadanych systemu plików w ramach wewnętrznych struktur danych. Umożliwia to szybką lokalizację przez mechanizm alokowania wieloblokowego (i inne) ekstentów mogących zachodzić na bloki metadanych systemu plików. Opcja jest przeznaczona do debugowania i ponieważ wpływa negatywnie na wydajność, jest domyślnie wyłączona.

source: Controls whether or not ext4 should use the DIO read locking. If the dioread_nolock option is specified ext4 will allocate uninitialized extent before buffer write and convert the extent to initialized after IO completes. This approach allows ext4 code to avoid using inode mutex, which improves scalability on high speed storages. However this does not work with data journaling and dioread_nolock option will be ignored with kernel warning. Note that dioread_nolock code path is only used for extent-based files. Because of the restrictions this options comprises it is off by default (e.g. dioread_lock).
pl: Kontroluje, czy ext4 powinien używać blokowania odczytu DIO. Jeśli podano opcję dioread_nolock, ext4 będzie alokował niezainicjowane ekstenty przed zapisem bufora i konwersją ekstentu na zainicjowany po wykonaniu wejścia/wyjścia. W ten sposób, kod ext4 może zapobiec wzajemnemu wykluczaniu i-węzłów, poprawiając skalowalność na szybkich nośnikach. Niestety, opcja nie działa z dziennikiem danych i dioread_nolock zostanie wówczas zignorowane wraz z ostrzeżeniem jądra. Proszę zauważyć, że ścieżka kodu dioread_nolock jest używana tylko do plików wykorzystujących ekstenty. Z powodu tych ograniczeń, opcja jest domyślnie wyłączona (tzn. dioread_lock).

source: Enable 64-bit inode version support. This option is off by default.
pl: Włącza obsługę 64-bitowej wersji i-węzłów. Opcja jest domyślnie wyłączona.

source: Mount options for fat
pl: Opcje montowania do fat

source: (Note: I<fat> is not a separate filesystem, but a common part of the I<msdos>, I<umsdos> and I<vfat> filesystems.)
pl: (Uwaga: I<fat> nie jest odrębnym rodzajem systemu plików, ale wspólną częścią systemów plików I<msdos>, I<umsdos> i I<vfat>.)

source: Set blocksize (default 512). This option is obsolete.
pl: Ustawia rozmiar bloku (domyślnie 512). Opcja jest przestarzała.

source: Set the owner and group of all files. (Default: the uid and gid of the current process.)
pl: Ustawia właściciela i grupę wszystkich plików (domyślnie: uid i gid bieżącego procesu).

source: B<umask=>I<value>
pl: B<umask=>I<wartość>

source: Set the umask (the bitmask of the permissions that are B<not> present). The default is the umask of the current process. The value is given in octal.
pl: Ustawia umask (maskę bitową praw, które B<nie> występują). Domyślnie używany jest umask bieżącego procesu. Wartość podawana jest ósemkowo.

source: B<dmask=>I<value>
pl: B<dmask=>I<wartość>

source: Set the umask applied to directories only. The default is the umask of the current process. The value is given in octal.
pl: Ustawia umask ustawiany wyłącznie do katalogów. Domyślnie używany jest umask bieżącego procesu. Wartość podawana jest ósemkowo.

source: B<fmask=>I<value>
pl: B<fmask=>I<wartość>

source: Set the umask applied to regular files only. The default is the umask of the current process. The value is given in octal.
pl: Ustawia umask ustawiany wyłącznie do zwykłych plików. Domyślnie używany jest umask bieżącego procesu. Wartość podawana jest ósemkowo.

source: B<allow_utime=>I<value>
pl: B<allow_utime=>I<wartość>

source: This option controls the permission check of mtime/atime.
pl: Opcja kontroluje sprawdzanie uprawnień mtime/atime

source: If current process is in group of file's group ID, you can change timestamp.
pl: Jeśli bieżący proces jest w grupie identyfikatora grupy pliku, można zmienić pieczątkę czasową.

source: Other users can change timestamp.
pl: Inny użytkownicy mogą zmieniać pieczątkę czasową.

source: The default is set from `dmask' option. (If the directory is writable, B<utime(2)> is also allowed. I.e. ~dmask & 022)
pl: Wartość domyślna jest ustawiana z opcji "dmask" (jeśli katalog jest zapisywalny, to dozwolone jest również B<utime(2)> np. ~dmask & 022).

source: Normally B<utime(2)> checks current process is owner of the file, or it has CAP_FOWNER capability. But FAT filesystem doesn't have uid/gid on disk, so normal check is too unflexible. With this option you can relax it.
pl: Zwykle B<utime(2)> sprawdza czy bieżący proces jest właścicielem pliku lub czy posiada właściwość CAP_FOWNER. Jednak systemy plików FAT nie posiadają na dysku uid ani gid, więc zwykłe sprawdzenie jest zbyt mało elastyczne. Opcja jest remedium na tę sytuację.

source: B<check=>I<value>
pl: B<check=>I<wartość>

source: Three different levels of pickyness can be chosen:
pl: Można wybrać trzy stopnie:

source: Upper and lower case are accepted and equivalent, long name parts are truncated (e.g. I<verylongname.foobar> becomes I<verylong.foo>), leading and embedded spaces are accepted in each name part (name and extension).
pl: Akceptowane i równoważne sobie są zarówno wielkie, jak i małe litery. Części długich nazw są obcinane (np. I<verylongname.foobar> staje się I<verylong.foo>), początkowe i wtrącone spacje są akceptowane jako każda część nazwy (nazwy i rozszerzenia).

source: Like "relaxed", but many special characters (*, ?, E<lt>, spaces, etc.) are rejected. This is the default.
pl: Podobnie jak "relaxed", lecz wiele znaków specjalnych (jak *, ?, E<lt>, spacje, itp.) jest odrzucanych. Tak jest domyślnie.

source: Like "normal", but names may not contain long parts and special characters that are sometimes used on Linux, but are not accepted by MS-DOS are rejected. (+, =, spaces, etc.)
pl: Jak "normal", lecz nazwy nie mogą zawierać długich części i znaków specjalnych, które czasem są używane pod Linuksem, lecz nie są akceptowane przez MS-DOS (+, =, spacje itp.)

source: B<codepage=>I<value>
pl: B<codepage=>I<wartość>

source: Sets the codepage for converting to shortname characters on FAT and VFAT filesystems. By default, codepage 437 is used.
pl: Ustawia stronę kodową do konwersji znaków krótkiej nazwy w systemach plików FAT i VFAT. Domyślnie stosowana jest strona kodowa 437.

source: B<conv=>{bB<[>inaryB<]|>tB<[>extB<]|>aB<[>utoB<]}>
pl: B<conv=>{B<b>[B<inary>]|B<t>[B<ext>]|B<a>[B<uto>]}

source: The I<fat> filesystem can perform CRLFE<lt>--E<gt>NL (MS-DOS text format to UNIX text format) conversion in the kernel. The following conversion modes are available:
pl: System plików I<fat> może dokonywać konwersji CRLFE<lt>--E<gt>NL (format tekstowy MS-DOS na format tekstowy UNIX) w jądrze. Dostępne są następujące tryby konwersji:

source: no translation is performed. This is the default.
pl: brak konwersji. Domyślne.

source: CRLFE<lt>--E<gt>NL translation is performed on all files.
pl: Konwersja CRLFE<lt>--E<gt>NL wykonywana dla wszystkich plików.

source: CRLFE<lt>--E<gt>NL translation is performed on all files that don't have a "well-known binary" extension. The list of known extensions can be found at the beginning of I<fs/fat/misc.c> (as of 2.0, the list is: exe, com, bin, app, sys, drv, ovl, ovr, obj, lib, dll, pif, arc, zip, lha, lzh, zoo, tar, z, arj, tz, taz, tzp, tpz, gz, tgz, deb, gif, bmp, tif, gl, jpg, pcx, tfm, vf, gf, pk, pxl, dvi).
pl: Konwersja CRLFE<lt>--E<gt>NL dla wszystkich plików, które nie mają "ogólnie znanego rozszerzenia binarnego". Listę znanych rozszerzeń można znaleźć na początku I<fs/fat/misc.c> (w wersji 2.0, na liście są: exe, com, bin, app, sys, drv, ovl, ovr, obj, lib, dll, pif, arc, zip, lha, lzh, zoo, tar, z, arj, tz, taz, tzp, tpz, gz, tgz, deb, gif, bmp, tif, gl, jpg, pcx, tfm, vf, gf, pk, pxl, dvi).

source: Programs that do computed lseeks won't like in-kernel text conversion. Several people have had their data ruined by this translation. Beware!
pl: Programy, które dokonują obliczonych lseek-ów, nie będą zadowolone z konwersji. Niektórzy ludzie utracili dane przez tę translację. Strzeżcie się!

source: For filesystems mounted in binary mode, a conversion tool (fromdos/todos) is available. This option is obsolete.
pl: Dla systemów zamontowanych w trybie binarnym, dostępne są narzędzia konwersji (fromdos/todos). Ta opcja jest przestarzała.

source: B<cvf_format=>I<module>
pl: B<cvf_format=>I<moduł>

source: Forces the driver to use the CVF (Compressed Volume File) module cvf_I<module> instead of auto-detection. If the kernel supports kmod, the cvf_format=xxx option also controls on-demand CVF module loading. This option is obsolete.
pl: Wymusza na sterowniku stosowanie modułu CVF (Compressed Volume File) cvf_I<moduł> zamiast automatycznego wykrywania. Jeżeli jądro obsługuje kmod, to opcja cvf_format=xxx steruje także ładowaniem na żądanie modułu CVF. Ta opcja jest przestarzała.

source: B<cvf_option=>I<option>
pl: B<cvf_option=>I<opcja>

source: Option passed to the CVF module. This option is obsolete.
pl: Opcja przekazywana do modułu CVF. Ta opcja jest przestarzała.

source: Turn on the I<debug> flag. A version string and a list of filesystem parameters will be printed (these data are also printed if the parameters appear to be inconsistent).
pl: Włącza flagę I<debug>. Wypisana zostanie wersja i lista parametrów systemu plików (te dane wypisywane są też jeśli parametry są niespójne).

source: Specify a 12, 16 or 32 bit fat. This overrides the automatic FAT type detection routine. Use with caution!
pl: Określa fat 12-, 16- lub 32-bitowy. To przesłania procedurę automatycznego wykrywania typu FAT. Używaj ostrożnie!

source: B<iocharset=>I<value>
pl: B<iocharset=>I<wartość>

source: Character set to use for converting between 8 bit characters and 16 bit Unicode characters. The default is iso8859-1. Long filenames are stored on disk in Unicode format.
pl: Zestaw znaków używany do konwersji między znakami 8-bitowymi a 16-bitowymi znakami Unikodu. Domyślnym jest iso8859-1. Długie nazwy plików są przechowywane na dysku w formacie Unicode.

source: This option disables the conversion of timestamps between local time (as used by Windows on FAT) and UTC (which Linux uses internally). This is particularly useful when mounting devices (like digital cameras) that are set to UTC in order to avoid the pitfalls of local time.
pl: Opcja wyłącza konwersję pieczątek czasowych pomiędzy czasem lokalnym (używanym przez Windows na FAT) i UTC (używanym wewnętrznie przez Linuksa). Jest to przydatne szczególnie podczas montowania urządzeń (np. aparatów cyfrowych), które są ustawione na UTC, aby uniknąć pułapki związanej z czasem lokalnym.
