Repository: eurolinux-enterprise-linux-sources/man-pages-pl
Catalog: src/po/man8/mount.8.po
Languages: pl

source: Mount options for squashfs
pl: Opcje montowania do squashfs

source: Mount options for smbfs
pl: Opcje montowania do smbfs

source: Just like I<nfs>, the I<smbfs> implementation expects a binary argument (a I<struct smb_mount_data>) to the mount system call. This argument is constructed by B<smbmount>(8) and the current version of B<mount> (2.12) does not know anything about smbfs.
pl: Tak jak I<nfs>, implementacja I<smbfs> oczekuje binarnego argumentu (I<struct smb_mount_data>) do funkcji systemowej mount. Argument ten jest konstruowany przez B<smbmount>(8) a bieżąca wersja B<mount> (2.12) nie wie nic o smbfs.

source: Mount options for sysv
pl: Opcje montowania do sysv

source: Mount options for tmpfs
pl: Opcje montowania do tmpfs

source: B<size=>I<nbytes>
pl: B<size=>I<nbajtów>

source: Override default maximum size of the filesystem. The size is given in bytes, and rounded up to entire pages. The default is half of the memory. The size parameter also accepts a suffix % to limit this tmpfs instance to that percentage of your physical RAM: the default, when neither size nor nr_blocks is specified, is size=50%
pl: Przesłania domyślny, maksymalny rozmiar systemu plików. Rozmiar jest podany w bajtach i zaokrąglony w górę do pełnych stron. Domyślnie zajmuję połowę pamięci. Parametr rozmiar akceptuje również przyrostek %, w celu ograniczenia tej instancji tmpfs do danej liczby procent fizycznej pamięci RAM: domyślnie, jeśli nie poda się ani rozmiaru (size) ani numeru bloków (nr_blocks), rozmiar wynosi 50% (size=50%).

source: The same as size, but in blocks of PAGE_CACHE_SIZE
pl: Podobnie jak size, ale w blokach PAGE_CACHE_SIZE.

source: The maximum number of inodes for this instance. The default is half of the number of your physical RAM pages, or (on a machine with highmem) the number of lowmem RAM pages, whichever is the lower.
pl: Maksymalna liczba i-węzłów dla tej instancji. Domyślnie jest to połowa fizycznej stronicowanej pamięci RAM lub (na komputerze z highmem) liczba pamięci stronicowanej RAM lowmem (używana jest niższa z tych dwóch wartość)

source: The tmpfs mount options for sizing ( B<size>, B<nr_blocks>, and B<nr_inodes>) accept a suffix B<k>, B<m> or B<g> for Ki, Mi, Gi (binary kilo, mega and giga) and can be changed on remount.
pl: Opcje montowania tmpfs dotyczące rozmiaru (B<size>, B<nr_blocks> i B<nr_inodes>) akceptują przyrostek B<k>, B<m> lub B<g> dla Ki, Mi, Gi (binarne kilo, mega oraz giga) i mogą być zmienione w czasie ponownego montowania.

source: Set initial permissions of the root directory.
pl: Określa początkowe prawa dostępu głównego katalogu.

source: The user id.
pl: Identyfikator użytkownika

source: The group id.
pl: Identyfikator grupy.

source: Set the NUMA memory allocation policy for all files in that instance (if the kernel CONFIG_NUMA is enabled) - which can be adjusted on the fly via 'mount -o remount ...'
pl: Ustawia zasady (politykę) alokowania pamięci NUMA do wszystkich plików w danej instancji (jeśli włączono opcję jądra CONFIG_NUMA) - które może zostać dostosowana "w locie" za pomocą "mount -o remount ...".

source: prefers to allocate memory from the local node
pl: preferuje alokowanie pamięci z węzła lokalnego

source: B<prefer:Node>
pl: B<prefer:Węzeł>

source: prefers to allocate memory from the given Node
pl: preferuje alokowanie pamięci z podanego Węzła

source: B<bind:NodeList>
pl: B<bind:ListaWęzłów>

source: allocates memory only from nodes in NodeList
pl: alokuje pamięć tylko z węzłów z ListyWęzłów

source: prefers to allocate from each node in turn
pl: alokuje pamięć z każdego węzła po kolei

source: B<interleave:NodeList>
pl: B<interleave:ListaWęzłów>

source: allocates from each node of NodeList in turn.
pl: alokuje pamięć z każdego z węzłów z ListyWęzłów po kolei.

source: The NodeList format is a comma-separated list of decimal numbers and ranges, a range being two hyphen-separated decimal numbers, the smallest and largest node numbers in the range. For example, mpol=bind:0-3,5,7,9-15
pl: Format ListyWęzłów jest następujący: jest to lista (oddzielonych przecinkami) liczb dziesiętnych i zakresów, gdzie zakres jest dwiema liczbami dziesiętnymi (oddzielonymi minusem) - najmniejszym i największym numerem węzła w zakresie. Na przykład mpol=bind:0-3,5,7,9-15

source: Note that trying to mount a tmpfs with an mpol option will fail if the running kernel does not support NUMA; and will fail if its nodelist specifies a node which is not online. If your system relies on that tmpfs being mounted, but from time to time runs a kernel built without NUMA capability (perhaps a safe recovery kernel), or with fewer nodes online, then it is advisable to omit the mpol option from automatic mount options. It can be added later, when the tmpfs is already mounted on MountPoint, by 'mount -o remount,mpol=Policy:NodeList MountPoint'.
pl: Proszę zauważyć, że próba zamontowania tmpfs z opcją mpol nie powiedzie się, jeśli działające jądro nie obsługuje NUMA oraz nie powiedzie się, jeśli jego lista węzłów uwzględnia węzeł, który nie jest online. Jeśli bieżący system opiera się na założeniu, że tmpfs jest zamontowany, ale od czasu do czasu jest uruchamiany z jądrem zbudowanym bez zdolności NUMA (prawdopodobnie jądro opcji bezpiecznego odzyskiwania) lub jeśli liczba dostępnych węzłów może się zmniejszyć, zaleca się pominąć opcję mpol przy opcjach automatycznego montowania. Można ją dodać później, gdy tmpfs jest już zamontowany w PunktMontowania, za pomocą "mount -o remount,mpol=Policy:ListaWęzłów PunktMontowania".

source: Mount options for ubifs
pl: Opcje montowania do ubifs

source: UBIFS is a flash file system which works on top of UBI volumes. Note that B<atime> is not supported and is always turned off.
pl: UBIFS jest systemem plików flash, którzy działa na woluminach UBI. Proszę zauważyć, że B<atime> nie jest obsługiwane i jest zawsze wyłączone.

source: The device name may be specified as
pl: Nazwa urządzenia może zostać podana jako

source: B<ubiX_Y> UBI device number B<X>, volume number B<Y>
pl: B<ubiX_Y> numer urządzenia UBI B<X>, numer woluminu B<Y>

source: UBI device number B<0>, volume number B<Y>
pl: numer urządzenia UBI B<0>, numer woluminu B<Y>

source: B<ubiX:NAME>
pl: B<ubiX:NAZWA>

source: UBI device number B<X>, volume with name B<NAME>
pl: numer urządzenia UBI B<X>, wolumin o nazwie B<NAZWA>

source: B<ubi:NAME>
pl: B<ubi:NAZWA>

source: UBI device number B<0>, volume with name B<NAME>
pl: numer urządzenia UBI B<0>, wolumin o nazwie B<NAZWA>

source: Alternative B<!> separator may be used instead of B<:>.
pl: Zamiast B<:> można użyć separatora B<!>.

source: The following mount options are available:
pl: Dostępne są następujące opcje montowania:

source: Enable bulk-read. VFS read-ahead is disabled because it slows down the file system. Bulk-Read is an internal optimization. Some flashes may read faster if the data are read at one go, rather than at several read requests. For example, OneNAND can do "read-while-load" if it reads more than one NAND page.
pl: Włącza bulk-read. Odczyt z wyprzedzeniem VFS jest wyłączony, ponieważ zwalnia on system plików. Bulk-Read jest wewnętrzną optymalizacją. Część pamięci flash może czytać szybciej, jeśli dane są odczytywane za jednym razem, zamiast przy użyciu kilku żądań odczytu. Na przykład OneNAND może wykonać "read-while-load" gdy czyta więcej niż jedną stronę NAND.

source: Do not bulk-read. This is the default.
pl: Nie wykonuje bulk-read. Tak jest domyślne.

source: Check data CRC-32 checksums. This is the default.
pl: Sprawdza sumy kontrolne CRC-32 danych. Tak jest domyślnie.

source: Do not check data CRC-32 checksums. With this option, the filesystem does not check CRC-32 checksum for data, but it does check it for the internal indexing information. This option only affects reading, not writing. CRC-32 is always calculated when writing the data.
pl: Nie sprawdza sum kontrolnych CRC-32 danych. Z tą opcją system plików nie sprawdza sum kontrolnych CRC-32 danych, lecz sprawdza je w celu wewnętrznej informacji indeksowania. Opcja wpływa jedynie na odczyt, nie na zapis. Sumy CRC-32 są obliczane zawsze podczas zapisu danych.

source: Select the default compressor which is used when new files are written. It is still possible to read compressed files if mounted with the B<none> option.
pl: Wybiera domyślny tryb kompresji używany podczas zapisywania nowych plików. Nadal da się odczytać skompresowane pliki, jeśli montowanie będzie wykonane z opcją B<none>.

source: Mount options for udf
pl: Opcje montowania do udf

source: udf is the "Universal Disk Format" filesystem defined by the Optical Storage Technology Association, and is often used for DVD-ROM. See also I<iso9660>.
pl: udf jest uniwersalnym formatem dysku ("Universal Disk Format") zdefiniowanym przez Optical Storage Technology Association i jest używany często na DVD-ROM-ach. Patrz też I<iso9660>.

source: Set the default group.
pl: Ustawia domyślną grupę.

source: Set the default umask. The value is given in octal.
pl: Ustawia domyślne umask. Wartość jest podana ósemkowo.

source: Set the default user.
pl: Ustawia domyślnego użytkownika.

source: Show otherwise hidden files.
pl: Pokazuje pliki, które inaczej byłyby ukryte.

source: Show deleted files in lists.
pl: Pokazuje usunięte pliki na na listach.

source: Unset strict conformance.
pl: Wyłącza ustawianie ścisłej zgodności.

source: Set the NLS character set.
pl: Ustawia zestaw znaków NLS.

source: Set the block size. (May not work unless 2048.)
pl: Ustawia rozmiar bloku. (Może nie działać, chyba że 2048.)

source: Skip volume sequence recognition.
pl: Pomija rozpoznawanie numeru sekwencyjnego wolumenu.

source: Set the CDROM session counting from 0. Default: last session.
pl: Ustawia sesję CD-ROM licząc od 0. Domyślnie: ostatnia sesja.

source: Override standard anchor location. Default: 256.
pl: Przesłania położenie standardowego zakotwiczenia (anchor). Domyślnie: 256.

source: Override the VolumeDesc location. (unused)
pl: Przesłania położenie VolumeDesc. (nieużywane)

source: Override the PartitionDesc location. (unused)
pl: Przesłania położenie PartitionDesc. (nieużywane)

source: Set the last block of the filesystem.
pl: Ustawia ostatni blok systemu plików.

source: Override the fileset block location. (unused)
pl: Przesłania położenie bloku zestawu plików (fileset block). (nieużywane)

source: Override the root directory location. (unused)
pl: Przesłania położenie katalogu głównego. (nieużywane)

source: Mount options for ufs
pl: Opcje montowania do ufs

source: B<ufstype=>I<value>
pl: B<ufstype=>I<wartość>

source: UFS is a filesystem widely used in different operating systems. The problem are differences among implementations. Features of some implementations are undocumented, so its hard to recognize the type of ufs automatically. That's why the user must specify the type of ufs by mount option. Possible values are:
pl: UFS jest systemem plików szeroko wykorzystywanym w różnych systemach operacyjnych. Problem stanowią różnice pomiędzy implementacjami. Cechy niektórych z nich są nieudokumentowane, tak więc trudno rozpoznać automatycznie typ ufs. Z tego powodu użytkownik musi określić typ ufs za pomocą opcji montowania. Możliwe wartości to:

source: Old format of ufs, this is the default, read only. (Don't forget to give the -r option.)
pl: Stary format ufs, jest to typ domyślny, tylko do odczytu (proszę nie zapomnieć podać opcji -r).

source: For filesystems created by a BSD-like system (NetBSD,FreeBSD,OpenBSD).
pl: Dla systemów plików utworzonych przez system typu BSD (NetBSD,FreeBSD,OpenBSD).

source: Used in FreeBSD 5.x supported as read-write.
pl: Używane w FreeBSD 5.x obsługiwanego jako do odczytu i zapisu.

source: Synonym for ufs2.
pl: Synonim do ufs2.

source: For filesystems created by SunOS or Solaris on Sparc.
pl: Do systemów plików utworzonych przez SunOS lub Solaris na komputerze Sparc.

source: For filesystems created by Solaris on x86.
pl: Do systemów plików utworzonych przez Solaris na x86.

source: For filesystems created by HP-UX, read-only.
pl: Do systemów plików utworzonych przez HP-UX, tylko do odczytu.

source: For filesystems created by NeXTStep (on NeXT station) (currently read only).
pl: Do systemów plików utworzonych przez NeXTStep (na stacji roboczej NeXT) (obecnie tylko do odczytu).

source: For NextStep CDROMs (block_size == 2048), read-only.
pl: Do CD-ROM-ów NextStep (block_size == 2048), tylko do odczytu.

source: For filesystems created by OpenStep (currently read only). The same filesystem type is also used by Mac OS X.
pl: Do systemów plików utworzonych przez OpenStep (obecnie tylko do odczytu). Ten sam typ systemów plików jest również używany przez Mac OS X.

source: B<onerror=>I<value>
pl: B<onerror=>I<wartość>

source: Set behaviour on error:
pl: Ustala zachowanie w przypadku błędu:

source: If an error is encountered, cause a kernel panic.
pl: Jeśli napotkano błąd, powoduje panikę jądra.

source: These mount options don't do anything at present; when an error is encountered only a console message is printed.
pl: Te opcje montowania teraz nic nie robią: po napotkaniu błędu wypisują tylko komunikat na konsoli.

source: Mount options for umsdos
pl: Opcje montowania do umsdos

source: See mount options for msdos. The B<dotsOK> option is explicitly killed by I<umsdos>.
pl: Zobacz opcje do msdos. Opcja B<dotsOK> jest jawnie ubijana przez I<umsdos>.

source: Mount options for vfat
pl: Opcje montowania do vfat

source: First of all, the mount options for I<fat> are recognized. The B<dotsOK> option is explicitly killed by I<vfat>. Furthermore, there are
pl: Przede wszystkim, rozpoznawane są wszystkie opcje do I<fat>. Opcja B<dotsOK> jest jawnie ubijana przez I<vfat>. Ponadto istnieją

source: Translate unhandled Unicode characters to special escaped sequences. This lets you backup and restore filenames that are created with any Unicode characters. Without this option, a '?' is used when no translation is possible. The escape character is ':' because it is otherwise illegal on the vfat filesystem. The escape sequence that gets used, where u is the unicode character, is: ':', (u & 0x3f), ((uE<gt>E<gt>6) & 0x3f), (uE<gt>E<gt>12).
pl: Tłumaczy nieobsługiwane znaki Unikodu na specjalne sekwencje unikowe. To umożliwia wykonywanie kopii zapasowych i odtwarzanie plików o nazwach, utworzonych ze znakami Unikodu. Bez tej opcji, w wypadku braku możliwości konwersji używane jest '?'. Znakiem unikowym jest ':', ponieważ na systemie vfat jest w innych wypadkach niedozwolony. Sekwencja specjalna, która byłaby użyta dla znaku u, gdzie u jest znakiem Unikodu to: ':', (u & 0x3f), ((uE<gt>E<gt>6) & 0x3f), (uE<gt>E<gt>12).

source: Allow two files with names that only differ in case. This option is obsolete.
pl: Pozwala, by dwa pliki miały nazwy różniące się tylko wielkością liter. Ta opcja jest przestarzała.

source: First try to make a short name without sequence number, before trying I<name~num.ext>.
pl: Zanim zacznie próbować I<nazwa~nr.roz> najpierw próbuje zrobić krótką nazwę bez numeru kolejnego.

source: UTF8 is the filesystem safe 8-bit encoding of Unicode that is used by the console. It can be enabled for the filesystem with this option or disabled with utf8=0, utf8=no or utf8=false. If `uni_xlate' gets set, UTF8 gets disabled.
pl: UTF8 jest systemem plików bezpiecznego 8-bitowego kodowania Unikodu, który jest wykorzystywany przez konsolę. Tą opcją można go włączyć dla danego systemu plików lub wyłączyć za pomocą utf8=0, utf8=no lub utf8=false. Jeśli zostanie ustawione `uni_xlate', UTF8 jest wyłączane.

source: Defines the behaviour for creation and display of filenames which fit into 8.3 characters. If a long name for a file exists, it will always be preferred display. There are four modes: :
pl: Definiuje zachowanie w przypadku tworzenia i wyświetlania nazw plików mieszczących się w schemacie 8.3 znaków. Jeśli istnieje długa nazwa pliku, będzie zawsze preferowanym sposobem wyświetlania. Istnieją cztery tryby:

source: Force the short name to lower case upon display; store a long name when the short name is not all upper case.
pl: Wymusza na krótkiej nazwie wyświetlanie jej za pomocą małych liter; przechowuje długą nazwę, gdy nie wszystkie litery krótkiej nazwy są wielkie.

source: Force the short name to upper case upon display; store a long name when the short name is not all upper case.
pl: Wymusza na krótkiej nazwie wyświetlanie jej za pomocą wielkich liter; przechowuje długą nazwę, gdy nie wszystkie litery krótkiej nazwy są wielkie.

source: Display the shortname as is; store a long name when the short name is not all lower case or all upper case.
pl: Wyświetla krótką nazwę bez zmian; przechowuje długą nazwę, gdy nie wszystkie litery krótkiej nazwy są wielkie lub nie wszystkie są małe.

source: Display the short name as is; store a long name when the short name is not all upper case. This mode is the default since Linux 2.6.32.
pl: Wyświetla krótką nazwę bez zmian; przechowuje długą nazwę, gdy nie wszystkie litery krótkiej nazwy są wielkie. Ten tryb jest domyślny od Linuksa 2.6.32.

source: Mount options for usbfs
pl: Opcje montowania do usbfs

source: B<devuid=>I<uid> and B<devgid=>I<gid> and B<devmode=>I<mode>
pl: B<devuid=>I<uid> i B<devgid=>I<gid> i B<devmode=>I<tryb>

source: Set the owner and group and mode of the device files in the usbfs filesystem (default: uid=gid=0, mode=0644). The mode is given in octal.
pl: Ustawia właściciela i grupę i tryb plików w plikach urządzeń systemu plików usbfs (domyślnie: uid=gid=0, mode=0644). Tryb jest podany ósemkowo.

source: B<busuid=>I<uid> and B<busgid=>I<gid> and B<busmode=>I<mode>
pl: B<busuid=>I<uid> i B<busgid=>I<gid> i B<busmode=>I<tryb>

source: Set the owner and group and mode of the bus directories in the usbfs filesystem (default: uid=gid=0, mode=0555). The mode is given in octal.
pl: Ustawia właściciela i grupę i tryb plików w katalogach szyny (bus) systemu plików usbfs (domyślnie: uid=gid=0, mode=0555). Tryb podany jest ósemkowo.

source: B<listuid=>I<uid> and B<listgid=>I<gid> and B<listmode=>I<mode>
pl: B<listuid=>I<uid> i B<listgid=>I<gid> i B<listmode=>I<tryb>

source: Set the owner and group and mode of the file I<devices> (default: uid=gid=0, mode=0444). The mode is given in octal.
pl: Ustawia właściciela i grupę i tryb pliku I<devices> (domyślnie: uid=gid=0, mode=0444). Tryb jest podany ósemkowo.

source: Mount options for xenix
pl: Opcje montowania do xenix

source: Mount options for xfs
pl: Opcje montowania do xfs

source: B<allocsize=>I<size>
pl: B<allocsize=>I<rozmiar>

source: Sets the buffered I/O end-of-file preallocation size when doing delayed allocation writeout (default size is 64KiB). Valid values for this option are page size (typically 4KiB) through to 1GiB, inclusive, in power-of-2 increments.
pl: Ustawia rozmiar prealokowanego końca pliku przy buforowanym wejściu/wyjściu podczas wykonywania opóźnionej alokacji zapisu (domyślny rozmiar: 64 KiB). Poprawnymi wartościami do tej opcji jest rozmiar strony (z reguły 4 KiB), aż do 1 GiB, włącznie, w odstępach kolejnych potęg dwójki.

source: The options enable/disable (default is enabled) an "opportunistic" improvement to be made in the way inline extended attributes are stored on-disk. When the new form is used for the first time (by setting or removing extended attributes) the on-disk superblock feature bit field will be updated to reflect this format being in use.
pl: Opcja włącza/wyłącza (domyślnie jest włączona) "oportunistyczne" ulepszenie, działające w ten sposób, że wbudowane (inline) rozszerzone atrybuty są przechowywane na dysku. Gdy nowa forma zostanie użyta po raz pierwszy (ustawiając lub usuwając rozszerzone atrybuty) pole funkcji superbloku dysku zostanie zaktualizowane, aby odnosiło się do używanego formatu.

source: Enables the use of block layer write barriers for writes into the journal and unwritten extent conversion. This allows for drive level write caching to be enabled, for devices that support write barriers.
pl: Włącza używanie warstwy blokowej barier zapisu do zapisu do dziennika i niezapisanych konwersji ekstentów. Pozwala to na włączone buforów zapisu na poziomie sterownika, na urządzeniu, które obsługuje bariery zapisu.

source: Enable the DMAPI (Data Management API) event callouts. Use with the B<mtpt> option.
pl: Włącza wyróżnione zdarzenia DMAPI (Data Management API). Używane z opcją B<mtpt>.

source: These options define what group ID a newly created file gets. When grpid is set, it takes the group ID of the directory in which it is created; otherwise (the default) it takes the fsgid of the current process, unless the directory has the setgid bit set, in which case it takes the gid from the parent directory, and also gets the setgid bit set if it is a directory itself.
pl: Opcje te definiują, jaki identyfikator grupy (gid) otrzyma nowo utworzony plik. Gdy ustawiony jest B<grpid>, to pobiera gid katalogu, w którym jest utworzony; w przeciwnym wypadku (domyślnie) bierze fsgid bieżącego procesu, chyba że katalog ma ustawiony bit setgid, wówczas pobiera gid katalogu rodzicielskiego i dodatkowo otrzymuje bit setgid, jeśli sam jest katalogiem.

source: B<ihashsize=>I<value>
pl: B<ihashsize=>I<wartość>

source: Sets the number of hash buckets available for hashing the in-memory inodes of the specified mount point. If a value of zero is used, the value selected by the default algorithm will be displayed in I</proc/mounts>.
pl: Ustawia liczbę wartości funkcji mieszającej dostępnej do haszowania i-węzłów określonego punktu montowania, znajdujących się w pamięci. Jeśli poda się zero, wartość wybrana przez domyślny algorytm będzie wyświetlana w I</proc/mounts>.

source: When inode clusters are emptied of inodes, keep them around on the disk (ikeep) - this is the traditional XFS behaviour and is still the default for now. Using the noikeep option, inode clusters are returned to the free space pool.
pl: Gdy klastry i-węzłów są opróżniane z i-węzłów, zatrzymuje je na dysku (ikeep) - jest to tradycyjne zachowanie XFS i do chwili obecnej jest domyślne. Używając opcji noikeep, klastry i-węzłów są zwracane do puli wolnego miejsca.

source: Indicates that XFS is allowed to create inodes at any location in the filesystem, including those which will result in inode numbers occupying more than 32 bits of significance. This is provided for backwards compatibility, but causes problems for backup applications that cannot handle large inode numbers.
pl: Wskazuje, że XFS może tworzyć i-węzły w dowolnej lokalizacji systemu plików, łącznie z taką, która spowoduje zajęcie przez numer i-węzła więcej niż 32 bitów znaczących. Jest ona udostępniona w celu kompatybilności wstecznej, ale wywołuje problemy w przypadku aplikacji do kopii zapasowych, które nie potrafią obsłużyć dużych numerów i-węzłów.
