Repository: eurolinux-enterprise-linux-sources/man-pages-pl
Catalog: src/po/man8/mount.8.po
Languages: pl

source: December 2004
pl: grudzień 2004

source: System Administration
pl: Administracja systemem

source: NAME
pl: NAZWA

source: mount - mount a filesystem
pl: mount - montuje system plików

source: SYNOPSIS
pl: SKŁADNIA

source: B<mount -a> [B<-fFnrsvw>] [B<-t> I<vfstype>] [B<-O> I<optlist>]
pl: B<mount -a> [B<-fFnrsvw>] [B<-t> I<typ-systemu>] [B<-O> I<lista-opcji>]

source: B<mount> [B<-fnrsvw>] [B<-o> I<option>[B<,>I<option>]...] I<device>|I<dir>
pl: B<mount> [B<-fnrsvw>] [B<-o> I<opcje>[B<,>I<opcje>]...] I<urządzenie>|I<katalog>

source: B<mount> [B<-fnrsvw>] [B<-t> I<vfstype>B<]> [B<-o> I<options>] I<device dir>
pl: B<mount> [B<-fnrsvw>] [B<-t> I<typ-systemu>] [B<-o> I<opcje>] I<urządzenie katalog>

source: DESCRIPTION
pl: OPIS

source: All files accessible in a Unix system are arranged in one big tree, the file hierarchy, rooted at B</>. These files can be spread out over several devices. The B<mount> command serves to attach the filesystem found on some device to the big file tree. Conversely, the B<umount>(8) command will detach it again.
pl: Wszystkie pliki dostępne w systemie Unix są zorganizowane w jednym wielkim drzewie, hierarchii plików, zakorzenionej w B</>. Pliki te mogą być położone na wielu urządzeniach. Polecenie B<mount> umożliwia przyłączenie systemu plików znajdującego się na danym urządzeniu do wielkiego drzewa plików. Odwrotnie, polecenie B<umount>(8) powoduje odłączenie go.

source: The standard form of the B<mount> command, is
pl: Standardowa postać polecenia B<mount> to

source: B<mount -t>I< type device dir>
pl: B<mount -t>I< typ urządzenie katalog>

source: This tells the kernel to attach the filesystem found on I<device> (which is of type I<type>) at the directory I<dir>. The previous contents (if any) and owner and mode of I<dir> become invisible, and as long as this filesystem remains mounted, the pathname I<dir> refers to the root of the filesystem on I<device>.
pl: Nakazuje jądru, by przyłączyło system plików znaleziony na danym I<urządzeniu> (które jest typu I<typ>) w zadanym I<katalogu>. Poprzednia zawartość (jeśli istniała) i właściciel oraz prawa katalogu I<katalog> stają się niewidzialne na czas przyłączenia (zamontowania) nowego systemu plików. W tym czasie ścieżka I<katalog> odnosi się do korzenia systemu plików na podanym I<urządzeniu>.

source: If only directory or device is given, for example:
pl: Jeśli podano jedynie urządzenie lub katalog, na przykład:

source: B<mount /dir>
pl: B<mount /katalog>

source: then mount looks for a mountpoint and if not found then for a device in the /etc/fstab file.
pl: to mount szuka punktu montowania, a jeśli go nie znajdzie, szuka urządzenia w pliku /etc/fstab.

source: B<The listing and help.>
pl: B<Wypisywanie i pomoc.>

source: Three forms of invocation do not actually mount anything:
pl: Trzy formy wywołania niczego faktycznie nie montują:

source: prints a help message
pl: wypisuje komunikat pomocy

source: prints a version string
pl: wypisuje wersję

source: B<mount >[B<-l>] [B<-t >I<type>]
pl: B<mount >[B<-l>] [B<-t >I<typ>]

source: lists all mounted filesystems (of type I<type>). The option -l adds the labels in this listing. See below.
pl: pokazuje listę wszystkich zamontowanych systemów plików (typu I<typ>). Opcja -l ujmuje w zestawieniu również etykiety. Patrz niżej.

source: B<The device indication.>
pl: B<Wskazanie urządzenia.>

source: Most devices are indicated by a file name (of a block special device), like I</dev/sda1>, but there are other possibilities. For example, in the case of an NFS mount, I<device> may look like I<knuth.cwi.nl:/dir>. It is possible to indicate a block special device using its volume B<LABEL> or B<UUID> (see the -L and -U options below).
pl: Większość urządzeń jest wskazywanych przez nazwę pliku (specjalnego urządzenia blokowego), jak np. I</dev/sda1>, lecz istnieją inne możliwości. Na przykład w wypadku montowania NFS, I<urządzenie> może wyglądać tak: I<knuth.cwi.nl:/katalog>. Specjalne urządzenie blokowe można wskazać podając jego etykietę (B<LABEL>) wolumenu lub B<UUID> (zob. opcje -L i -U poniżej).

source: The recommended setup is to use LABEL=E<lt>labelE<gt> or UUID=E<lt>uuidE<gt> tags rather than B</dev/disk/by-{label,uuid}> udev symlinks in the /etc/fstab file. The tags are more readable, robust and portable. The B<mount>(8) command internally uses udev symlinks, so the use symlinks in /etc/fstab has no advantage over LABEL=/UUID=. For more details see B<libblkid>(3).
pl: Zalecaną metodą jest używanie znaczników LABEL=E<lt>etykietaE<gt> lub UUID=E<lt>uuidE<gt>, zamiast dowiązań symbolicznych B</dev/disk/by-{label,uuid}> udev w pliku /etc/fstab. Znaczniki są bardziej czytelne, solidne i przenośne. Polecenie B<mount>(8) używa wewnętrznie dowiązań symbolicznych udev, tak więc ich używanie w /etc/fstab nie daje żadnej przewagi nad LABEL=/UUID=. Aby dowiedzieć się więcej, proszę zapoznać się z B<libblkid>(3).

source: Note that B<mount>(8) uses UUIDs as strings. The UUIDs from command line or B<fstab>(5) are not converted to internal binary representation. The string representation of the UUID should be based on lower case characters.
pl: Proszę zauważyć, że B<mount>(8) używa UUID-ów jako łańcuchów. UUID-y z wiersza poleceń lub B<fstab>(5) nie są konwertowane do wewnętrznej reprezentacji binarnej. Litery w reprezentacji łańcucha UUID powinny być małymi literami.

source: The I<proc> filesystem is not associated with a special device, and when mounting it, an arbitrary keyword, such as I<proc> can be used instead of a device specification. (The customary choice I<none> is less fortunate: the error message `none busy' from B<umount> can be confusing.)
pl: System plików I<proc> nie jest związany z żadnym urządzeniem specjalnym i podczas jego montowania zamiast nazwy urządzenia można użyć dowolnego słowa kluczowego, np. I<proc> (zwyczajowy wybór I<none> jest mniej udany: komunikat błędu `none busy' od B<umount> może być mylący).

source: B<The /etc/fstab, /etc/mtab and /proc/mounts files.>
pl: B<Pliki /etc/fstab, /etc/mtab i /proc/mounts.>

source: The file I</etc/fstab> (see B<fstab>(5)), may contain lines describing what devices are usually mounted where, using which options.
pl: Plik I</etc/fstab> (zobacz B<fstab>(5)), może zawierać wiersze opisujące, jakie urządzenia gdzie są zazwyczaj montowane i przy użyciu jakich opcji.

source: The command
pl: Polecenie

source: B<mount -a> [B<-t> I<type>] [B<-O> I<optlist>]
pl: B<mount -a> [B<-t> I<typ>] [B<-O> I<lista-opcji>]

source: (usually given in a bootscript) causes all filesystems mentioned in I<fstab> (of the proper type and/or having or not having the proper options) to be mounted as indicated, except for those whose line contains the B<noauto> keyword. Adding the B<-F> option will make mount fork, so that the filesystems are mounted simultaneously.
pl: (zwykle podawane w skryptach startowych) powoduje zamontowanie wszystkich systemów plików (danego typu) wymienionych w I<fstab>, poza tymi, których wpisy zawierają słowo kluczowe B<noauto>. Podanie opcji B<-F> spowoduje, że mount się rozdzieli na kilka procesów, tak że systemy plików będą montowane równocześnie.

source: When mounting a filesystem mentioned in I<fstab> or I<mtab>, it suffices to give only the device, or only the mount point.
pl: Podczas montowania systemu plików wymienionego w I<fstab> lub I<mtab>, wystarczy podać tylko nazwę urządzenia lub tylko punkt montowania.

source: The programs B<mount> and B<umount> maintain a list of currently mounted filesystems in the file I</etc/mtab>. If no arguments are given to B<mount>, this list is printed.
pl: Programy B<mount> i B<umount> zarządzają listą aktualnie zamontowanych systemów plików w pliku I</etc/mtab>. Jeśli nie podano żadnych argumentów do B<mount>, lista ta jest wypisywana.

source: The B<mount> program does not read the I</etc/fstab> file if I<device> (or LABEL/UUID) and I<dir> are specified. For example:
pl: Program B<mount> nie odczytuje pliku I</etc/fstab>, jeśli podano I<urządzenie> (lub LABEL/UUID) i I<katalog>. Na przykład:

source: B<mount /dev/foo /dir>
pl: B<mount /dev/foo /katalog>

source: If you want to override mount options from I</etc/fstab> you have to use:
pl: Aby przesłonić opcje montowania z I</etc/fstab> konieczne jest użycie:

source: B<mount device|dir -o E<lt>optionsE<gt>>
pl: B<mount urządzenie|katalog -o E<lt>opcjeE<gt>>

source: and then the mount options from command line will be appended to the list of options from I</etc/fstab>. The usual behaviour is that the last option wins if there is more duplicated options.
pl: po czym opcje montowania z wiersza poleceń zostaną dodane do listy opcji z I</etc/fstab>. Zwykłym zachowaniem jest działanie ostatniej opcji, jeśli opcje się powtarzają.

source: When the I<proc> filesystem is mounted (say at I</proc>), the files I</etc/mtab> and I</proc/mounts> have very similar contents. The former has somewhat more information, such as the mount options used, but is not necessarily up-to-date (cf. the B<-n> option below). It is possible to replace I</etc/mtab> by a symbolic link to I</proc/mounts>, and especially when you have very large numbers of mounts things will be much faster with that symlink, but some information is lost that way, and in particular using the "user" option will fail.
pl: Gdy zamontowany jest system plików I<proc> (powiedzmy, że w I</proc>), pliki I</etc/mtab> i I</proc/mounts> mają bardzo podobną zawartość. Pierwszy ma trochę więcej informacji, takich jak opcje montowania, lecz niekoniecznie jest aktualny. (zobacz opcję B<-n> poniżej). Możliwe jest zastąpienie I</etc/mtab> dowiązaniem symbolicznym do I</proc/mounts>, co, szczególnie jeśli posiada się bardzo dużą liczbę montowań, będzie znacznie szybsze z użyciem dowiązania, ale w ten sposób tracona jest część danych, a w szczególności użycie opcji "user" nie będzie działać.

source: B<The non-superuser mounts.>
pl: B<Montowanie przez zwykłych użytkowników.>

source: Normally, only the superuser can mount filesystems. However, when I<fstab> contains the B<user> option on a line, anybody can mount the corresponding system.
pl: Tradycyjnie, tylko superużytkownik może montować systemy plików. Jednak jeśli I<fstab> w danym wierszu zawiera opcję B<user>, to każdy może zamontować odpowiadający temu wpisowi system plików.

source: Thus, given a line
pl: Tak więc, jeśli mamy wiersz

source: any user can mount the iso9660 filesystem found on his CDROM using the command
pl: to dowolny użytkownik może zamontować system plików iso9660 umieszczony na CD-ROM-ie, posługując się poleceniem

source: or
pl: lub

source: For more details, see B<fstab>(5). Only the user that mounted a filesystem can unmount it again. If any user should be able to unmount, then use B<users> instead of B<user> in the I<fstab> line. The B<owner> option is similar to the B<user> option, with the restriction that the user must be the owner of the special file. This may be useful e.g. for I</dev/fd> if a login script makes the console user owner of this device. The B<group> option is similar, with the restriction that the user must be member of the group of the special file.
pl: Szczegóły opisuje B<fstab>(5). Tylko użytkownik, który zamontował system plików może ponownie go odmontować. Jeżeli zachodzi potrzeba, by odmontowywać mógł każdy, w odpowiednim wierszu I<fstab> należy zamiast B<user> wpisać B<users>. Opcja B<owner> przypomina opcję B<user>, poza tym, że dany użytkownik musi być właścicielem odpowiedniego pliku specjalnego. Jest przydatna np. w przypadku I</dev/fd> jeśli skrypt zgłoszeniowy (login script) czyni danego użytkownika korzystającego z konsoli właścicielem tego urządzenia. Opcja B<group> jest podobna, z tym ograniczeniem, że użytkownik musi być członkiem grupy pliku specjalnego.

source: B<The bind mounts.>
pl: B<Montowanie używając podpięcia (bind).>

source: Since Linux 2.4.0 it is possible to remount part of the file hierarchy somewhere else. The call is
pl: Od wersji 2.4.0 Linuksa możliwe jest ponowne zamontowanie części systemu plików w innym miejscu. Służy do tego wywołanie:

source: B<mount --bind> I<olddir newdir>
pl: B<mount --bind> I<stary-katalog nowy-katalog>

source: or shortoption
pl: lub krótka opcja

source: B<mount -B> I<olddir newdir>
pl: B<mount -B> I<stary-katalog nowy-katalog>

source: or fstab entry is:
pl: lub wpis fstab:

source: I</olddir> I</newdir> B<none bind>
pl: I</stary-katalog> I</nowy-katalog> B<none bind>

source: After this call the same contents is accessible in two places. One can also remount a single file (on a single file). It's also possible to use the bind mount to create a mountpoint from a regular directory, for example:
pl: Po takim wywołaniu, ta sama zawartość jest dostępna w dwóch miejscach. Można również zamontować ponownie pojedynczy plik (w pojedynczym pliku). Jest także możliwe użycie montowania "bind" do utworzenia punktu montowania ze zwykłego katalogu, na przykład:

source: The bind mount call attaches only (part of) a single filesystem, not possible submounts. The entire file hierarchy including submounts is attached a second place using
pl: Wywołanie montowania za pomocą podpięcia dołącza tylko (część) pojedynczego systemu plików, bez możliwych montowań znajdujących się poniżej. Cała hierarchia plików, uwzględniając takie montowania jest dołączana w drugie miejsce za pomocą

source: B<mount --rbind> I<olddir newdir>
pl: B<mount --rbind> I<stary-katalog nowy-katalog>

source: B<mount -R> I<olddir newdir>
pl: B<mount -R> I<stary-katalog nowy-katalog>

source: Note that the filesystem mount options will remain the same as those on the original mount point, and cannot be changed by passing the -o option along with --bind/--rbind. The mount options can be changed by a separate remount command, for example:
pl: Proszę zauważyć, że opcje montowania systemu plików pozostaną takie same jak te pierwotnego punktu montowania i nie mogą być zmienione przez podanie opcji -o razem z --bind/--rbind. Opcje montowania mogą zostać zmienione oddzielnym poleceniem ponownego montowania, na przykład:

source: B<mount -o remount,ro> I<newdir>
pl: B<mount -o remount,ro> I<nowy-katalog>

source: Note that behavior of the remount operation depends on the /etc/mtab file. The first command stores the 'bind' flag to the /etc/mtab file and the second command reads the flag from the file. If you have a system without the /etc/mtab file or if you explicitly define source and target for the remount command (then mount(8) does not read /etc/mtab), then you have to use bind flag (or option) for the remount command too. For example:
pl: Proszę zauważyć, że zachowanie opcji ponownego montowania zależy od pliku /etc/mtab. Pierwsze polecenie przechowuje flagę "bind" w pliku /etc/mtab, a drugie polecenie odczytuje flagę z pliku. Jeśli bieżący system nie posiada pliku /etc/mtab lub jeśli jawnie zdefiniowano źródło i przeznaczenie do polecenia ponownego montowania (a więc mount(8) nie odczyta /etc/mtab), konieczne jest użycia flagi (lub opcji) bind również do poleceń ponownego montowania. Przykładowo:

source: B<mount -o remount,ro,bind> I<olddir newdir>
pl: B<mount -o remount,ro,bind> I<stary-katalog nowy-katalog>

source: B<The move operation.>
pl: B<Operacja przenoszenia.>

source: Since Linux 2.5.1 it is possible to atomically move a B<mounted tree> to another place. The call is
pl: Od wersji 2.5.1. Linuksa możliwe jest nierozdzielne (atomically) przeniesienie B<zamontowanego drzewa> w inne miejsce. Wywołaniem jest

source: B<mount --move> I<olddir newdir>
pl: B<mount --move> I<stary-katalog nowy-katalog>

source: B<mount -M> I<olddir newdir>
pl: B<mount -M> I<stary-katalog nowy-katalog>

source: This will cause the contents which previously appeared under olddir to be accessed under newdir. The physical location of the files is not changed. Note that the I<olddir> has to be a mountpoint.
pl: Spowoduje to pojawienie się zawartości, która wcześniej znajdowała się w starym-katalogu, w nowym-katalogu. Fizyczne położenie plików nie zmienia się. Proszę zauważyć, że I<stary-katalog> musi być punktem montowania.

source: B<The shared subtrees operations.>
pl: B<Współdzielone operacje na poddrzewach.>

source: Since Linux 2.6.15 it is possible to mark a mount and its submounts as shared, private, slave or unbindable. A shared mount provides ability to create mirrors of that mount such that mounts and umounts within any of the mirrors propagate to the other mirror. A slave mount receives propagation from its master, but any not vice-versa. A private mount carries no propagation abilities. A unbindable mount is a private mount which cannot be cloned through a bind operation. Detailed semantics is documented in Documentation/filesystems/sharedsubtree.txt file in the kernel source tree.
pl: Od Linuksa 2.6.15 możliwe jest oznaczenie montowania i jego podmontowań jako współdzielone (shared), prywatne (private), podrzędne (slave) i niepodpinalne (unbindable). Montowania współdzielone udostępniają możliwość tworzenia kopii takich montowań tak, że montowania i odmontowania którejkolwiek z kopii dotyczy ich wszystkich. Montowania podrzędne otrzymują montowania i odmontowywania z montowania nadrzędnego, ale nie działa to w drugą stronę. Montowania prywatne nie posiadają powyższych właściwości. Montowanie niepodpinalne jest montowaniem prywatnym, które nie może zostać sklonowane za pomocą operacji podpięcia (bind). Szczegółowe wyjaśnienia można znaleźć w pliku dokumentacji Documentation/filesystems/sharedsubtree.txt w drzewie źródeł jądra.

source: B<mount --make-shared >I<mountpoint> B<mount --make-slave >I<mountpoint> B<mount --make-private >I<mountpoint> B<mount --make-unbindable >I<mountpoint>
pl: B<mount --make-shared >I<punkt-montowania> B<mount --make-slave >I<punkt-montowania> B<mount --make-private >I<punkt-montowania> B<mount --make-unbindable >I<punkt-montowania>

source: The following commands allows one to recursively change the type of all the mounts under a given mountpoint.
pl: Następujące polecenia pozwalają na rekursywną zmianę typu wszystkich montowań pod danym punktem montowania.

source: B<mount --make-rshared >I<mountpoint> B<mount --make-rslave >I<mountpoint> B<mount --make-rprivate >I<mountpoint> B<mount --make-runbindable >I<mountpoint>
pl: B<mount --make-rshared >I<punkt-montowania> B<mount --make-rslave >I<punkt-montowania> B<mount --make-rprivate >I<punkt-montowania> B<mount --make-runbindable >I<punkt-montowania>

source: COMMAND LINE OPTIONS
pl: OPCJE WIERSZA POLECEŃ

source: The full set of mount options used by an invocation of B<mount> is determined by first extracting the mount options for the filesystem from the I<fstab> table, then applying any options specified by the B<-o> argument, and finally applying a B<-r> or B<-w> option, when present.
pl: Pełny zestaw opcji używanych przy wywoływaniu B<mount> jest ustalany przez pobranie opcji dla danego systemu plików z I<fstab>, a następnie zastosowanie wszelkich opcji podanych argumentem B<-o>, a na koniec opcji B<-r> lub B<-w>, o ile istnieją.

source: Command line options available for the B<mount> command:
pl: Opcje wiersza poleceń, dostępne do polecenia B<mount>:

source: Output version.
pl: Wypisuje wersję.

source: Print a help message.
pl: Wypisuje komunikat pomocy.

source: Verbose mode.
pl: Tryb szczegółowy.

source: Mount all filesystems (of the given types) mentioned in I<fstab>.
pl: Montuje wszystkie systemy plików (zadanych typów) ujęte w I<fstab>.

source: (Used in conjunction with B<-a>.) Fork off a new incarnation of mount for each device. This will do the mounts on different devices or different NFS servers in parallel. This has the advantage that it is faster; also NFS timeouts go in parallel. A disadvantage is that the mounts are done in undefined order. Thus, you cannot use this option if you want to mount both I</usr> and I</usr/spool>.
pl: (Użyte w połączeniu z B<-a>.) Dla każdego urządzenia tworzy nowy proces równoległy mount. Powoduje to równoległy przebieg montowania różnych urządzeń lub różnych serwerów NFS. Zaletą jest większa szybkość: także przekroczenia czasu dla NFS będą wyznaczane równolegle. Wadą jest to, że montowania wykonywane są w niezdefiniowanej kolejności. Nie można zatem zastosować tej opcji do równoczesnego montowania I</usr> i I</usr/spool>.

source: Causes everything to be done except for the actual system call; if it's not obvious, this ``fakes'' mounting the filesystem. This option is useful in conjunction with the B<-v> flag to determine what the B<mount> command is trying to do. It can also be used to add entries for devices that were mounted earlier with the -n option. The -f option checks for existing record in /etc/mtab and fails when the record already exists (with regular non-fake mount, this check is done by kernel).
pl: Powoduje wykonywanie wszystkiego poza faktycznym wywołaniem funkcji systemowej. Jeśli nie jest to oczywiste: "udaje" to montowanie systemu plików. W połączeniu z flagą B<-v> przydaje się do ustalenia, co usiłuje zrobić polecenie B<mount>. Może być też używana do dodawania wpisów dla urządzeń, które zamontowano wcześniej z opcją -n. Opcje -f sprawdza istnienie rekordu w /etc/mtab i zawodzi, jeśli rekord już istnieje (w przypadku zwykłych, nieudawanych montowań, to sprawdzenie jest wykonywane przez jądro).

source: Don't call the /sbin/mount.E<lt>filesystemE<gt> helper even if it exists.
pl: Nie wywołuje programu pomocniczego /sbin/mount.E<lt>system-plikówE<gt>, nawet jeśli istnieje.

source: Add the labels in the mount output. Mount must have permission to read the disk device (e.g. be suid root) for this to work. One can set such a label for ext2, ext3 or ext4 using the B<e2label>(8) utility, or for XFS using B<xfs_admin>(8), or for reiserfs using B<reiserfstune>(8).
pl: Dokłada etykiety do wyjścia wypisywanego przez mount. Żeby opcja ta mogła działać, mount musi mieć prawo odczytu urządzania dyskowego (np. suid root). Można ustawić taką etykietę dla ext2, ext3 lub ext4 za pomocą narzędzia B<e2label>(8), zaś dla XFS - stosując B<xfs_admin>(8) lub dla reiserfs używając B<reiserfstune>(8).

source: Mount without writing in I</etc/mtab>. This is necessary for example when I</etc> is on a read-only filesystem.
pl: Montuje bez zapisywania w I</etc/mtab>. Jest to niezbędne na przykład gdy I</etc> znajduje się na systemie plików tylko do odczytu.

source: Don't canonicalize paths. The mount command canonicalizes all paths (from command line or fstab) and stores canonicalized paths to the I</etc/mtab> file. This option can be used together with the B<-f> flag for already canonicalized absolut paths.
pl: Nie normalizuje ścieżek. Polecenie montowania normalizuje wszystkie ścieżki (z wiersza poleceń lub fstab) i przechowuje znormalizowane ścieżki w pliku I</etc/mtab>. Opcja może być użyta razem z B<-f> do już znormalizowanych ścieżek absolutnych.

source: B<-p, --pass-fd >I<num>
pl: B<-p, --pass-fd >I<numer>

source: In case of a loop mount with encryption, read the passphrase from file descriptor I<num> instead of from the terminal.
pl: Jeżeli montowanie wymaga podania hasła, to jest ono czytane z deskryptora pliku I<numer> zamiast z terminala.

source: Tolerate sloppy mount options rather than failing. This will ignore mount options not supported by a filesystem type. Not all filesystems support this option. This option exists for support of the Linux autofs-based automounter.
pl: Toleruje nieodpowiednie opcje montowania, zamiast kończyć pracę niepowodzeniem. Powoduje to ignorowanie opcji montowania, które nie są obsługiwane przez dany system plików. Nie wszystkie systemy plików rozpoznają tę opcję. Istnieje ona do obsługi linuksowego narzędzia automatycznego montowania opartego na autofs.
