Repository: eurolinux-enterprise-linux-sources/man-pages-pl
Catalog: src/po/man8/mount.8.po
Languages: pl

source: Turn on the I<quiet> flag. Attempts to chown or chmod files do not return errors, although they fail. Use with caution!
pl: Włącza flagę I<quiet> (cicho). Próby chown lub chmod nie zwracają błędów, chociaż się nie udają. Używaj ostrożnie!

source: If set, the execute permission bits of the file will be allowed only if the extension part of the name is .EXE, .COM, or .BAT. Not set by default.
pl: Jeśli ustawiona, bit wykonywalności pliku jest dozwolony tylko, jeśli część rozszerzenia nazwy jest jedną z .EXE, .COM lub .BAT. Domyślnie nie ustawiona.

source: If set, ATTR_SYS attribute on FAT is handled as IMMUTABLE flag on Linux. Not set by default.
pl: Jeśli ustawiona, atrybut ATTR_SYS w FAT jest obsługiwany jak flaga IMMUTABLE w Linuksie. Domyślnie nie ustawiona.

source: If set, the filesystem will try to flush to disk more early than normal. Not set by default.
pl: Jeśli ustawiona, system plików będzie starał się opróżnić bufory na dysk wcześniej niż zwykle. Domyślnie nie ustawione.

source: Use the "free clusters" value stored on FSINFO. It'll be used to determine number of free clusters without scanning disk. But it's not used by default, because recent Windows don't update it correctly in some case. If you are sure the "free clusters" on FSINFO is correct, by this option you can avoid scanning disk.
pl: Używa wartości "wolnych klastrów" ("free clusters"), przechowywanej w FSINFO. Jest ona używana do pozyskania liczby wolnych klastrów bez skanowania dysku. Nie jest ona jednak domyślnie używana, ponieważ ostatnie wersje Windows niekiedy nie aktualizują jej poprawnie. W przypadku przekonania, że wartość owych "wolnych klastrów" w FSINFO jest poprawna, używając tej opcji można zapobiec skanowaniu dysku.

source: Various misguided attempts to force Unix or DOS conventions onto a FAT filesystem.
pl: Różne bezmyślne próby wymuszenia konwencji Uniksa lub DOS-u na systemie plików FAT.

source: Mount options for hfs
pl: Opcje montowania do hpfs

source: Set the creator/type values as shown by the MacOS finder used for creating new files. Default values: '????'.
pl: Ustawia wartości creator/type pokazywane przez MacOS-owy Finder, używane do tworzenia nowych plików. Domyślne wartości: "????".

source: Set the umask used for all directories, all regular files, or all files and directories. Defaults to the umask of the current process.
pl: Ustawia umask, używany do wszystkich katalogów, wszystkich zwykłych plików lub wszystkich plików i katalogów. Domyślnie jest to umask bieżącego procesu).

source: Select the CDROM session to mount. Defaults to leaving that decision to the CDROM driver. This option will fail with anything but a CDROM as underlying device.
pl: Ustawia sesję CD-ROM-u do zamontowania. Domyślnie, decyzja jest pozostawiana sterownikowi CD-ROM-u. Opcja nie powiedzie się, jeśli urządzeniem będzie coś innego niż CD-ROM.

source: Select partition number n from the device. Only makes sense for CDROMs. Defaults to not parsing the partition table at all.
pl: Wybiera numer partycji n z urządzenia. Ma sens tylko w przypadku CD-ROM-ów. Domyślnie, tablica partycji nie jest w ogóle przetwarzana.

source: Don't complain about invalid mount options.
pl: Nie informuje o nieprawidłowych opcjach montowania.

source: Mount options for hpfs
pl: Opcje montowania do hpfs

source: Set the owner and group of all files. (Default: the uid and gid of the current process.)
pl: Ustawia właściciela i grupę wszystkich plików (domyślnie: uid i gid bieżącego procesu).

source: Convert all files names to lower case, or leave them. (Default: B<case=lower>.)
pl: Konwertuje wszystkie nazwy plików na małe litery lub pozostawia bez zmian (domyślnie: B<case=lower>).

source: For B<conv=text>, delete some random CRs (in particular, all followed by NL) when reading a file. For B<conv=auto>, choose more or less at random between B<conv=binary> and B<conv=text>. For B<conv=binary>, just read what is in the file. This is the default.
pl: Do B<conv=text>, usuwa losowe znaki CR (konkretnie wszystkie, po których występuje NL) podczas odczytu pliku. Do B<conv=auto>, wybiera mniej lub bardziej losowo między B<conv=binary> i B<conv=text>. Do B<conv=binary>, po prostu czyta to, co jest w pliku. Tak jest domyślnie.

source: Do not abort mounting when certain consistency checks fail.
pl: Nie przerywa montowania gdy zawiodą pewne kontrole spójności.

source: Mount options for iso9660
pl: Opcje montowania do iso9660

source: ISO 9660 is a standard describing a filesystem structure to be used on CD-ROMs. (This filesystem type is also seen on some DVDs. See also the I<udf> filesystem.)
pl: ISO 9660 jest standardem opisującym strukturę systemu plików na CD-ROM-ach (system ten jest również wykorzystywany na niektórych płytach DVD; patrz również system plików I<udf>).

source: Normal I<iso9660> filenames appear in a 8.3 format (i.e., DOS-like restrictions on filename length), and in addition all characters are in upper case. Also there is no field for file ownership, protection, number of links, provision for block/character devices, etc.
pl: Normalne nazwy plików I<iso9660> pojawiają się w formacie 8.3 (tzn. występują DOS-owe ograniczenia długości nazw plików), a w dodatku wszystkie znaki pisane są wielkimi literami. Poza tym nie ma pola właściciela, ochrony, liczby dowiązań, zastrzeżeń dla urządzeń znakowych/blokowych, itd.

source: Rock Ridge is an extension to iso9660 that provides all of these UNIX-like features. Basically there are extensions to each directory record that supply all of the additional information, and when Rock Ridge is in use, the filesystem is indistinguishable from a normal UNIX filesystem (except that it is read-only, of course).
pl: Rozszerzeniem iso9660 jest Rock Ridge, który udostępnia wszystkie te uniksopodobne właściwości. Najprościej mówiąc, dla każdego wpisu katalogowego istnieją w nim rozszerzenia, które uzupełniają wszystkie informacje. Gdy używane jest Rock Ridge, system plików jest nieodróżnialny od normalnego uniksowego systemu plików (poza tym, że jest tylko do odczytu, oczywiście).

source: Disable the use of Rock Ridge extensions, even if available. Cf.\& B<map>.
pl: Wyłącza korzystanie z rozszerzeń Rock Ridge, nawet jeśli są dostępne. Zob.\& B<map>.

source: Disable the use of Microsoft Joliet extensions, even if available. Cf.\& B<map>.
pl: Wyłącza korzystanie z rozszerzeń Joliet firmy Microsoft, nawet jeśli są dostępne. Zob.\& B<map>.

source: With B<check=relaxed>, a filename is first converted to lower case before doing the lookup. This is probably only meaningful together with B<norock> and B<map=normal>. (Default: B<check=strict>.)
pl: Z B<check=relaxed>, nazwa pliku przed dokonywaniem podglądu jest najpierw przekształcana na małe litery. Prawdopodobnie ma to znaczenie tylko razem z B<norock> i B<map=normal>. (Domyślnie: B<check=strict>.)

source: Give all files in the filesystem the indicated user or group id, possibly overriding the information found in the Rock Ridge extensions. (Default: B<uid=0,gid=0>.)
pl: Nadaje wszystkim plikom systemu plików wskazany identyfikator użytkownika i grupy, być może przesłaniając informacje znalezione w rozszerzeniach Rock Ridge. (Domyślnie: B<uid=0,gid=0>.)

source: For non-Rock Ridge volumes, normal name translation maps upper to lower case ASCII, drops a trailing `;1', and converts `;' to `.'. With B<map=off> no name translation is done. See B<norock>. (Default: B<map=normal>.) B<map=acorn> is like B<map=normal> but also apply Acorn extensions if present.
pl: Dla wolumenów typu innego niż Rock Ridge, normalna translacja nazwy odwzorowuje wielkie litery ASCII na małe, porzuca kończące `;1' i zamienia `;' na `.'. Z B<map=off> nie jest dokonywana konwersja nazw. Zobacz B<norock>. (Domyślnie: B<map=normal>.) B<map=acorn> jest podobne do B<map=normal>, ale stosuje także rozszerzenia Acorn, jeśli występują.

source: For non-Rock Ridge volumes, give all files the indicated mode. (Default: read permission for everybody.) Since Linux 2.1.37 one no longer needs to specify the mode in decimal. (Octal is indicated by a leading 0.)
pl: Dla wolumenów typu innego niż Rock Ridge, nadaje wszystkim plikom wskazane prawa. (Domyślnie: prawa dla odczytu dla wszystkich.) Od Linuksa 2.1.37 nie trzeba już podawać trybu dziesiętnie. (Tryb ósemkowy jest wskazywany przez 0 na początku).

source: Also show hidden and associated files. (If the ordinary files and the associated or hidden files have the same filenames, this may make the ordinary files inaccessible.)
pl: Pokazuje również pliki ukryte i powiązane (jeśli zwykłe pliki i pliki powiązane lub ukryte mają te same nazwy plików, może to uczynić zwykłe pliki niedostępnymi).

source: Set the block size to the indicated value. (Default: B<block=1024>.)
pl: Ustawia rozmiar bloku we wskazanym wolumenie. (Domyślnie: B<block=1024>.)

source: (Default: B<conv=binary>.) Since Linux 1.3.54 this option has no effect anymore. (And non-binary settings used to be very dangerous, possibly leading to silent data corruption.)
pl: (Domyślnie: B<conv=binary>.) Od Linuksa 1.3.54 opcja ta już nie działa. (A niebinarne ustawienia bywały bardzo niebezpieczne, często prowadziły do milczącego niszczenia danych).

source: If the high byte of the file length contains other garbage, set this mount option to ignore the high order bits of the file length. This implies that a file cannot be larger than 16MB.
pl: Jeśli starszy bajt długości pliku zawiera inne śmieci, warto ustawić tę opcję montowania, aby był ignorowany. Powoduje to, że maksymalny rozmiar pliku nie może być większy niż 16 MB.

source: Select number of session on multisession CD. (Since 2.3.4.)
pl: Wybiera numer sesji na CD wielosesyjnych. (Od 2.3.4.)

source: Session begins from sector xxx. (Since 2.3.4.)
pl: Sesja zaczyna się od sektora xxx. (Od 2.3.4.)

source: The following options are the same as for vfat and specifying them only makes sense when using discs encoded using Microsoft's Joliet extensions.
pl: Poniższe opcje są takie same jak do vfat i podawanie ich ma sens tylko przy używaniu płyt zakodowanych przy użyciu rozszerzeń Joliet firmy Microsoft.

source: Character set to use for converting 16 bit Unicode characters on CD to 8 bit characters. The default is iso8859-1.
pl: Zestaw znaków używany do konwersji z 16-bitowych znaków Unikodu na CD do 8-bitowych znaków. Domyślnie jest to iso8859-1.

source: Convert 16 bit Unicode characters on CD to UTF-8.
pl: Konwertuje 16-bitowe znaki Unikodu na CD do UTF-8.

source: Mount options for jfs
pl: Opcje montowania do jfs

source: B<iocharset=>I<name>
pl: B<iocharset=>I<nazwa>

source: Character set to use for converting from Unicode to ASCII. The default is to do no conversion. Use B<iocharset=utf8> for UTF8 translations. This requires CONFIG_NLS_UTF8 to be set in the kernel I<.config> file.
pl: Zestaw znaków, używany do konwersji z Unikodu do ASCII. Domyślnie konwersja nie jest przeprowadzana. Proszę użyć B<iocharset=utf8> w celu tłumaczeń UTF-8. Opcja wymaga ustawienia CONFIG_NLS_UTF8 w pliku jądra I<.config>.

source: B<resize=>I<value>
pl: B<resize=>I<wartość>

source: Resize the volume to I<value> blocks. JFS only supports growing a volume, not shrinking it. This option is only valid during a remount, when the volume is mounted read-write. The B<resize> keyword with no value will grow the volume to the full size of the partition.
pl: Zmienia wielkość woluminu do I<wartość> bloków. JFS obsługuje jedynie powiększanie woluminu, nie zmniejszanie go. Opcja jest prawidłowa tylko podczas ponownego montowania, gdy wolumin jest zamontowany do odczytu i zapisu. Słowo kluczowe B<resize> bez wartości, powiększy wolumin do pełnego rozmiaru partycji.

source: Do not write to the journal. The primary use of this option is to allow for higher performance when restoring a volume from backup media. The integrity of the volume is not guaranteed if the system abnormally abends.
pl: Nie zapisuje do dziennika. Głównym użyciem tej opcji jest możliwość uzyskania wyższej wydajności przy przywracaniu woluminu z kopii zapasowej. Integralność woluminu nie jest gwarantowana, jeśli system zostanie nieprawidłowo zamknięty.

source: Default. Commit metadata changes to the journal. Use this option to remount a volume where the B<nointegrity> option was previously specified in order to restore normal behavior.
pl: Domyślne. Zapisuje zmiany metadanych do dziennika. Można użyć tej opcji do ponownego zamontowania woluminu, gdy wcześniej użyto opcji B<nointegrity>, w celu przywrócenia normalnego zachowania.

source: Define the behaviour when an error is encountered. (Either ignore errors and just mark the filesystem erroneous and continue, or remount the filesystem read-only, or panic and halt the system.)
pl: Definiuje zachowanie przy napotkaniu błędu. (Albo ignoruje błędy, zaznaczając tylko system plików jako błędny i kontynuując, albo ponownie montuje system plików na tylko do odczytu, albo panikuje i zatrzymuje system.)

source: Mount options for minix
pl: Opcje montowania do miniksa

source: Mount options for msdos
pl: Opcje montowania do msdos

source: See mount options for fat. If the I<msdos> filesystem detects an inconsistency, it reports an error and sets the file system read-only. The filesystem can be made writable again by remounting it.
pl: Zobacz opcje do fat. Jeśli system plików I<msdos> wykryje niespójność, zgłasza błąd i ustawia system plików na tylko do odczytu. System plików może być znowu dostępny do zapisu przez ponowne zamontowanie.

source: Mount options for ncpfs
pl: Opcje montowania do ncpfs

source: Just like I<nfs>, the I<ncpfs> implementation expects a binary argument (a I<struct ncp_mount_data>) to the mount system call. This argument is constructed by B<ncpmount>(8) and the current version of B<mount> (2.12) does not know anything about ncpfs.
pl: Tak jak przy I<nfs>, implementacja I<ncpfs> oczekuje binarnego argumentu (I<struct ncp_mount_data>) funkcji systemowej mount. Argument ten jest konstruowany przez B<ncpmount>(8), a bieżąca wersja B<mount> (2.12) nic nie wie o ncpfs.

source: Mount options for nfs and nfs4
pl: Opcje montowania do nfs i nfs4

source: See the options section of the B<nfs>(5) man page (nfs-common package must be installed).
pl: Patrz sekcja opcji na stronie podręcznika B<nfs>(5) (pakiet nfs-common musi być zainstalowany).

source: The I<nfs> and I<nfs4> implementation expects a binary argument (a I<struct nfs_mount_data>) to the mount system call. This argument is constructed by B<mount.nfs>(8) and the current version of B<mount> (2.13) does not know anything about nfs and nfs4.
pl: Implementacja I<nfs> i I<nfs4> oczekuje binarnego argumentu (I<struct nfs_mount_data>) funkcji systemowej mount. Argument ten jest konstruowany przez B<mount.nfs>(8), a bieżąca wersja B<mount> (2.13) nic nie wie o nfs i nfs4.

source: Mount options for ntfs
pl: Opcje montowania do ntfs

source: Character set to use when returning file names. Unlike VFAT, NTFS suppresses names that contain nonconvertible characters. Deprecated.
pl: Zestaw znaków stosowany przy zwracaniu nazw plików. W przeciwieństwie do VFAT, NTFS eliminuje nazwy zawierające znaki nie dające się przekształcić. Przestarzałe.

source: B<nls=>I<name>
pl: B<nls=>I<nazwa>

source: New name for the option earlier called I<iocharset>.
pl: Nowa nazwa dla opcji zwanej wcześniej I<iocharset>.

source: Use UTF-8 for converting file names.
pl: Do konwersji nazw plików stosuje UTF-8.

source: For 0 (or `no' or `false'), do not use escape sequences for unknown Unicode characters. For 1 (or `yes' or `true') or 2, use vfat-style 4-byte escape sequences starting with ":". Here 2 give a little-endian encoding and 1 a byteswapped bigendian encoding.
pl: Dla 0 (lub `no' albo `false') nie używa specjalnych kodowań nieznanych znaków Unikodu. Dla 1 (lub `yes' albo `true') lub 2 używa 4-bajtowych sekwencji specjalnych w stylu vfat zaczynających się od ":". Liczba 2 oznacza kodowanie little-endian, a 1 - kodowanie big-endian, z odwróconymi bajtami.

source: If enabled (posix=1), the filesystem distinguishes between upper and lower case. The 8.3 alias names are presented as hard links instead of being suppressed. This option is obsolete.
pl: Jeśli jest włączone (posix=1), to system plików rozróżnia wielkie i małe litery. Nazwy zastępcze 8.3 są przedstawiane jako dowiązania twarde, a nie pomijane. Ta opcja jest przestarzała.

source: B<uid=>I<value>, B<gid=>I<value> and B<umask=>I<value>
pl: B<uid=>I<wartość>, B<gid=>I<wartość> i B<umask=>I<wartość>

source: Set the file permission on the filesystem. The umask value is given in octal. By default, the files are owned by root and not readable by somebody else.
pl: Ustawia prawa plików dla danego systemu. Wartość umask powinna być podana ósemkowo. Domyślnie właścicielem plików jest root i nikt inny nie może ich czytać.

source: Mount options for proc
pl: Opcje montowania do proc

source: These options are recognized, but have no effect as far as I can see.
pl: Opcje te są rozpoznawane, lecz o ile wiadomo, nie mają żadnego efektu.

source: Mount options for ramfs
pl: Opcje montowania do ramfs

source: Ramfs is a memory based filesystem. Mount it and you have it. Unmount it and it is gone. Present since Linux 2.3.99pre4. There are no mount options.
pl: Ramfs jest systemem plików działającym w pamięci. Wystarczy go zamontować - i pojawia się. Odmontowanie usuwa go. Obecny od Linuksa 2.3.99pre4. Nie posiada opcji montowania.

source: Mount options for reiserfs
pl: Opcje montowania do reiserfs

source: Reiserfs is a journaling filesystem.
pl: Reiserfs jest systemem plików z dziennikiem.

source: Instructs version 3.6 reiserfs software to mount a version 3.5 filesystem, using the 3.6 format for newly created objects. This filesystem will no longer be compatible with reiserfs 3.5 tools.
pl: Mówi wersji 3.6 oprogramowania reiserfs, aby zamontowała wersję 3.5 systemu plików, używając formatu 3.6 dla nowo utworzonych plików. Ten system plików nie będzie już zgodny z wersją 3.5 narzędzi reiserfs.

source: Choose which hash function reiserfs will use to find files within directories.
pl: Wybiera funkcję mieszającą (haszującą) do znajdowania plików w katalogach.

source: A hash invented by Yury Yu. Rupasov. It is fast and preserves locality, mapping lexicographically close file names to close hash values. This option should not be used, as it causes a high probability of hash collisions.
pl: Funkcja haszująca autorstwa Yury Yu. Rupasova. Jest szybka i zachowuje lokalizację, mapując nazwy plików bliskie w porządku leksykograficznym na bliskie sobie wartości funkcji. Z powodu wysokiego prawdopodobieństwa kolizji w haszowaniu, ta opcja nie powinna być używana.

source: A Davis-Meyer function implemented by Jeremy Fitzhardinge. It uses hash permuting bits in the name. It gets high randomness and, therefore, low probability of hash collisions at some CPU cost. This may be used if EHASHCOLLISION errors are experienced with the r5 hash.
pl: Funkcja Davis-Meyera zaimplementowana przez Jeremy'ego Fitzhardinge'a. Używa mieszania permutującego bity w nazwie pliku. Wykazuje dużą losowość wyników i teoretycznie małe prawdopodobieństwo kolizji. Może być używana, jeżeli funkcja r5 powoduje błędy EHASHCOLLISION.

source: A modified version of the rupasov hash. It is used by default and is the best choice unless the filesystem has huge directories and unusual file-name patterns.
pl: Zmodyfikowana wersja funkcji rupasov. Używana domyślnie i jest najlepszym wyborem, jeżeli system plików nie zawiera dużych katalogów i niezwykłych nazw plików.

source: Instructs I<mount> to detect which hash function is in use by examining the filesystem being mounted, and to write this information into the reiserfs superblock. This is only useful on the first mount of an old format filesystem.
pl: Powoduje, że I<mount> wykryje, która funkcja mieszająca jest używana, sprawdzając właśnie montowany system plików, i zapisze tę informację w superbloku systemu reiserfs. Ta opcja jest użyteczna przy pierwszym montowaniu systemu plików o starym formacie.

source: Tunes the block allocator. This may provide performance improvements in some situations.
pl: Stroi mechanizm przydzielania bloków. Może powodować w pewnych okolicznościach poprawienie wydajności systemu.

source: Disable the border allocator algorithm invented by Yury Yu. Rupasov. This may provide performance improvements in some situations.
pl: Wyłącza algorytm przydzielania granicznego wymyślony przez Yury'ego Yu. Rupasova. Może powodować w pewnych okolicznościach poprawienie wydajności systemu.

source: Disable journalling. This will provide slight performance improvements in some situations at the cost of losing reiserfs's fast recovery from crashes. Even with this option turned on, reiserfs still performs all journalling operations, save for actual writes into its journalling area. Implementation of I<nolog> is a work in progress.
pl: Wyłącza dziennik. Może w pewnych sytuacjach spowodować nieznaczne podniesienie wydajności systemu kosztem utracenia szybkiego odzyskiwania danych po krachu systemu. Nawet jeśli ta opcja jest włączona, reiserfs wciąż przeprowadza wszystkie operacje związane z dziennikiem, ale go nie zapisuje. Prace przy implementacji opcji I<nolog> wciąż trwają.

source: By default, reiserfs stores small files and `file tails' directly into its tree. This confuses some utilities such as B<LILO>(8). This option is used to disable packing of files into the tree.
pl: Domyślnie reiserfs przechowuje małe pliki i `końcówki plików' bezpośrednio w swoim drzewie. Jest to zachowanie mylące dla niektórych narzędzi użytkowych takich jak B<LILO>(8). Ta opcja wyłącza pakowanie plików do drzewa.

source: Replay the transactions which are in the journal, but do not actually mount the filesystem. Mainly used by I<reiserfsck>.
pl: Powtarza transakcje zapisane w dzienniku, ale nie montuje systemu plików. Głównie używane przez I<reiserfsck>.

source: B<resize=>I<number>
pl: B<resize=>I<liczba>

source: A remount option which permits online expansion of reiserfs partitions. Instructs reiserfs to assume that the device has I<number> blocks. This option is designed for use with devices which are under logical volume management (LVM). There is a special I<resizer> utility which can be obtained from I<ftp://ftp.namesys.com/pub/reiserfsprogs>.
pl: Opcje remontowania, która pozwala na rozszerzenie partycji reiserfs. Z tą opcją reiserfs przyjmuje, że na urządzeniu jest I<liczba> bloków. Opcja jest używana z urządzeniami zarządzanymi przez menedżera logicznych woluminów (LVM). Istnieje specjalne narzędzie I<resizer>, które można pobrać z I<ftp://ftp.namesys.com/pub/reiserfsprogs>.

source: This enables/disables the use of write barriers in the journaling code. barrier=none disables it, barrier=flush enables it. Write barriers enforce proper on-disk ordering of journal commits, making volatile disk write caches safe to use, at some performance penalty. The reiserfs filesystem does not enable write barriers by default. Be sure to enable barriers unless your disks are battery-backed one way or another. Otherwise you risk filesystem corruption in case of power failure.
pl: Włącza/wyłącza używanie barier zapisu w kodzie dziennika. barrier=none wyłącza je, barrier=flush włącza. Bariery zapisu wymuszają właściwą kolejność wpisów dziennika na dysku, czyniąc ulotne bufory zapisu dysku bezpieczne w użyciu, kosztem pewnego obniżenia wydajności. System plików reiserfs nie włącza domyślnie barier zapisu. Proszę się upewnić, że bariery są włączone, chyba że dyski mają w jakiś sposób zabezpieczone zasilanie. W przeciwnym wypadku istnieje ryzyko błędu w systemie plików w przypadku nagłego braku zasilania.

source: Mount options for romfs
pl: Opcje montowania do romfs
