Repository: eurolinux-enterprise-linux-sources/man-pages-pl
Catalog: src/po/man8/mount.8.po
Languages: pl

source: Do not allow set-user-identifier or set-group-identifier bits to take effect. (This seems safe, but is in fact rather unsafe if you have suidperl(1) installed.)
pl: Nie pozwala na działanie bitów set-user-id i set-group-id (wygląda na bezpieczną, ale w rzeczywistości raczej taka nie jest jeśli zainstalowano suidperl(1)).

source: Turn on the silent flag.
pl: Włącza flagę "cicho".

source: Turn off the silent flag.
pl: Wyłącza flagę "cicho".

source: Allow an ordinary (i.e., non-root) user to mount the filesystem if he is the owner of the device. This option implies the options B<nosuid> and B<nodev> (unless overridden by subsequent options, as in the option line B<owner,dev,suid>).
pl: Pozwala każdemu zwykłemu (tzn. nie rootowi) użytkownikowi na zamontowanie i odmontowanie systemu plików, jeśli jest on właścicielem urządzenia. Opcja ta implikuje opcje B<nosuid>, i B<nodev> (chyba że są przesłaniane przez następne opcje, jak w linii B<owner,dev,suid>).

source: Attempt to remount an already-mounted filesystem. This is commonly used to change the mount flags for a filesystem, especially to make a readonly filesystem writable. It does not change device or mount point.
pl: Usiłuje ponownie zamontować już zamontowany system plików. Często używane do zmiany flag montowania systemu, szczególnie aby umożliwić zapis na systemach tylko do odczytu. Nie zmienia urządzenia ani punktu montowania.

source: The remount functionality follows the standard way how the mount command works with options from fstab. It means the mount command doesn't read fstab (or mtab) only when a I<device> and I<dir> are fully specified.
pl: Funkcja ponownego montowania przestrzega standardowego sposobu, w jaki polecenie mount działa z opcjami z fstab. Oznacza to, że polecenie mount nie odczytuje fstab (lub mtab) wyłącznie wtedy, jeśli podano I<urządzenie> i I<katalog> w sposób kompletny.

source: B<mount -o remount,rw /dev/foo /dir>
pl: B<mount -o remount,rw /dev/foo /katalog>

source: After this call all old mount options are replaced and arbitrary stuff from fstab is ignored, except the loop= option which is internally generated and maintained by the mount command.
pl: Po tym wywołaniu wszystkie stare opcje montowania są zastępowane, a arbitralne rzeczy z fstab są ignorowane, z wyjątkiem opcji loop=, która jest tworzona i zarządzana wewnętrznie przez polecenie mount.

source: B<mount -o remount,rw /dir>
pl: B<mount -o remount,rw /katalog>

source: After this call mount reads fstab (or mtab) and merges these options with options from command line ( B<-o> ).
pl: Po tym wywołaniu mount odczytuje fstab (lub mtab) i łączy te opcje z opcjami podanymi w wierszu poleceń (B<-o>).

source: Mount the filesystem read-only.
pl: Montuje system plików w trybie tylko do odczytu.

source: Mount the filesystem read-write.
pl: Montuje system plików w trybie odczytu i zapisu.

source: All I/O to the filesystem should be done synchronously. In case of media with limited number of write cycles (e.g. some flash drives) "sync" may cause life-cycle shortening.
pl: Wszystkie operacje wejścia/wyjścia systemu plików powinny być wykonywane synchroniczne. W przypadku nośników z ograniczoną liczbą cykli zapisu (np. niektórych napędów flash) "sync" może spowodować skrócenie trwałości nośnika.

source: Allow an ordinary user to mount the filesystem. The name of the mounting user is written to mtab so that he can unmount the filesystem again. This option implies the options B<noexec>, B<nosuid>, and B<nodev> (unless overridden by subsequent options, as in the option line B<user,exec,dev,suid>).
pl: Pozwala na zamontowanie tego systemu plików przez zwykłego użytkownika. Nazwa montującego użytkownika jest zapisywana do mtab, więc może on ponownie odmontować system plików. Opcja ta implikuje opcje B<noexec>, B<nosuid>, i B<nodev> (chyba że są przesłaniane przez następne opcje, jak w linii B<user,exec,dev,suid>).

source: Forbid an ordinary (i.e., non-root) user to mount the filesystem. This is the default.
pl: Zabrania zwykłemu użytkownikowi (tzn. innemu niż root) montowania systemu plików. Tak jest domyślnie.

source: Allow every user to mount and unmount the filesystem. This option implies the options B<noexec>, B<nosuid>, and B<nodev> (unless overridden by subsequent options, as in the option line B<users,exec,dev,suid>).
pl: Pozwala każdemu użytkownikowi na zamontowanie i odmontowanie tego systemu plików. Opcja ta implikuje opcje B<noexec>, B<nosuid>, i B<nodev> (chyba że są przesłaniane przez następne opcje, jak w linii B<user,exec,dev,suid>).

source: FILESYSTEM SPECIFIC MOUNT OPTIONS
pl: OPCJE MONTOWANIA SPECYFICZNE DLA RÓŻNYCH SYSTEMÓW PLIKÓW

source: The following options apply only to certain filesystems. We sort them by filesystem. They all follow the B<-o> flag.
pl: Następujące opcje stosuje się tylko do określonych systemów plików. Są uporządkowane według systemu plików. Wszystkie występują po fladze B<-o>.

source: What options are supported depends a bit on the running kernel. More info may be found in the kernel source subdirectory I<Documentation/filesystems>.
pl: To, czy opcje są obsługiwane, zależy w pewnej mierze od działającego jądra. Więcej informacji można uzyskać w podkatalogu źródeł jądra I<Documentation/filesystems>.

source: Mount options for adfs
pl: Opcje montowania do adfs

source: B<uid=>I<value> and B<gid=>I<value>
pl: B<uid=>I<wartość> i B<gid=>I<wartość>

source: Set the owner and group of the files in the filesystem (default: uid=gid=0).
pl: Ustawia właściciela i grupę plików w danym systemie plików (domyślnie: uid=gid=0).

source: B<ownmask=>I<value> and B<othmask=>I<value>
pl: B<ownmask=>I<wartość> i B<othmask=>I<wartość>

source: Set the permission mask for ADFS 'owner' permissions and 'other' permissions, respectively (default: 0700 and 0077, respectively). See also I</usr/src/linux/Documentation/filesystems/adfs.txt>.
pl: Ustawia maskę praw dla, odpowiednio, uprawnień 'właściciela' i uprawnień 'innych' ADFS (domyślnie, odpowiednio: 0700 i 0077). Zobacz także I</usr/src/linux/Documentation/filesystems/adfs.txt>.

source: Mount options for affs
pl: Opcje montowania do affs

source: Set the owner and group of the root of the filesystem (default: uid=gid=0, but with option B<uid> or B<gid> without specified value, the uid and gid of the current process are taken).
pl: Ustawia właściciela i grupę korzenia systemu plików (domyślnie: uid=gid=0), lecz opcje B<uid> lub B<gid> bez podanej wartości pobierają uid i gid bieżącego procesu).

source: B<setuid=>I<value> and B<setgid=>I<value>
pl: B<setuid=>I<wartość> i B<setgid=>I<wartość>

source: Set the owner and group of all files.
pl: Ustawia właściciela i grupę wszystkich plików.

source: B<mode=>I<value>
pl: B<mode=>I<wartość>

source: Set the mode of all files to I<value> & 0777 disregarding the original permissions. Add search permission to directories that have read permission. The value is given in octal.
pl: Ustawia prawa wszystkich plików na I<wartość> & 0777, nie zważając na oryginalne prawa. Dodaje prawa przeszukiwania dla katalogów, które mają prawo odczytu. Wartość jest podawana ósemkowo.

source: Do not allow any changes to the protection bits on the filesystem.
pl: Nie dopuszcza do zmian w bitach ochrony systemu plików.

source: Set uid and gid of the root of the filesystem to the uid and gid of the mount point upon the first sync or umount, and then clear this option. Strange...
pl: Ustawia uid i gid korzenia systemu plików na uid i gid punktu montowania, aż do pierwszego sync lub umount, a potem kasuje tę opcję. Dziwne...

source: Print an informational message for each successful mount.
pl: Wypisuje informację o każdym pomyślnym montowaniu.

source: B<prefix=>I<string>
pl: B<prefix=>I<napis>

source: Prefix used before volume name, when following a link.
pl: Przedrostek używany przed nazwą wolumenu, przy podążaniu za dowiązaniem.

source: B<volume=>I<string>
pl: B<volume=>I<napis>

source: Prefix (of length at most 30) used before '/' when following a symbolic link.
pl: Przedrostek (długości najwyżej 30), używany przed '/' przy podążaniu za dowiązaniem symbolicznym.

source: B<reserved=>I<value>
pl: B<reserved=>I<wartość>

source: (Default: 2.) Number of unused blocks at the start of the device.
pl: (Domyślnie: 2.) Liczba nieużytkowanych bloków na początku urządzenia.

source: B<root=>I<value>
pl: B<root=>I<wartość>

source: Give explicitly the location of the root block.
pl: Podaje jawnie lokalizację bloku korzenia (root block).

source: B<bs=>I<value>
pl: B<bs=>I<wartość>

source: Give blocksize. Allowed values are 512, 1024, 2048, 4096.
pl: Podaje rozmiar bloku. Dozwolone wartości to 512, 1024, 2048, 4096.

source: These options are accepted but ignored. (However, quota utilities may react to such strings in I</etc/fstab>.)
pl: Opcje te są przyjmowane, lecz są ignorowane (jednakże narzędzia przydziałów dyskowych (quota) mogą reagować na takie łańcuchy w I</etc/fstab>).

source: Mount options for cifs
pl: Opcje montowania do xiafs

source: See the options section of the B<mount.cifs>(8) man page (smbfs package must be installed).
pl: Patrz sekcja opcji na stronie podręcznika B<mount.cifs>(8) (pakiet smbfs musi być zainstalowany).

source: Mount options for coherent
pl: Opcje montowania do coherent

source: None.
pl: Brak.

source: Mount options for debugfs
pl: Opcje montowania do debugfs

source: The debugfs filesystem is a pseudo filesystem, traditionally mounted on I</sys/kernel/debug>. There are no mount options.
pl: System plików debugfs jest pseudosystemem, montowanym tradycyjnie w I</sys/kernel/debug>. Nie ma opcji montowania.

source: Mount options for devpts
pl: Opcje montowania do devpts

source: The devpts filesystem is a pseudo filesystem, traditionally mounted on I</dev/pts>. In order to acquire a pseudo terminal, a process opens I</dev/ptmx>; the number of the pseudo terminal is then made available to the process and the pseudo terminal slave can be accessed as I</dev/pts/>E<lt>numberE<gt>.
pl: devpts jest pseudosystemem plików, tradycyjnie montowanym w I</dev/pts>. W celu uzyskania pseudoterminala, proces otwiera I</dev/ptmx>. Jest mu wówczas udostępniany numer pseudoterminala; podporządkowany pseudoterminal jest dostępny jako I</dev/pts/>E<lt>numerE<gt>.

source: This sets the owner or the group of newly created PTYs to the specified values. When nothing is specified, they will be set to the UID and GID of the creating process. For example, if there is a tty group with GID 5, then B<gid=5> will cause newly created PTYs to belong to the tty group.
pl: Ustawia właściciela lub grupę nowotworzonych PTY według zadanych wartości. Jeśli nie podano żadnych, to zostaną nadane UID i GID procesu tworzącego. Na przykład, jeśli mamy grupę tty o GID=5, to B<gid=5> spowoduje, że nowo tworzone PTY będą należeć do grupy tty.

source: Set the mode of newly created PTYs to the specified value. The default is 0600. A value of B<mode=620> and B<gid=5> makes "mesg y" the default on newly created PTYs.
pl: Nadaje trybowi nowo tworzonych PTY zadaną wartość. Domyślnie jest to 0600. Wartość B<mode=620> i B<gid=5> powoduje, że dla nowo utworzonych PTY będzie domyślnie "mesg y".

source: Create a private instance of devpts filesystem, such that indices of ptys allocated in this new instance are independent of indices created in other instances of devpts.
pl: Tworzy prywatną instancję systemu plików devpts tak, że wskaźniki pty zaalokowane w tej nowej kopii są niezależne od wskaźników utworzonych w innych instancjach devpts.

source: All mounts of devpts without this B<newinstance> option share the same set of pty indices (i.e legacy mode). Each mount of devpts with the B<newinstance> option has a private set of pty indices.
pl: Wszystkie montowania devpts bez opcji B<newinstance> współdzielą ten sam zestaw wskaźników pty (np. tryb legacy). Każde zamontowanie devpts z opcją B<newinstance> tworzy prywatny zestaw wskaźników pty.

source: This option is mainly used to support containers in the linux kernel. It is implemented in linux kernel versions starting with 2.6.29. Further, this mount option is valid only if CONFIG_DEVPTS_MULTIPLE_INSTANCES is enabled in the kernel configuration.
pl: Opcja jest używana głównie do obsługi kontenerów, w jądrze Linux, od wersji 2.6.29. Co więcej, ta opcja jest poprawna jedynie, jeśli w konfiguracji jądra włączono CONFIG_DEVPTS_MULTIPLE_INSTANCES.

source: To use this option effectively, I</dev/ptmx> must be a symbolic link to I<pts/ptmx.> See I<Documentation/filesystems/devpts.txt> in the linux kernel source tree for details.
pl: Aby użyć tej opcji w sposób efektywny, I</dev/ptmx> musi być dowiązaniem symbolicznym do I<pts/ptmx>. Proszę zapoznać się z plikiem I<Documentation/filesystems/devpts.txt> w kodzie źródłowym jądra Linux, aby dowiedzieć się więcej.

source: B<ptmxmode=>I<value>
pl: B<ptmxmode=>I<wartość>

source: Set the mode for the new I<ptmx> device node in the devpts filesystem.
pl: Ustawia tryb nowego węzła urządzenia I<ptmx> w systemie plików devpts.

source: With the support for multiple instances of devpts (see B<newinstance> option above), each instance has a private I<ptmx> node in the root of the devpts filesystem (typically I</dev/pts/ptmx).>
pl: Z obsługą wielu instancji devpts (patrz powyżej: opcja B<newinstance>), każda kopia posiada prywatny węzeł I<ptmx> w katalogu głównym systemu plików devpts (z reguły I<dev/pts/ptmx>).

source: For compatibility with older versions of the kernel, the default mode of the new I<ptmx> node is 0000. B<ptmxmode=>I<value> specifies a more useful mode for the I<ptmx> node and is highly recommended when the B<newinstance> option is specified.
pl: W celu uzyskania kompatybilności ze starszymi wersjami jądra, domyślnym trybem nowego węzła I<ptmx> jest 0000. B<ptmxmode=>I<wartość> określa bardziej przydatny tryb dla nowego węzła I<ptmx> i jest wysoce zalecany, gdy podana jest opcja B<newinstance>.

source: This option is only implemented in linux kernel versions starting with 2.6.29. Further this option is valid only if CONFIG_DEVPTS_MULTIPLE_INSTANCES is enabled in the kernel configuration.
pl: Opcja została zaimplementowana jedynie w wersjach jądra Linux poczynając od 2.6.29. Co więcej, opcja ta jest poprawna jedynie, jeśli w konfiguracji jądra włączono CONFIG_DEVPTS_MULTIPLE_INSTANCES.

source: Mount options for ext
pl: Opcje montowania do ext

source: None. Note that the `ext' filesystem is obsolete. Don't use it. Since Linux version 2.1.21 extfs is no longer part of the kernel source.
pl: Brak. Proszę zauważyć, że system plików "ext" jest przedawniony. Proszę go nie używać. Od Linuksa w wersji 2.1.21 kod źródłowy jądra nie zawiera już extfs.

source: Mount options for ext2
pl: Opcje montowania do ext2

source: The `ext2' filesystem is the standard Linux filesystem. Since Linux 2.5.46, for most mount options the default is determined by the filesystem superblock. Set them with B<tune2fs>(8).
pl: System plików "ext2" jest standardowym systemem plików Linuksa. Od jądra w wersji 2.5.46, domyślne wartości opcji montowania są określone przez superblok systemu plików. Ustawia się go za pomocą B<tune2fs>(8).

source: Support POSIX Access Control Lists (or not).
pl: Obsługuje (lub odpowiednio: nie obsługuje) listy kontroli dostępu (Access Control Lists) POSIX.

source: Set the behaviour for the I<statfs> system call. The B<minixdf> behaviour is to return in the I<f_blocks> field the total number of blocks of the filesystem, while the B<bsddf> behaviour (which is the default) is to subtract the overhead blocks used by the ext2 filesystem and not available for file storage. Thus
pl: Ustala zachowanie funkcji systemowej I<statfs>. Zachowanie B<minixdf> to zwracanie w polu I<f_blocks> całkowitej ilość bloków systemu plików, podczas gdy zachowaniem B<bsddf> (które jest domyślne) jest odejmowanie nadmiarowych bloków używanych przez ext2 i niedostępnych dla przechowywania plików. Tak więc

source: (Note that this example shows that one can add command line options to the options given in I</etc/fstab>.)
pl: (Zauważ, że ten przykład pokazuje, że można dodać opcje wiersza poleceń do opcji podanych w I</etc/fstab>.)

source: No checking is done at mount time. This is the default. This is fast. It is wise to invoke B<e2fsck>(8) every now and then, e.g. at boot time.
pl: Podczas montowania nie przeprowadzane jest sprawdzanie. Jest to zachowanie domyślne. I szybkie. Roztropnie jest wywoływać co jakiś czas B<e2fsck>(8) np. w czasie rozruchu systemu.

source: Print debugging info upon each (re)mount.
pl: Wypisuje informacje diagnostyczne przy każdym (re)montowaniu.

source: Define the behaviour when an error is encountered. (Either ignore errors and just mark the filesystem erroneous and continue, or remount the filesystem read-only, or panic and halt the system.) The default is set in the filesystem superblock, and can be changed using B<tune2fs>(8).
pl: Definiuje zachowanie przy napotkaniu błędu (albo ignoruje błędy, zaznaczając tylko system plików jako błędny i kontynuując, albo ponownie montuje system plików na tylko do odczytu, albo panikuje i zatrzymuje system). Domyślne ustawienie jest wpisane w superbloku systemu plików i może być zmienione za pomocą B<tune2fs>(8).

source: B<grpid>|B<bsdgroups> and B<nogrpid>|B<sysvgroups>
pl: B<grpid>|B<bsdgroups> i B<nogrpid>|B<sysvgroups>

source: These options define what group id a newly created file gets. When B<grpid> is set, it takes the group id of the directory in which it is created; otherwise (the default) it takes the fsgid of the current process, unless the directory has the setgid bit set, in which case it takes the gid from the parent directory, and also gets the setgid bit set if it is a directory itself.
pl: Opcje te definiują, jaki identyfikator grupy (gid) otrzyma nowo utworzony plik. Gdy ustawiony jest B<grpid>, to pobiera gid katalogu, w którym jest utworzony; w przeciwnym wypadku (domyślnie) bierze fsgid bieżącego procesu, chyba że katalog ma ustawiony bit setgid, wówczas pobiera gid katalogu rodzicielskiego i dodatkowo otrzymuje bit setgid, jeśli sam jest katalogiem.

source: These options are accepted but ignored.
pl: Opcje te są przyjmowane, lecz ignorowane.

source: Disables 32-bit UIDs and GIDs. This is for interoperability with older kernels which only store and expect 16-bit values.
pl: Wyłącza 32-bitowe UID-y i GID-y w celu zachowania zgodności ze starszymi jądrami, które przechowują i oczekują wartości 16-bitowych.

source: B<oldalloc> or B<orlov>
pl: B<oldalloc> lub B<orlov>

source: Use old allocator or Orlov allocator for new inodes. Orlov is default.
pl: Używa starego alokatora lub alokatora Orlov do nowych i-węzłów. Domyślnie używany jest Orlov.

source: B<resgid=>I<n> and B<resuid=>I<n>
pl: B<resgid=>I<n> i B<resuid=>I<n>

source: The ext2 filesystem reserves a certain percentage of the available space (by default 5%, see B<mke2fs>(8) and B<tune2fs>(8)). These options determine who can use the reserved blocks. (Roughly: whoever has the specified uid, or belongs to the specified group.)
pl: System plików ext2 rezerwuje pewną ilość wolnego miejsca (domyślnie 5%, zobacz B<mke2fs>(8) i B<tune2fs>(8)). Opcje te określają, kto może używać zarezerwowanych bloków. (Ogólnie: każdy, kto ma podany uid lub należy do podanej grupy.)

source: Instead of block 1, use block I<n> as superblock. This could be useful when the filesystem has been damaged. (Earlier, copies of the superblock would be made every 8192 blocks: in block 1, 8193, 16385, ... (and one got thousands of copies on a big filesystem). Since version 1.08, B<mke2fs> has a -s (sparse superblock) option to reduce the number of backup superblocks, and since version 1.15 this is the default. Note that this may mean that ext2 filesystems created by a recent B<mke2fs> cannot be mounted r/w under Linux 2.0.*.) The block number here uses 1k units. Thus, if you want to use logical block 32768 on a filesystem with 4k blocks, use "sb=131072".
pl: Zamiast bloku 1, jako superbloku używa bloku I<n>. Może to być przydatne, gdy system plików został uszkodzony. Zazwyczaj kopie superbloku znajdują się co 8192 bloków: w bloku 1, 8193, 16385, ... (Dlatego na dużym systemie plików istnieją setki, lub nawet tysiące kopii superbloku. Od wersji 1.08, B<mke2fs> ma opcję -s (sparse superblock), redukującą liczbę zapasowych superbloków, a od wersji 1.15 jest ona domyślna. Zauważ, że może to oznaczać, że systemy plików typu ext2 stworzone przez nowe B<mke2fs> nie mogą być montowane do zapisu pod Linuksem 2.0.*.) Liczba bloków podawana jest w jednostkach 1k. Dlatego, aby użyć logicznego bloku 32768 na systemie plików z blokami o rozmiarze 4k, należy podać "sb=131072".

source: Support "user." extended attributes (or not).
pl: Obsługuje (lub odpowiednio: nie obsługuje) rozszerzonych atrybutów "user.".

source: Mount options for ext3
pl: Opcje montowania do ext3

source: The ext3 filesystem is a version of the ext2 filesystem which has been enhanced with journalling. It supports the same options as ext2 as well as the following additions:
pl: System plików "ext3" jest wersją systemu ext2, uzupełnioną o dziennik (journal). Przyjmuje takie same opcje jak ext2 oraz dodatkowo:

source: Update the ext3 filesystem's journal to the current format.
pl: Aktualizuje dziennik systemu plików ext3 do obecnego formatu.

source: When a journal already exists, this option is ignored. Otherwise, it specifies the number of the inode which will represent the ext3 filesystem's journal file; ext3 will create a new journal, overwriting the old contents of the file whose inode number is I<inum>.
pl: Jeżeli dziennik już istnieje, ta opcja jest ignorowana. W przeciwnym wypadku, określa numer i-węzła, który reprezentuje dziennik systemu plików ext3; ext3 utworzy nowy dziennik, nadpisując starą zawartość pliku, który zajmuje i-węzeł o numerze I<inum>.

source: When the external journal device's major/minor numbers have changed, this option allows the user to specify the new journal location. The journal device is identified through its new major/minor numbers encoded in devnum.
pl: Gdy główny (major)/poboczny (minor) numer urządzenia rozszerzonego dziennika zmieni się, ta opcja umożliwia użytkownikowi na określenie nowego położenia dziennika. Urządzenie dziennika jest identyfikowane przez główny/poboczny numer urządzenia, podany w devnum.

source: Don't load the journal on mounting. Note that if the filesystem was not unmounted cleanly, skipping the journal replay will lead to the filesystem containing inconsistencies that can lead to any number of problems.
pl: Nie ładuje dziennika w czasie montowania. Proszę zauważyć, że jeśli system plików nie został poprawnie odmontowany, pominięcie odtworzenia z dziennika może spowodować pozostawienie niespójności w systemie plików, które mogą być następnie przyczyną wielu problemów.

source: Specifies the journalling mode for file data. Metadata is always journaled. To use modes other than B<ordered> on the root filesystem, pass the mode to the kernel as boot parameter, e.g. I<rootflags=data=journal>.
pl: Określa tryb dziennika do plików z danymi. Metadane są zawsze włączane do dziennika. Aby użyć trybów innych niż B<ordered> na głównym (root) systemie plików, proszę je podać do jądra jako parametry rozruchowe np. I<rootflags=data=journal>.

source: All data is committed into the journal prior to being written into the main filesystem.
pl: Wszystkie dane są zapisywane do dziennika zanim zostaną zapisane do głównego systemu plików.

source: This is the default mode. All data is forced directly out to the main file system prior to its metadata being committed to the journal.
pl: Domyślny tryb. Wszystkie dane są zapisywane bezpośrednio do głównego systemu plików zanim ich metadane zostaną zapisane do dziennika.
