Repository: eurolinux-enterprise-linux-sources/man-pages-pl
Catalog: src/po/man8/mount.8.po
Languages: pl

source: If B<nolargeio> is specified, the optimal I/O reported in st_blksize by B<stat>(2) will be as small as possible to allow user applications to avoid inefficient read/modify/write I/O. If B<largeio> is specified, a filesystem that has a B<swidth> specified will return the B<swidth> value (in bytes) in st_blksize. If the filesystem does not have a B<swidth> specified but does specify an B<allocsize> then B<allocsize> (in bytes) will be returned instead. If neither of these two options are specified, then filesystem will behave as if B<nolargeio> was specified.
pl: Jeśli podano B<nolargeio>, optymalne wejście/wyjście raportowane w st_blksize przez B<stat>(2) będzie tak małe, jak to tylko możliwe, aby pozwolić aplikacjom użytkownika zapobiec niewydajnym odczytom/modyfikacji/zapisom wejścia/wyjścia. Jeśli podano B<largeio>, system plików, któremu określono opcję B<swidth> zwróci wartość B<swidth> w st_blksize (w bajtach). Jeśli jej nie określono, ale podano B<allocsize>, to zwrócone zostanie w zamian B<allocsize> (w bajtach). Jeśli nie podano żadnej z tych dwóch opcji, system plików zachowa się jak gdyby podano opcję B<nolargeio>.

source: B<logbufs=>I<value>
pl: B<logbufs=>I<wartość>

source: Set the number of in-memory log buffers. Valid numbers range from 2-8 inclusive. The default value is 8 buffers for any recent kernel.
pl: Ustawia liczbę buforów logów w pamięci (in-memory). Poprawnymi wartościami są 2-8 (włącznie). Domyślną wartością z każdym nowszym jądrem jest 8 buforów.

source: B<logbsize=>I<value>
pl: B<logbsize=>I<wartość>

source: Set the size of each in-memory log buffer. Size may be specified in bytes, or in kilobytes with a "k" suffix. Valid sizes for version 1 and version 2 logs are 16384 (16k) and 32768 (32k). Valid sizes for version 2 logs also include 65536 (64k), 131072 (128k) and 262144 (256k). The default value for any recent kernel is 32768.
pl: Ustawia rozmiar każdego z buforów logów w pamięci (in-memory). Rozmiar można podać w bajtach, lub w kilobajtach, z przyrostkiem "k". Poprawnymi rozmiarami do wersji 1 i 2 są 16384 (16k) and 32768 (32k). Do wersji 2 logów, poprawnymi rozmiarami są również 65536 (64k), 131072 (128k) and 262144 (256k). Domyślną wartością z każdym nowszym jądrem jest 32768.

source: B<logdev=>I<device> and B<rtdev=>I<device>
pl: B<logdev=>I<urządzenie> i B<rtdev=>I<urządzenie>

source: Use an external log (metadata journal) and/or real-time device. An XFS filesystem has up to three parts: a data section, a log section, and a real-time section. The real-time section is optional, and the log section can be separate from the data section or contained within it. Refer to B<xfs>(5).
pl: Używa zewnętrznego dziennika (rejestru metadanych) i/lub urządzenia czasu rzeczywistego. System plików XFS ma do trzech części: sekcji danych, sekcji dziennika i sekcji czasu rzeczywistego. Sekcja czasu rzeczywistego jest opcjonalna, a sekcja dziennika może być osobna od sekcji danych albo może być w niej zawarta. Bliższe informacje podaje B<xfs>(5).

source: B<mtpt=>I<mountpoint>
pl: B<mtpt=>I<punkt-montowania>

source: Use with the B<dmapi> option. The value specified here will be included in the DMAPI mount event, and should be the path of the actual mountpoint that is used.
pl: Używane z opcją B<dmapi>. Wartość tu podana będzie uwzględniona w zdarzeniu montowania DMAPI i powinna być ścieżką rzeczywistego punktu montowania, który jest używany.

source: Data allocations will not be aligned at stripe unit boundaries.
pl: Alokacja danych nie będzie wyrównywana na granicach jednostki paskowej (stripe unit).

source: Access timestamps are not updated when a file is read.
pl: Podczas odczytu pliku nie są aktualizowane znaczniki czasu dostępu.

source: The filesystem will be mounted without running log recovery. If the filesystem was not cleanly unmounted, it is likely to be inconsistent when mounted in B<norecovery> mode. Some files or directories may not be accessible because of this. Filesystems mounted B<norecovery> must be mounted read-only or the mount will fail.
pl: System plików zostanie zamontowany bez uruchamiania odzyskiwania dziennika. Jeśli system ten nie był poprawnie odmontowany, to możliwe, że montowany w trybie B<norecovery> będzie niespójny. Część plików lub katalogów może z tego powodu być niedostępna. Systemy plików przy włączeniu trybu B<norecovery> muszą być montowane tylko do odczytu albo montowanie się nie powiedzie.

source: Don't check for double mounted filesystems using the filesystem uuid. This is useful to mount LVM snapshot volumes.
pl: Nie sprawdza w celu wyszukania podwójnie zamontowanych systemów plików używając uuid systemu pliku. Jest to użyteczne do montowania migawek woluminów LVM.

source: Make O_SYNC writes implement true O_SYNC. WITHOUT this option, Linux XFS behaves as if an B<osyncisdsync> option is used, which will make writes to files opened with the O_SYNC flag set behave as if the O_DSYNC flag had been used instead. This can result in better performance without compromising data safety. However if this option is not in effect, timestamp updates from O_SYNC writes can be lost if the system crashes. If timestamp updates are critical, use the B<osyncisosync> option.
pl: Zapisy O_SYNC wykorzystują prawdziwe O_SYNC. BEZ tej opcji, linuksowe XFS zachowuje się tak, jakby użyto opcję B<osyncisdsync>, która powoduje, że zapisy do plików otwartych z ustawioną flagą O_SYNC będą się zachowywać jakby zamiast niej użyto flagi O_DSYNC. Może to dać lepszą wydajność bez naruszenia bezpieczeństwa danych. Jednakże, jeśli działa ta opcja, to w przypadku załamania się systemu mogą zostać utracone aktualizacje znaczników czasu z O_SYNC. Jeśli aktualizowanie znaczników czasu jest krytyczne, proszę użyć opcji B<osyncisosync>.

source: User disk quota accounting enabled, and limits (optionally) enforced. Refer to B<xfs_quota>(8) for further details.
pl: Włączenie systemu rozliczania udziałów dyskowych (quota) użytkowników i wymuszenie (opcjonalnie) limitów. Patrz B<xfs_quota>(8), aby dowiedzieć się więcej.

source: Group disk quota accounting enabled and limits (optionally) enforced. Refer to B<xfs_quota>(8) for further details.
pl: Włączenie systemu rozliczania udziałów dyskowych (quota) grup i wymuszenie (opcjonalnie) limitów. Patrz B<xfs_quota>(8), aby dowiedzieć się więcej.

source: Project disk quota accounting enabled and limits (optionally) enforced. Refer to B<xfs_quota>(8) for further details.
pl: Włączenie systemu rozliczania udziałów dyskowych (quota) projektów i wymuszenie (opcjonalnie) limitów. Patrz B<xfs_quota>(8), aby dowiedzieć się więcej.

source: B<sunit=>I<value> and B<swidth=>I<value>
pl: B<sunit=>I<wartość> i B<swidth=>I<wartość>

source: Used to specify the stripe unit and width for a RAID device or a stripe volume. I<value> must be specified in 512-byte block units. If this option is not specified and the filesystem was made on a stripe volume or the stripe width or unit were specified for the RAID device at mkfs time, then the mount system call will restore the value from the superblock. For filesystems that are made directly on RAID devices, these options can be used to override the information in the superblock if the underlying disk layout changes after the filesystem has been created. The B<swidth> option is required if the B<sunit> option has been specified, and must be a multiple of the B<sunit> value.
pl: Stosowane do określenia jednostki i szerokości paska dla urządzenia RAID lub wolumenu paskowego. I<Wartość> musi być podana jako liczba 512-bajtowych bloków. Jeśli nie podano tej opcji, a system plików został utworzony na wolumenie paskowym lub podczas korzystania z mkfs podano szerokość albo jednostkę paska dla urządzenia RAID, to funkcja systemowa mount odtworzy tę wartość z superbloku. Dla systemów plików utworzonych bezpośrednio na urządzeniach RAID, opcji tych można użyć do przesłonięcia informacji z superbloku jeśli po stworzeniu systemu zmienił się odnośny układ dysku. Jeśli podano B<sunit>, to opcja B<swidth> jest wymagana i musi być wielokrotnością wartości B<sunit>.

source: Data allocations will be rounded up to stripe width boundaries when the current end of file is being extended and the file size is larger than the stripe width size.
pl: Alokowanie danych będzie zaokrąglone w górę do szerokości granic paska, gdy bieżący koniec pliku przesunie się i rozmiar pliku stanie się większy niż szerokość paska.

source: Mount options for xiafs
pl: Opcje montowania do xiafs

source: None. Although nothing is wrong with xiafs, it is not used much, and is not maintained. Probably one shouldn't use it. Since Linux version 2.1.21 xiafs is no longer part of the kernel source.
pl: Brak. Chociaż xiafs nic nie dolega, nie jest on używany zbyt często i nie jest rozwijany. Prawdopodobnie nie powinno się go używać. Od Linuksa w wersji 2.1.21 xiafs nie występuje już w kodzie źródłowym jądra.

source: THE LOOP DEVICE
pl: URZĄDZENIE LOOP

source: One further possible type is a mount via the loop device. For example, the command
pl: Kolejnym możliwym typem jest montowanie poprzez urządzenie loop. Na przykład, polecenie

source: will set up the loop device I</dev/loop3> to correspond to the file I</tmp/disk.img>, and then mount this device on I</mnt>.
pl: ustawi urządzenie loop I</dev/loop3> tak, aby odpowiadał plikowi I</tmp/disk.img>, a następnie zamontuje to urządzenie w I</mnt>.

source: If no explicit loop device is mentioned (but just an option `B<-o loop>' is given), then B<mount> will try to find some unused loop device and use that, for example
pl: Jeśli nie podano jawnie urządzenia loop (tylko opcję B<-o loop>), to B<mount> spróbuje znaleźć jakieś nieużywane urządzenie loop i użyć je, na przykład

source: The mount command B<automatically> creates a loop device from a regular file if a filesystem type is not specified or the filesystem is known for libblkid, for example:
pl: Polecenie mount B<automatycznie> tworzy urządzenie loop ze zwykłego pliku, jeśli nie podano systemu plików lub system plików jest znany libblkid, na przykład:

source: This type of mount knows about four options, namely B<loop>, B<offset>, B<sizelimit> and B<encryption>, that are really options to B<\%losetup>(8). If the mount requires a passphrase, you will be prompted for one unless you specify a file descriptor to read from instead with the B<--pass-fd> option. (These options can be used in addition to those specific to the filesystem type.)
pl: Ten typ montowań zna cztery opcje, B<loop>, B<offset>, B<sizelimit> i B<encryption>, które są tak naprawdę opcjami do B<\%losetup>(8). Jeśli montowanie wymaga hasła, użytkownik zostanie o nie zapytany, chyba że do odczytu podany zostanie deskryptor pliku do opcji B<--pass-fd> (opcje te mogą być używane oprócz opcji specyficznych dla danego systemu plików).

source: Since Linux 2.6.25 is supported auto-destruction of loop devices and then any loop device allocated by B<mount> will be freed by B<umount> independently on I</etc/mtab>.
pl: Od Linuksa 2.6.25 obsługiwane jest samozniszczenie urządzeń loop i każde urządzenie loop przydzielone przez B<mount> zostanie zwolnione przez B<umount> niezależnie od I</etc/mtab>.

source: You can also free a loop device by hand, using `losetup -d' or `umount -d`.
pl: Można również zwolnić urządzenie loop ręcznie, przy użyciu "losetup -d" lub "umount -d".

source: RETURN CODES
pl: KODY ZAKOŃCZENIA

source: B<mount> has the following return codes (the bits can be ORed):
pl: B<mount> posiada następujące kody zakończeń (bity mogą być złożone używając alternatywy - OR):

source: success
pl: sukces

source: incorrect invocation or permissions
pl: nieprawidłowe wywołanie lub uprawnienia

source: system error (out of memory, cannot fork, no more loop devices)
pl: błąd systemu (brak pamięci, niemożność wykonania fork, nie ma więcej urządzeń loop)

source: internal B<mount> bug
pl: wewnętrzny błąd B<mount>

source: user interrupt
pl: przerwanie przez użytkownika

source: problems writing or locking /etc/mtab
pl: problemy podczas zapisu lub blokowania /etc/mtab

source: mount failure
pl: niepowodzenie montowania

source: some mount succeeded
pl: cześć montowań powiodła się

source: NOTES
pl: UWAGI

source: The syntax of external mount helpers is:
pl: Składnia zewnętrznych programów pomocniczych mount jest następująca:

source: B</sbin/mount.>I<E<lt>suffixE<gt>> I<spec dir> [B<-sfnv>] [B<-o> I<options>] [B<-t> I<type.subtype>]
pl: B</sbin/mount.>I<E<lt>przyrostekE<gt>> I<spec katalog> [B<-sfnv>] [B<-o> I<opcje>] [B<-t> I<typ.podtyp>]

source: where the E<lt>typeE<gt> is filesystem type and -sfnvo options have same meaning like standard mount options. The -t option is used for filesystems with subtypes support (for example /sbin/mount.fuse -t fuse.sshfs).
pl: gdzie E<lt>typE<gt> jest typem systemu plików, a opcje -sfnvo mają to samo znaczenie, co standardowe opcje mount. Opcja -t jest używana do systemów plików z obsługa podtypów (np. /sbin/mount.fuse -t fuse.sshfs).

source: FILES
pl: PLIKI

source: filesystem table
pl: tabela systemów plików

source: table of mounted filesystems
pl: tabela zamontowanych systemów plików

source: lock file
pl: plik blokady

source: temporary file
pl: plik tymczasowy

source: a list of filesystem types to try
pl: lista systemów plików do wypróbowania

source: SEE ALSO
pl: ZOBACZ TAKŻE

source: BUGS
pl: BŁĘDY

source: It is possible for a corrupted filesystem to cause a crash.
pl: Jest możliwe, że uszkodzony system plików spowoduje załamanie systemu.

source: Some Linux filesystems don't support B<-o sync and -o dirsync> (the ext2, ext3, fat and vfat filesystems I<do> support synchronous updates (a la BSD) when mounted with the B<sync> option).
pl: Niektóre linuksowe systemy plików nie obsługują B<-o sync> i B<-o dirsync> (systemy ext2, ext3, fat i vfat I<obsługują> synchroniczne odświeżania (updates) (a la BSD), gdy zostaną zamontowane z opcją B<sync>).

source: The B<-o remount> may not be able to change mount parameters (all I<ext2fs>-specific parameters, except B<sb>, are changeable with a remount, for example, but you can't change B<gid> or B<umask> for the I<fatfs>).
pl: Opcja B<-o remount> może nie być w stanie zmienić parametrów montowania (np. wszystkie parametry I<ext2fs>, poza B<sb>, dają się zmieniać przy ponownym montowaniu, lecz nie można zmienić B<gid> czy B<umask> dla I<fatfs>).

source: Mount by label or uuid will work only if your devices have the names listed in I</proc/partitions>. In particular, it may well fail if the kernel was compiled with devfs but devfs is not mounted.
pl: Montowanie za pomocą etykiety lub uuid działa tylko wtedy, gdy nazwy urządzeń są wypisane w I</proc/partitions>. W szczególności, może się ono nie powieść, gdy jądro zostało skompilowane z devfs, ale devfs nie jest zamontowany.

source: It is possible that files I</etc/mtab> and I</proc/mounts> don't match. The first file is based only on the mount command options, but the content of the second file also depends on the kernel and others settings (e.g. remote NFS server. In particular case the mount command may reports unreliable information about a NFS mount point and the /proc/mounts file usually contains more reliable information.)
pl: Zdarza się, że pliki I</etc/mtab> i I</proc/mounts> nie odpowiadają sobie. Pierwszy plik opiera się wyłącznie na opcjach poleceń mount, a zawartość drugiego zależy również od jądra i innych ustawień (np. zdalnego serwera NFS). W szczególnym przypadku, polecenie mount może dawać niepewne informacje o punkcie montowania NFS; plik /proc/mounts zawiera z reguły pewniejsze informacje.

source: Checking files on NFS filesystem referenced by file descriptors (i.e. the B<fcntl> and B<ioctl> families of functions) may lead to inconsistent result due to the lack of consistency check in kernel even if noac is used.
pl: Sprawdzanie plików w systemie plików NFS, odnosząc się do deskryptorów pliku (np. rodziny funkcji B<fcntl> i B<ioctl>) może powodować niespójne rezultaty, z powodu braku sprawdzania spójności w jądrze, nawet gdy używane jest noac.

source: HISTORY
pl: HISTORIA

source: A B<mount> command existed in Version 5 AT&T UNIX.
pl: Polecenie B<mount> pojawiło się w wersji 5 AT&T UNIX.

source: AVAILABILITY
pl: DOSTĘPNOŚĆ

source: The mount command is part of the util-linux package and is available from ftp://ftp.kernel.org/pub/linux/utils/util-linux/.
pl: Polecenie mount jest częścią pakietu util-linux i jest dostępne pod adresem ftp://ftp.kernel.org/pub/linux/utils/util-linux/.
