Repository: eurolinux-enterprise-linux-sources/man-pages-pl
Catalog: src/po/man8/mount.8.po
Languages: pl

source: Mount the filesystem read-only. A synonym is B<-o ro>.
pl: Montuje system plików w trybie tylko do odczytu. Synonimem jest B<-o ro>.

source: Note that, depending on the filesystem type, state and kernel behavior, the system may still write to the device. For example, Ext3 or ext4 will replay its journal if the filesystem is dirty. To prevent this kind of write access, you may want to mount ext3 or ext4 filesystem with "ro,noload" mount options or set the block device to read-only mode, see command B<blockdev>(8).
pl: Proszę zauważyć że, w zależności od systemu plików, stanu i zachowania jądra, system może wciąż zapisywać na urządzenie. Na przykład ext3 lub ext4 będzie odświeżał swój dziennik, jeśli system plików jest zaśmiecony. Aby zapobiec takiemu typowi dostępu do zapisu, można zamontować system plików ext3 lub ext4 z opcją montowania "ro,noload" lub ustawić urządzenie blokowe w trybie tylko do odczytu, patrz polecenie B<blockdev>(8).

source: Mount the filesystem read/write. This is the default. A synonym is B<-o rw>.
pl: Montuje system plików w trybie odczytu i zapisu. Tak jest domyślnie. Synonimem jest B<-o rw>.

source: B<-L >I<label>
pl: B<-L>I< etykieta>

source: Mount the partition that has the specified I<label>.
pl: Montuje partycję posiadającą podaną I<etykietę>.

source: Mount the partition that has the specified I<uuid>. These two options require the file I</proc/partitions> (present since Linux 2.1.116) to exist.
pl: Montuje partycję mającą podany I<uuid>. Te dwie opcje wymagają istnienia pliku I</proc/partitions> (obecnego od wersji 2.1.116 Linuksa).

source: B<-t, --types >I<vfstype>
pl: B<-t, --types>I< typ_systemu_plików>

source: The argument following the B<-t> is used to indicate the filesystem type. The filesystem types which are currently supported include: I<adfs>, I<affs>, I<autofs>, I<cifs>, I<coda>, I<coherent>, I<cramfs>, I<debugfs>, I<devpts>, I<efs>, I<ext>, I<ext2>, I<ext3>, I<ext4>, I<hfs>, I<hfsplus>, I<hpfs>, I<iso9660>, I<jfs>, I<minix>, I<msdos>, I<ncpfs>, I<nfs>, I<nfs4>, I<ntfs>, I<proc>, I<qnx4>, I<ramfs>, I<reiserfs>, I<romfs>, I<squashfs>, I<smbfs>, I<sysv>, I<tmpfs>, I<ubifs>, I<udf>, I<ufs>, I<umsdos>, I<usbfs>, I<vfat>, I<xenix>, I<xfs>, I<xiafs>. Note that coherent, sysv and xenix are equivalent and that I<xenix> and I<coherent> will be removed at some point in the future \(em use I<sysv> instead. Since kernel version 2.1.21 the types I<ext> and I<xiafs> do not exist anymore. Earlier, I<usbfs> was known as I<usbdevfs>. Note, the real list of all supported filesystems depends on your kernel.
pl: Argument występujący po B<-t> jest używany do wskazania rodzaju systemu plików. Obecnie obsługiwane są: I<adfs>, I<affs>, I<autofs>, I<cifs>, I<coda>, I<coherent>, I<cramfs>, I<debugfs>, I<devpts>, I<efs>, I<ext>, I<ext2>, I<ext3>, I<ext4>, I<hfs>, I<hfsplus>, I<hpfs>, I<iso9660>, I<jfs>, I<minix>, I<msdos>, I<ncpfs>, I<nfs>, I<nfs4>, I<ntfs>, I<proc>, I<qnx4>, I<ramfs>, I<reiserfs>, I<romfs>, I<squashfs>, I<smbfs>, I<sysv>, I<tmpfs>, I<ubifs>, I<udf>, I<ufs>, I<umsdos>, I<usbfs>, I<vfat>, I<xenix>, I<xfs>, I<xiafs>. Zauważ, że coherent, sysv i xenix są równoważne i że I<xenix> oraz I<coherent> zostaną kiedyś usunięte \(em należy zamiast nich stosować I<sysv>. Od jądra wersji 2.1.21 typy I<ext> i I<xiafs> już nie istnieją. Wcześniej, I<usbfs> miało nazwę I<usbdevfs>. Proszę zauważyć, że rzeczywista lista obsługiwanych systemów plików zależy od bieżącego jądra.

source: The programs B<mount> and B<umount> support filesystem subtypes. The subtype is defined by '.subtype' suffix. For example 'fuse.sshfs'. It's recommended to use subtype notation rather than add any prefix to the mount source (for example 'sshfs#example.com' is depreacated).
pl: Programy B<mount> i B<umount> obsługują podtypy systemów plików. Podtypy są definiowane przyrostkiem ".podtyp". Przykładowo "fuse.sshfs". Zalecane jest używanie notacji podtypów zamiast dodawać jakieś przedrostki do źródła montowania (np. "sshfs#example.com" jest przestarzałe).

source: For most types all the B<mount> program has to do is issue a simple I<mount>(2) system call, and no detailed knowledge of the filesystem type is required. For a few types however (like nfs, nfs4, cifs, smbfs, ncpfs) ad hoc code is necessary. The nfs, nfs4, cifs, smbfs, and ncpfs filesystems have a separate mount program. In order to make it possible to treat all types in a uniform way, mount will execute the program B</sbin/mount.>I<TYPE> (if that exists) when called with type I<TYPE>. Since various versions of the B<smbmount> program have different calling conventions, B</sbin/mount.smbfs> may have to be a shell script that sets up the desired call.
pl: Dla większości typów, jedyne, co robi program B<mount>, to po prostu wywołuje funkcję systemową I<mount>(2), i nie jest tu wymagana żadna szczegółowa wiedza o danym systemie plików. Jednakże dla kilku typów (jak np. nfs, nfs4, cifs, smbfs, ncpfs) konieczny jest niezaplanowany kod. Systemy plików nfs, nfs4, cifs, smbfs i ncpfs mają osobny program montujący. Żeby umożliwić jednolite traktowanie wszystkich typów, mount wywołany z typem I<TYP> uruchamia program B</sbin/mount.>I<TYP> (jeśli takowy istnieje). Ponieważ rozmaite wersje programu B<smbmount> mają różne konwencje wywołań, być może B</sbin/mount.smb> będzie musiał być skryptem powłoki, który dobierze właściwe wywołanie.

source: If no B<-t> option is given, or if the B<auto> type is specified, mount will try to guess the desired type. Mount uses the blkid library for guessing the filesystem type; if that does not turn up anything that looks familiar, mount will try to read the file I</etc/filesystems>, or, if that does not exist, I</proc/filesystems>. All of the filesystem types listed there will be tried, except for those that are labeled "nodev" (e.g., I<devpts>, I<proc> and I<nfs>). If I</etc/filesystems> ends in a line with a single * only, mount will read I</proc/filesystems> afterwards.
pl: Bez podania opcji B<-t> lub gdy podany jest typ B<auto>, mount postara się odgadnąć właściwy typ. Mount używa biblioteki blkid do tego celu; jeśli nie zwróci to niczego, co wygląda znajomo, mount postara się odczytać plik I</etc/filesystems> lub, jeśli on nie istnieje I</proc/filesystems>. Wszystkie wypisane tam typy zostaną wypróbowane, z wyjątkiem tych oznaczonych jako "nodev" (np. I<devpts>, I<proc> i I<nfs>). Jeśli I</etc/filesystems> kończy się wierszem z pojedynczą *, mount odczyta później plik I</proc/filesystems>.

source: The B<auto> type may be useful for user-mounted floppies. Creating a file I</etc/filesystems> can be useful to change the probe order (e.g., to try vfat before msdos or ext3 before ext2) or if you use a kernel module autoloader.
pl: Typ B<auto> może być przydatny do montowanych przez użytkownika dyskietek. Utworzenie pliku I</etc/filesystems> przydaje się do zmiany kolejności rozpoznawania (np. do próbowania vfat przed msdos lub ext3 przez ext2) lub w przypadku stosowania modułu autoloadera.

source: More than one type may be specified in a comma separated list. The list of filesystem types can be prefixed with B<no> to specify the filesystem types on which no action should be taken. (This can be meaningful with the B<-a> option.) For example, the command:
pl: Można podać więcej niż jeden typ, w postaci listy rozdzielonej przecinkami. Lista typów systemów plików może być poprzedzona słowem B<no> aby określić systemy plików, na których żadna akcja nie powinna być wykonywana (może to mieć znaczenie z opcją B<-a>). Na przykład polecenie:

source: mounts all filesystems except those of type I<msdos> and I<ext>.
pl: montuje wszystkie systemy plików poza tymi, które są typu I<msdos> lub I<ext>.

source: B<-O, --test-opts >I<opts>
pl: B<-O, --test-opts >I<opcje>

source: Used in conjunction with B<-a>, to limit the set of filesystems to which the B<-a> is applied. Like B<-t> in this regard except that it is useless except in the context of B<-a>. For example, the command:
pl: Używany w połączeniu z B<-a>, aby ograniczyć grupę systemów plików, do której stosowana jest opcja B<-a>. Podobnie jak B<-t>, z tym wyjątkiem, że jest bezużyteczna bez opcji B<-a>. Na przykład polecenie:

source: mounts all filesystems except those which have the option I<_netdev> specified in the options field in the I</etc/fstab> file.
pl: montuje wszystkie systemy plików z wyjątkiem posiadających podaną opcją I<_netdev> w polu opcji pliku I</etc/fstab>.

source: It is different from B<-t> in that each option is matched exactly; a leading B<no> at the beginning of one option does not negate the rest.
pl: Różni się od B<-t> tym, że każda opcja jest dopasowywana dokładnie; a podanie B<no> na początku jednej opcji, nie neguje pozostałych.

source: The B<-t> and B<-O> options are cumulative in effect; that is, the command
pl: Opcje B<-t> i B<-O> łączą swe działanie; to jest polecenie

source: mounts all ext2 filesystems with the _netdev option, not all filesystems that are either ext2 or have the _netdev option specified.
pl: montuje wszystkie systemy plików ext2 z opcją _netdev, a nie wszystkie systemy które są albo typu ext2, albo mają podaną opcją _netdev.

source: B<-o, --options >I<opts>
pl: B<-o, --options >I<opcje>

source: Options are specified with a B<-o> flag followed by a comma separated string of options. For example:
pl: Opcje są podawane z flagą B<-o>, po której następuje łańcuch z opcjami oddzielonymi przecinkami. Na przykład:

source: For more details, see B<FILESYSTEM INDEPENDENT MOUNT OPTIONS> and B<FILESYSTEM SPECIFIC MOUNT OPTIONS> sections.
pl: Aby dowiedzieć się więcej, proszę zapoznać się z rozdziałami B<OPCJE MONTOWANIA NIEZALEŻNE OD SYSTEMU PLIKÓW> i B<OPCJE MONTOWANIA SPECYFICZNE DLA RÓŻNYCH SYSTEMÓW PLIKÓW>.

source: Remount a subtree somewhere else (so that its contents are available in both places). See above.
pl: Montuje ponownie poddrzewo w innym miejscu (tak, że jego zawartość jest dostępna w obu miejscach). Patrz wyżej.

source: Remount a subtree and all possible submounts somewhere else (so that its contents are available in both places). See above.
pl: Montuje ponownie poddrzewo wraz ze wszystkimi ewentualnymi montowaniami znajdującymi się poniżej, w innym miejscu (tak, że jego zawartość jest dostępna w obu miejscach). Patrz wyżej.

source: Move a subtree to some other place. See above.
pl: Przenosi poddrzewo w inne miejsce. Patrz powyżej.

source: FILESYSTEM INDEPENDENT MOUNT OPTIONS
pl: OPCJE MONTOWANIA NIEZALEŻNE OD SYSTEMU PLIKÓW

source: Some of these options are only useful when they appear in the I</etc/fstab> file.
pl: Część opcji jest przydatna tylko wówczas, gdy znajdują się w pliku I</etc/fstab>.

source: Some of these options could be enabled or disabled by default in the system kernel. To check the current setting see the options in /proc/mounts.
pl: Część tych opcji może zostać domyślnie włączona lub wyłączona przez jądro systemu. Aby sprawdzić bieżące ustawienia, proszę sprawdzić opcje w /proc/mounts.

source: The following options apply to any filesystem that is being mounted (but not every filesystem actually honors them - e.g., the B<sync> option today has effect only for ext2, ext3, fat, vfat and ufs):
pl: Poniższe opcje dotyczą dowolnego montowanego systemu plików (choć nie każdy z systemów plików faktycznie je honoruje, np. opcja B<sync> obecnie wpływa tylko na ext2, ext3, fat, vfat i ufs):

source: All I/O to the filesystem should be done asynchronously. (See also the B<sync> option.)
pl: Wszelkie operacje wejścia/wyjścia dla tego systemu plików powinny być wykonywane asynchronicznie (patrz również opcja B<sync>).

source: Do not use noatime feature, then the inode access time is controlled by kernel defaults. See also the description for B<strictatime> and B<reatime> mount options.
pl: Nie używa funkcji noatime, w związku z czym czas dostępu i-węzła jest kontrolowany przez wartość domyślną jądra. Patrz również opis opcji montowania B<strictatime> i B<reatime>.

source: Do not update inode access times on this filesystem (e.g., for faster access on the news spool to speed up news servers).
pl: Nie wykonuje aktualizacji czasu dostępu w i-węźle położonym na tym systemie plików (np. w celu uzyskania szybszego dostępu do bufora wiadomości, co przyspiesza działanie serwerów grup dyskusyjnych).

source: Can be mounted with the B<-a> option.
pl: System plików może być montowany opcją B<-a>.

source: Can only be mounted explicitly (i.e., the B<-a> option will not cause the filesystem to be mounted).
pl: Dany system plików może być montowany tylko jawnie (np. opcja B<-a> nie spowoduje jego zamontowania).

source: B<context=>I<context>, B<fscontext=>I<context>, B<defcontext=>I<context> and B<rootcontext=>I<context>
pl: B<context=>I<kontekst>, B<fscontext=>I<kontekst>, B<defcontext=>I<kontekst> i B<rootcontext=>I<kontekst>

source: The B<context=> option is useful when mounting filesystems that do not support extended attributes, such as a floppy or hard disk formatted with VFAT, or systems that are not normally running under SELinux, such as an ext3 formatted disk from a non-SELinux workstation. You can also use B<context=> on filesystems you do not trust, such as a floppy. It also helps in compatibility with xattr-supporting filesystems on earlier 2.4.E<lt>xE<gt> kernel versions. Even where xattrs are supported, you can save time not having to label every file by assigning the entire disk one security context.
pl: Opcja B<context=> jest przydatna podczas montowania systemów plików, które nie obsługują atrybutów rozszerzonych, takich jak dyskietki lub dyski twarde sformatowane w VFAT lub systemy które zwykle nie działają pod SELinuksem, takie jak dyski sformatowane w ext3 ze stacji roboczej nie używającej SELinuksa. Można również użyć opcji B<context=> na systemach plików, którym się nie ufa, takich jak dyskietki. Pomaga również w kompatybilności z systemami plików obsługującymi xattr na wcześniejszych wersjach jądra 2.4.E<lt>xE<gt>. Nawet gdy xattr są obsługiwane, można zawsze oszczędzić czas nie etykietując każdego pliku, a przypisując całemu dyskowi jeden kontekst bezpieczeństwa.

source: A commonly used option for removable media is B<context=system_u:object_r:removable_t>.
pl: Często używaną opcją w przypadku nośników wymiennych jest B<context=system_u:object_r:removable_t>.

source: Two other options are B<fscontext=> and B<defcontext=>, both of which are mutually exclusive of the context option. This means you can use fscontext and defcontext with each other, but neither can be used with context.
pl: Dwiema innymi opcjami są B<fscontext> i B<defcontext=>, przy czym wykluczają one opcję context. Oznacza to, że można użyć razem fscontext i defcontext, ale żadnej nie można użyć z context.

source: The B<fscontext=> option works for all filesystems, regardless of their xattr support. The fscontext option sets the overarching filesystem label to a specific security context. This filesystem label is separate from the individual labels on the files. It represents the entire filesystem for certain kinds of permission checks, such as during mount or file creation. Individual file labels are still obtained from the xattrs on the files themselves. The context option actually sets the aggregate context that fscontext provides, in addition to supplying the same label for individual files.
pl: Opcja B<fscontext> działa ze wszystkimi systemami plików, niezależnie od ich obsługi xattr. Opcja fscontext ustawia nadrzędną etykietę systemu plików na określony kontekst bezpieczeństwa. Etykieta systemu plików jest oddzielona od poszczególnych etykiet plików. Reprezentuje cały system plików w celu określonego typu sprawdzeń uprawnień, takich jak podczas montowania lub tworzenia pliku. Poszczególne etykiety pliku są wciąż pobierane z xattrs z samych plików. Opcja context w rzeczywistości ustawia zsumowany kontekst udostępniany przez fscontext, poza podawaniem samej etykiety poszczególnych plików.

source: You can set the default security context for unlabeled files using B<defcontext=> option. This overrides the value set for unlabeled files in the policy and requires a filesystem that supports xattr labeling.
pl: Można ustawić domyślny kontekst bezpieczeństwa do plików bez etykiety, przy użyciu opcji B<defcontext=>. Przesłania ona wartość ustawioną przez zasady (politykę) do plików bez etykiety i wymaga systemu plików obsługującego etykietowanie xattr.

source: The B<rootcontext=> option allows you to explicitly label the root inode of a FS being mounted before that FS or inode because visable to userspace. This was found to be useful for things like stateless linux.
pl: Opcja B<rootcontext> pozwala na jawne podanie etykiety głównego i-węzła systemu plików przez zamontowaniem jego lub i-węzła z powodu widoczności w przestrzeni użytkownika. Może być to przydatne przy wykorzystaniu "stateless linux".

source: Note that kernel rejects any remount request that includes the context option even if unchanged from the current context.
pl: Proszę zauważyć, że jądro odrzuca żądania przemontowania, które zawierają opcję context, nawet gdy nie różni się ona od bieżącego kontekstu.

source: For more details, see B<selinux>(8)
pl: Aby dowiedzieć się więcej, proszę zapoznać się z B<selinux>(8)

source: Use default options: B<rw>, B<suid>, B<dev>, B<exec>, B<auto>, B<nouser>, and B<async.>
pl: Używa opcji domyślnych: B<rw>, B<suid>, B<dev>, B<exec>, B<auto>, B<nouser> i B<async>.

source: Interpret character or block special devices on the filesystem.
pl: Interpretuje specjalne urządzenia blokowe i znakowe na danym systemie plików.

source: Do not interpret character or block special devices on the file system.
pl: Nie interpretuje specjalnych urządzeń blokowych ani znakowych na systemie plików.

source: Update directory inode access times on this filesystem. This is the default.
pl: Aktualizuje czas dostępu katalogu zapisany w i-węźle w danym systemie plików. Tak jest domyślnie.

source: Do not update directory inode access times on this filesystem.
pl: Nie aktualizuje czasu dostępu katalogu zapisanego w i-węźle w danym systemie plików.

source: All directory updates within the filesystem should be done synchronously. This affects the following system calls: creat, link, unlink, symlink, mkdir, rmdir, mknod and rename.
pl: Aktualizacja wszystkich katalogów w systemie plików powinna być wykonywana synchronicznie. Dotyka to następujących wywołań systemowych: creat, link, unlink, symlink, mkdir, rmdir, mknod i rename.

source: Permit execution of binaries.
pl: Zezwala na uruchamianie plików binarnych.

source: Do not allow direct execution of any binaries on the mounted filesystem. (Until recently it was possible to run binaries anyway using a command like /lib/ld*.so /mnt/binary. This trick fails since Linux 2.4.25 / 2.6.0.)
pl: Nie zezwala na bezpośrednie wywołanie plików binarnych w zamontowanym systemie plików (do niedawna było możliwe obejście tego ograniczenia przy użyciu polecenia w stylu /lib/ld*.so /mnt/binary, jednak ta sztuczka nie działa od Linuksa 2.4.25/2.6.0).

source: Allow an ordinary (i.e., non-root) user to mount the filesystem if one of his groups matches the group of the device. This option implies the options B<nosuid> and B<nodev> (unless overridden by subsequent options, as in the option line B<group,dev,suid>).
pl: Pozwala na zamontowanie tego systemu plików przez zwykłego użytkownika (tzn. nie roota), jeśli jedna z jego grup pasuje do grup urządzenia. Opcja ta implikuje opcje B<nosuid>, i B<nodev> (chyba że są przesłaniane przez następne opcje, jak w linii B<group,dev,suid>).

source: Specifies an encryption algorithm to use. Used in conjunction with the B<loop> option.
pl: Określa używany algorytm szyfrowania. Używane w połączeniu z opcją B<loop>.

source: Specifies the key size to use for an encryption algorithm. Used in conjunction with the B<loop> and B<encryption> options. B<nofail> Do not report errors for this device if it does not exist. B<iversion> Every time the inode is modified, the i_version field will be incremented.
pl: Określa rozmiar klucza używanego w algorytmie szyfrowania. Używane w połączeniu z opcjami B<loop> i B<encryption>. B<nofail> - nie informuje o błędach dla tego urządzenia, jeśli nie istnieje. B<iversion> - przy każdej modyfikacji i-węzła, pole i_version jest zwiększane.

source: Do not increment the i_version inode field.
pl: Nie zwiększa pola i-węzła i_version.

source: Allow mandatory locks on this filesystem. See B<fcntl>(2).
pl: Pozwala na ściśle egzekwowane blokady w systemie plików. Patrz B<fcntl>(2).

source: Do not allow mandatory locks on this filesystem.
pl: Nie pozwala na ściśle egzekwowane blokady w systemie plików.

source: The filesystem resides on a device that requires network access (used to prevent the system from attempting to mount these filesystems until the network has been enabled on the system).
pl: System plików znajduje się na urządzeniu wymagającym połączenia sieciowego (używane aby zapobiec montowania przez system takich systemów plików, dopóki sieć nie zostanie włączona w systemie).

source: Do not report errors for this device if it does not exist.
pl: Nie informuje o błędach urządzenia, jeśli ono nie istnieje.

source: Update inode access times relative to modify or change time. Access time is only updated if the previous access time was earlier than the current modify or change time. (Similar to noatime, but doesn't break mutt or other applications that need to know if a file has been read since the last time it was modified.)
pl: Aktualizuje czas dostępu i-węzła relatywnie do czasu modyfikacji lub zmiany. Czas dostępu jest aktualizowany tylko wówczas, jeśli poprzedni czas dostępu był wcześniejszy od bieżącego czasu modyfikacji lub zmiany (podobne do noatime, ale nie psuje aplikacji mutt i innych, które potrzebują informacji o tym, czy plik zostać przeczytany od czasu jego ostatniej modyfikacji).

source: Since Linux 2.6.30, the kernel defaults to the behavior provided by this option (unless B<noatime> was specified), and the B<strictatime> option is required to obtain traditional semantics. In addition, since Linux 2.6.30, the file's last access time is always updated if it is more than 1 day old.
pl: Od Linuksa w wersji 2.6.30, jądro używa domyślnie zachowania udostępnianego przez tę opcję (chyba że podano B<noatime>), a opcja B<strictatime> jest wymagana, aby uzyskać tradycyjny sposób działania. Dodatkowo, od tej wersji Linuksa, czas ostatniego dostępu pliku jest aktualizowany zawsze, jeśli wynosi więcej niż 1 dzień.

source: Do not use B<relatime> feature. See also the B<strictatime> mount option.
pl: Nie używa funkcji B<relatime>. Patrz również opcja montowania B<strictatime>.

source: Allows to explicitly requesting full atime updates. This makes it possible for kernel to defaults to B<relatime> or B<noatime> but still allow userspace to override it. For more details about the default system mount options see /proc/mounts.
pl: Pozwala na jawne żądanie pełnych aktualizacji atime. Umożliwia jądru na domyślne używanie B<relatime> lub B<noatime>, ale wciąż pozwala warstwie użytkownika na przesłonięcie tych opcji. Aby dowiedzieć się więcej o domyślnych, systemowych opcjach montowania należy zapoznać się z /proc/mount.

source: Use the kernel's default behaviour for inode access time updates.
pl: Używa domyślnego zachowania jądra dotyczącego aktualizowania czasów dostępu i-węzłów.

source: Allow set-user-identifier or set-group-identifier bits to take effect.
pl: Umożliwia działanie bitom set-user-id i set-group-id.
