Repository: eurolinux-enterprise-linux-sources/man-pages-pl
Catalog: src/po/man8/sulogin.8.po
Languages: pl

source: 17 Jan 2006
pl: 17 stycznia 2006

source: Linux System Administrator's Manual
pl: Podręcznik administratora systemu Linux

source: NAME
pl: NAZWA

source: sulogin - Single-user login
pl: sulogin - login w trybie jednoużytkownikowym

source: SYNOPSIS
pl: SKŁADNIA

source: B<sulogin> [ B<-e> ] [ B<-p> ] [ B<-t> I<SECONDS> ] [ I<TTY> ]
pl: B<sulogin> [ B<-e> ] [ B<-p> ] [ B<-t> I<SEKUNDY> ] [ I<TTY> ]

source: DESCRIPTION
pl: OPIS

source: I<sulogin> is invoked by B<init(8)> when the system goes into single user mode. (This is done through an entry in I<inittab(5)>.) B<Init> also tries to execute I<sulogin> when the boot loader (e.g., B<grub>(8)) passes it the B<-b> option.
pl: B<sulogin> jest wywoływany przez B<init(8)> gdy system wchodzi w tryb jednoużytkownikowy (jest to wykonywane za pomocą wpisu w I<inittab(5)>). B<Init> stara się również wykonać B<sulogin>, gdy program rozruchowy (np. B<grub>(8)) poda mu opcję B<-b>.

source: The user is prompted
pl: Wyświetlany jest następujący komunikat zachęty:

source: If the root account is locked, no password prompt is displayed and I<sulogin> behaves as if the correct password were entered.
pl: (Podaj hasło roota do konserwacji systemu lub wciśnij ^D aby kontynuować zwykły start) Gdy konto roota jest zablokowane, to powyższa zachęta nie jest wyświetlana, a B<sulogin> zachowuje się tak, jakby podano prawidłowe hasło roota.

source: I<sulogin> will be connected to the current terminal, or to the optional device that can be specified on the command line (typically B</dev/console>).
pl: B<sulogin> będzie podłączony do bieżącego terminala lub do opcjonalnego urządzenia podanego w wierszu polecenia zwykle (B</dev/console>).

source: If the B<-t> option is used then the program only waits the given number of seconds for user input.
pl: Gdy użyje się opcji B<-t>, to program czeka na reakcję użytkownika jedynie określoną liczbę sekund.

source: If the B<-p> option is used then the single-user shell is invoked with a I<dash> as the first character in I<argv[0]>. This causes the shell process to behave as a login shell. The default is I<not> to do this, so that the shell will I<not> read B</etc/profile> or B<$HOME/.profile> at startup.
pl: Przy wykorzystaniu opcji B<-p>, powłoka jednoużytkownikowa jest przywoływana z I<myślnikiem> jako pierwszym znakiem w I<argv[0]>. Powoduje to, że powłoka zachowuje się jak powłoka zgłoszeniowa. Domyślnie tak się I<nie> dzieje, tak więc powłoka I<nie> odczytuje plików B</etc/profile> ani B<$HOME/.profile> przy starcie.

source: After the user exits the single-user shell, or presses control-D at the prompt, the system will (continue to) boot to the default runlevel.
pl: Po tym, jak użytkownik wyjdzie z trybu jednoużytkownikowego lub wciśnie control-D po wyświetleniu zachęty, system będzie kontynuował rozruch do domyślnego poziomu pracy.

source: ENVIRONMENT VARIABLES
pl: ZMIENNE ŚRODOWISKA

source: I<sulogin> looks for the environment variable B<SUSHELL> or B<sushell> to determine what shell to start. If the environment variable is not set, it will try to execute root's shell from /etc/passwd. If that fails it will fall back to B</bin/sh>.
pl: B<sulogin> szuka zmiennych środowiskowych B<SUSHELL> lub B<sushell>, aby określić którą powłokę uruchomić. Jeśli zmienna środowiskowa nie jest ustawiona, to program spróbuje wykonać powłokę roota z pliku /etc/passwd. Jeśli to również się nie powiedzie, to na końcu wykorzystana zostanie powłoka B</bin/sh>.

source: This is very valuable together with the B<-b> option to init. To boot the system into single user mode, with the root file system mounted read/write, using a special "fail safe" shell that is statically linked (this example is valid for the LILO bootprompt)
pl: Jest to niezwykle przydatne w połączeniu z opcją B<-b> do inita. Aby uruchomić system w trybie jednoużytkownikowym, z głównym systemem plików zamontowanym do odczytu i zapisu przy użyciu specjalnej "niezawodnej" powłoki, która jest statycznie zlinkowana (poniższy przykład jest prawidłowy z wierszem polecenia LILO):

source: FALLBACK METHODS
pl: METODY ZASTĘPCZE

source: I<sulogin> checks the root password using the standard method (getpwnam) first. Then, if the B<-e> option was specified, I<sulogin> examines these files directly to find the root password:
pl: B<sulogin> najpierw sprawdza hasło roota przy użyciu standardowej metody - getpwnam. Następnie, jeśli poda się opcję B<-e>, to B<sulogin> sprawdza bezpośrednio następujące pliki, w celu znalezienia hasło roota:

source: /etc/shadow (if present)
pl: /etc/shadow (jeśli istnieje)

source: If they are damaged or nonexistent, sulogin will start a root shell without asking for a password. Only use the B<-e> option if you are sure the console is physically protected against unauthorized access.
pl: Jeśli są one uszkodzone lub nie istnieją, to sulogin uruchomi powłokę roota bez pytania o hasło. Opcji B<-e> należy używać tylko, gdy jest się pewnym, że konsola jest fizycznie zabezpieczona przed nieautoryzowanym dostępem.

source: AUTHOR
pl: AUTOR

source: SEE ALSO
pl: ZOBACZ TAKŻE

source: init(8), inittab(5).
pl: B<init>(8), B<inittab>(5).
