Repository: eurolinux-enterprise-linux-sources/man-pages-pl
Catalog: src/po/man8/umount.8.po
Languages: pl

source: March 2010
pl: marzec 2010

source: System Administration
pl: Administracja systemem

source: NAME
pl: NAZWA

source: umount - unmount file systems
pl: umount - odmontowuje systemy plików

source: SYNOPSIS
pl: SKŁADNIA

source: B<umount -a> [B<-dflnrv>] [B<-t> I<vfstype>] [B<-O> I<options>]
pl: B<umount -a> [B<-dflnrv>] [B<-t> I<typ-systemu-plików>] [B<-O> I<opcje>]

source: B<umount> [B<-dflnrv>] {I<dir>|I<device>}...
pl: B<umount> [B<-dflnrv>] {I<katalog>|I<urządzenie>}

source: DESCRIPTION
pl: OPIS

source: The B<umount> command detaches the file system(s) mentioned from the file hierarchy. A file system is specified by giving the directory where it has been mounted. Giving the special device on which the file system lives may also work, but is obsolete, mainly because it will fail in case this device was mounted on more than one directory.
pl: Polecenie B<umount> odłącza wymienione systemy plików z hierarchii plików. System plików jest określany przez podanie katalogu, w którym został zamontowany. Podanie urządzenia, na którym system plików istnieje, może również działać, jednakże jest przestarzałe, głównie dlatego, że zawiedzie, gdy urządzenie jest zamontowane w więcej niż jednym katalogu.

source: Note that a file system cannot be unmounted when it is `busy' - for example, when there are open files on it, or when some process has its working directory there, or when a swap file on it is in use. The offending process could even be B<umount> itself - it opens libc, and libc in its turn may open for example locale files. A lazy unmount avoids this problem.
pl: Proszę zauważyć, że system plików nie może być odmontowany, gdy jest "busy" (zajęty) - na przykład, gdy są na nim otwarte pliki, gdy jakiś proces ma tam swój katalog roboczy albo gdy w użytku jest znajdujący się na nim plik wymiany. Przeszkadzającym procesem może być nawet sam B<umount> - otwiera on libc, zaś libc z kolei może otwierać na przykład pliki ustawień locale. Leniwe odmontowywanie ("lazy umount") rozwiązuje ten problem.

source: Options for the B<umount> command:
pl: Polecenie B<umount> przyjmuje następujące opcje:

source: Print version and exit.
pl: Wypisuje wersję i wychodzi.

source: Print help message and exit.
pl: Wypisuje informację o użyciu i wychodzi.

source: Verbose mode.
pl: Tryb szczegółowy.

source: Unmount without writing in I</etc/mtab>.
pl: Odmontowuje bez zapisywania w I</etc/mtab>.

source: In case unmounting fails, try to remount read-only.
pl: Jeśli odmontowanie się nie powiedzie, próbuje zamontować ponownie w trybie tylko do odczytu.

source: In case the unmounted device was a loop device, also free this loop device.
pl: Jeżeli odmontowane urzdzenie było urządzeniem pętli zwrotnej ("loop device"), to je zwalnia.

source: Don't call the /sbin/umount.E<lt>filesystemE<gt> helper even if it exists. By default /sbin/umount.E<lt>filesystemE<gt> helper is called if one exists.
pl: Nie wywołuje programu pomocniczego /sbin/umount.E<lt>system-plikówE<gt>, nawet jeśli istnieje. Domyślnie jest on wywoływany, jeśli istnieje.

source: All of the file systems described in I</etc/mtab> are unmounted. (With B<umount> version 2.7 and later: the I<proc> filesystem is not unmounted.)
pl: Odmontowuje wszystkie systemy plików opisane w I</etc/mtab>. (W B<umount> w wersji 2.7 i późniejszych nie jest odłączany system plików I<proc>).

source: B<-t>I< vfstype>
pl: B<-t>I< typ-systemu-plików>

source: Indicate that the actions should only be taken on file systems of the specified type. More than one type may be specified in a comma separated list. The list of file system types can be prefixed with B<no> to specify the file system types on which no action should be taken.
pl: Wskazuje, że akcje powinny być dokonywane tylko na systemach plików określonego typu. Można podać więcej niż jeden typ, używając listy oddzielanej przecinkami. Lista systemów plików może być poprzedzona słowem B<no>, aby wskazać, że akcja wymienionych systemów plików nie dotyczy.

source: B<-O>I< options>
pl: B<-O>I< opcje>

source: Indicate that the actions should only be taken on file systems with the specified options in I</etc/fstab>. More than one option type may be specified in a comma separated list. Each option can be prefixed with B<no> to specify options for which no action should be taken.
pl: Określa, że akcje powinny być wykonane tylko na systemach plików z odpowiednimi opcjami wymienionymi w I</etc/fstab>. Można podać więcej niż jedną opcję, używając listy oddzielanej przecinkami. Lista opcji może być poprzedzona słowem B<no>, aby podać opcje, dla których nie powinna być podejmowana żadna akcja.

source: Force unmount (in case of an unreachable NFS system). (Requires kernel 2.1.116 or later.)
pl: Wymusza odmontowanie (w przypadku nieosiągalnego systemu NFS). (Wymaga jądra 2.1.116 lub późniejszego).

source: Lazy unmount. Detach the filesystem from the filesystem hierarchy now, and cleanup all references to the filesystem as soon as it is not busy anymore. (Requires kernel 2.4.11 or later.)
pl: Leniwe odmontowanie ("lazy umount"). Od razu odłącza system plików od hierarchii systemu plików i czyści wszystkie referencje do tego systemu plików, gdy tylko przestanie być zajęty ("busy"). (Wymaga jądra 2.4.11 lub późniejszego).

source: Don't canonicalize paths. For more details about this option see the B<mount(8)> man page.
pl: Nie normalizuje ścieżek. Więcej szczegółów na temat tej opcji można uzyskać zapoznając się ze stroną podręcznika B<mount(8)>.

source: Causes everything to be done except for the actual system call; this ``fakes'' unmounting the filesystem. It can be used to remove entries from I</etc/mtab> that were unmounted earlier with the -n option.
pl: Powoduje wykonywanie wszystkiego poza faktycznym wywołaniem funkcji systemowej. Jeśli nie jest to oczywiste: "udaje" to odmontowanie systemu plików. Opcja może być używana do usuwania wpisów z I</etc/mtab> dla urządzeń, które zamontowano wcześniej z opcją -n.

source: THE LOOP DEVICE
pl: URZĄDZENIE PĘTLI ZWROTNEJ - LOOP DEVICE

source: The B<umount> command will free the loop device (if any) associated with the mount, in case it finds the option `loop=...' in I</etc/mtab>, or when the -d option was given. Any pending loop devices can be freed using `losetup -d', see B<losetup>(8).
pl: Polecenie B<umount> może zwolnić związane z montowaniem urządzenie pętli zwrotnej. Dzieje się tak, gdy napotkana zostanie opcja "loop=..." w pliku I</etc/mtab>, lub gdy podano opcję -d. Pozostałe urządzenia loop mogą być zwolnione przez "losetup -d", patrz B<losetup>(8).

source: NOTES
pl: UWAGI

source: The syntax of external umount helpers is:
pl: Składnia zewnętrznych programów pomocniczych umount jest następująca:

source: B</sbin/umount.>I<E<lt>suffixE<gt>> {I<dir>|I<device>} [B<-nlfvr>] [B<-t> I<type.subtype>]
pl: B</sbin/umount.>I<E<lt>przyrostekE<gt>> {I<katalog>|I<urządzenie>} [B<-nlfnv>] [B<-t> I<typ.podtyp>]

source: where the E<lt>suffixE<gt> is filesystem type or a value from "uhelper=" or "helper=" mtab option. The -t option is used for filesystems with subtypes support (for example /sbin/mount.fuse -t fuse.sshfs).
pl: gdzie E<lt>przyrostekE<gt> jest typem systemu plików lub wartością z opcji mtab "uhelper=" lub "helper=". Opcja -t jest używana do systemów plików, które obsługują podtypy (np. /sbin/mount.fuse -t fuse.sshfs).

source: The uhelper= (unprivileged umount helper) is possible to use when non-root user wants to umount a mountpoint which is not defined in the /etc/fstab file (e.g devices mounted by udisk).
pl: Gdy użytkownik niebędący rootem chce odmontować punkt montowania, którego niezdefiniowano w /etc/fstab (np. urządzenie zamontowane przez udisk), można użyć opcji uhelper= (nieuprzywilejowany program pomocniczy umount).

source: The helper= mount option redirects all umount requests to the /sbin/umount.E<lt>helperE<gt> independently on UID.
pl: Opcja montowania helper= przekierowuje wszystkie żądania umount do /sbin/umount.E<lt>helperE<gt> niezależnie od UID.

source: FILES
pl: PLIKI

source: I</etc/mtab> table of mounted file systems
pl: I</etc/mtab> tabela zamontowanych systemów plików

source: SEE ALSO
pl: ZOBACZ TAKŻE

source: HISTORY
pl: HISTORIA

source: A B<umount> command appeared in Version 6 AT&T UNIX.
pl: Polecenie B<umount> pojawiło się w wersji 6 AT&T UNIX.

source: AVAILABILITY
pl: DOSTĘPNOŚĆ

source: The umount command is part of the util-linux package and is available from ftp://ftp.kernel.org/pub/linux/utils/util-linux/.
pl: Polecenie umount jest częścią pakietu util-linux i jest dostępne pod adresem ftp://ftp.kernel.org/pub/linux/utils/util-linux/.
