Repository: eurolinux-enterprise-linux-sources/man-pages-pl
Catalog: src/po/man5/proc.5.po
Languages: pl

source: This is a directory that contains one subdirectory for each thread in the process. The name of each subdirectory is the numerical thread ID (I<[tid]>) of the thread (see B<gettid>(2)). Within each of these subdirectories, there is a set of files with the same names and contents as under the I</proc/[pid]> directories. For attributes that are shared by all threads, the contents for each of the files under the I<task/[tid]> subdirectories will be the same as in the corresponding file in the parent I</proc/[pid]> directory (e.g., in a multithreaded process, all of the I<task/[tid]/cwd> files will have the same value as the I</proc/[pid]/cwd> file in the parent directory, since all of the threads in a process share a working directory). For attributes that are distinct for each thread, the corresponding files under I<task/[tid]> may have different values (e.g., various fields in each of the I<task/[tid]/status> files may be different for each thread).
pl: Jest to katalog zawierający po jednym podkatalogu dla każdego wątku procesu. Nazwą każdego podkatalogu jest numeryczne ID (I<[tid]>) wątku (patrz B<gettid>(2)). Każdy z podkatalogów zawiera zbiór plików o tej samej nazwie i zawartości, co katalogi I</proc/[pid]>. Dla atrybutów, które są współdzielone przez wszystkie wątki zawartość każdego z plików w podkatalogach I<task/[tid]> będzie taka sama jak zawartość odpowiednich plików w nadrzędnym katalogu I</proc/[pid]> (np. w procesie wielowątkowym wszystkie pliki I<task/[tid]/cwd> będą miały taką samą zawartość, jak plik I</proc/[pid]/cwd> w katalogu nadrzędnym, ponieważ wszystkie wątki procesu dzielą katalog bieżący). Dla atrybutów, które dla każdego wątku są różne, odpowiednie pliki wI<task/[tid]> mogą mieć różne wartości (np. różne pola w każdym z plików I<task/[tid]/status> mogą być inne dla każdego wątku).

source: In a multithreaded process, the contents of the I</proc/[pid]/task> directory are not available if the main thread has already terminated (typically by calling B<pthread_exit>(3)).
pl: W procesie wielowątkowym zawartość katalogu I</proc/[pid]/task> nie jest dostępna, jeżeli wątek główny już się zakończył (najprawdopodobniej wywołując B<pthread_exit>(3)).

source: Advanced power management version and battery information when B<CONFIG_APM> is defined at kernel compilation time.
pl: Wersja APM (Zaawansowane zarządzanie energią) oraz informacja o akumulatorach, gdy B<CONFIG_APM> było zdefiniowane podczas kompilacji jądra.

source: Contains subdirectories for installed busses.
pl: Zawiera podkatalogi odpowiadające zainstalowanym magistralom.

source: Subdirectory for PCMCIA devices when B<CONFIG_PCMCIA> is set at kernel compilation time.
pl: Podkatalog dla urządzeń PCMCIA, gdy B<CONFIG_PCMCIA> było zdefiniowane podczas kompilacji jądra.

source: Contains various bus subdirectories and pseudo-files containing information about PCI busses, installed devices, and device drivers. Some of these files are not ASCII.
pl: Zawiera różne podkatalogi magistral oraz pseudopliki zawierające informacje o magistralach PCI, zainstalowanych urządzeniach oraz sterownikach urządzeń. Niektóre z tych plików nie są w postaci ASCII.

source: Information about PCI devices. They may be accessed through B<lspci>(8) and B<setpci>(8).
pl: Informacje o urządzeniach PCI. Dostęp do nich może się odbywać poprzez B<lspci>(8) i B<setpci>(8).

source: Arguments passed to the Linux kernel at boot time. Often done via a boot manager such as B<lilo>(8) or B<grub>(8).
pl: Argumenty przekazane jądru Linux podczas startu systemu. Zazwyczaj odbywa się to poprzez zarządcę startu systemu, takiego jak B<lilo>(8) lub B<grub>(8).

source: I</proc/config.gz> (since Linux 2.6)
pl: I</proc/config.gz> (od Linuksa 2.6)

source: This file exposes the configuration options that were used to build the currently running kernel, in the same format as they would be shown in the I<.config> file that resulted when configuring the kernel (using I<make xconfig>, I<make config>, or similar). The file contents are compressed; view or search them using B<zcat>(1), B<zgrep>(1), etc. As long as no changes have been made to the following file, the contents of I</proc/config.gz> are the same as those provided by :
pl: Plik pokazuje opcje konfiguracyjne, które były użyte do zbudowania aktualnie działającego jądra, w tym samym formacie, jaki jest używany przez plik I<.config>, który jest wynikiem konfiguracji jądra (używając I<make xconfig>, I<make config> i podobnych poleceń). Zawartość pliku jest skompresowana; można ją odczytać lub wyszukać za pomocą B<zcat>(1), B<zgrep>(1) itd. Tak długo jak nie zostały dokonane zmiany w poniższym pliku, zawartość I</proc/config.gz> jest taka sama jak ta udostępniona przez:

source: I</proc/config.gz> is only provided if the kernel is configured with B<CONFIG_IKCONFIG_PROC>.
pl: I</proc/config.gz> jest udostępniany wyłącznie wtedy, gdy jądro jest skonfigurowane z B<CONFIG_IKCONFIG_PROC>.

source: This is a collection of CPU and system architecture dependent items, for each supported architecture a different list. Two common entries are I<processor> which gives CPU number and I<bogomips>; a system constant that is calculated during kernel initialization. SMP machines have information for each CPU.
pl: Jest to zbiór elementów zależnych od CPU i architektury systemu; dla każdej wspieranej architektury jest inna lista. Dwa popularne wpisy to: I<processor>, który udostępnia numer CPU oraz I<bogomips>; jest to stała systemowa, wyliczona podczas inicjalizacji jądra. Maszyny SMP zawierają informacje o każdym z procesorów.

source: Text listing of major numbers and device groups. This can be used by MAKEDEV scripts for consistency with the kernel.
pl: Listing tekstowy numerów głównych oraz grup urządzeń. Może to służyć skryptom MAKEDEV do zachowania spójności z jądrem.

source: I</proc/diskstats> (since Linux 2.5.69)
pl: I</proc/diskstats> (od wersji Linuksa 2.5.69)

source: This file contains disk I/O statistics for each disk device. See the kernel source file I<Documentation/iostats.txt> for further information.
pl: Plik zawiera statystyki operacji wejścia/wyjścia dla każdego urządzenia dyskowego. Dalsze informacje można znaleźć w pliku I<Documentation/iostats.txt> w źródłach jądra.

source: This is a list of the registered I<ISA> DMA (direct memory access) channels in use.
pl: Jest listą zarejestrowanych i używanych kanałów DMA (direct memory access) szyny I<ISA>.

source: Empty subdirectory.
pl: Pusty podkatalog.

source: List of the execution domains (ABI personalities).
pl: Lista domen uruchamiania (wcieleń ABI [Application Binary Interface - przyp. tłum.]).

source: Frame buffer information when B<CONFIG_FB> is defined during kernel compilation.
pl: Informacje o buforze ramki, o ile podczas kompilacji jądra zdefiniowano B<CONFIG_FB>.

source: A text listing of the file systems which are supported by the kernel, namely file systems which were compiled into the kernel or whose kernel modules are currently loaded. (See also B<filesystems>(5).) If a file system is marked with "nodev", this means that it does not require a block device to be mounted (e.g., virtual file system, network file system).
pl: Tekstowa lista systemów plików obsługiwanych przez jądro, a konkretnie systemów plików, które zostały wkompilowane w jądro lub których moduły jądra są obecnie załadowane (patrz również B<filesystems>(5)). Jeśli system plików jest oznaczony jako "nodev" oznacza to, że nie wymaga on zamontowania urządzenia blokowego (np. jest to wirtualny lub sieciowy system plików).

source: Incidentally, this file may be used by B<mount>(8) when no file system is specified and it didn't manage to determine the file system type. Then file systems contained in this file are tried (excepted those that are marked with "nodev").
pl: Plik ten może być niekiedy użyty przez B<mount>(8), gdy nie podano systemów plików i nie potrafi on określić typu systemu plików. Próbowane są wówczas systemy plików wypisane w tym pliku (poza systemami z oznaczeniem "nodev").

source: This directory exists on systems with the IDE bus. There are directories for each IDE channel and attached device. Files include:
pl: Katalog ten istnieje w systemach zawierających magistralę IDE. Zawiera po jednym katalogu dla każdego kanału IDE oraz dla przyłączonych urządzeń. Wśród plików są:

source: cache buffer size in KB capacity number of sectors driver driver version geometry physical and logical geometry identify in hexadecimal media media type model manufacturer's model number settings drive settings smart_thresholds in hexadecimal smart_values in hexadecimal
pl: cache rozmiar bufora w KB capacity liczba sektorów driver wersja sterownika geometry geometria fizyczna i logiczna identify szesnastkowo media rodzaj nośnika model numer modelu producenta settings ustawienia napędu smart_thresholds szesnastkowo smart_values szesnastkowo

source: The B<hdparm>(8) utility provides access to this information in a friendly format.
pl: Dostęp do tych informacji w przyjaznym formacie umożliwia program narzędziowy B<hdparm>(8).

source: This is used to record the number of interrupts per CPU per IO device. Since Linux 2.6.24, for the i386 and x86_64 architectures, at least, this also includes interrupts internal to the system (that is, not associated with a device as such), such as NMI (nonmaskable interrupt), LOC (local timer interrupt), and for SMP systems, TLB (TLB flush interrupt), RES (rescheduling interrupt), CAL (remote function call interrupt), and possibly others. Very easy to read formatting, done in ASCII.
pl: Plik jest używany do zapisania liczby przerwań na procesor na urządzenie wejścia/wyjścia. Od Linuksa 2.6.24, przynajmniej do architektur i386 i x86_64 zawiera on również przerwania wewnętrznosystemowe (to znaczy nie związane z urządzeniem jako takim), takie jak NMI (nonmaskable interrupt), LOC (local timer interrupt) i do systemów SMP: TLB (TLB flush interrupt), RES (rescheduling interrupt), CAL (remote function call interrupt), mogą również występować inne. Formatowanie jest bardzo czytelne do odczytu, wykonane w ASCII.

source: I/O memory map in Linux 2.4.
pl: Odwzorowanie portów we/wy w pamięci w Linuksie 2.4.

source: This is a list of currently registered Input-Output port regions that are in use.
pl: Jest to lista obecnie zarejestrowanych i używanych obszarów portów we/wy.

source: I</proc/kallsyms> (since Linux 2.5.71)
pl: I</proc/kallsyms> (od wersji Linuksa 2.5.71)

source: This holds the kernel exported symbol definitions used by the B<modules>(X) tools to dynamically link and bind loadable modules. In Linux 2.5.47 and earlier, a similar file with slightly different syntax was named I<ksyms>.
pl: Zawiera wyeksportowane przez jądro definicje symboli, które są używane przez narzędzia B<modules>(X) do dynamicznego podłączania ładowanych modułów. W wersji jądra Linux 2.5.47 i wcześniejszych podobny plik z troszkę odmienną zawartością był nazwany I<ksyms>.

source: This file represents the physical memory of the system and is stored in the ELF core file format. With this pseudo-file, and an unstripped kernel (I</usr/src/linux/vmlinux>) binary, GDB can be used to examine the current state of any kernel data structures.
pl: Plik ten reprezentuje pamięć fizyczną systemu i jest zachowany w formacie pliku core dla ELF. Korzystając z tego pseudopliku oraz z niezestripowanego binarnego pliku jądra (I</usr/src/linux/vmlinux>), można za pomocą GDB testować aktualny stan dowolnej struktury danych jądra.

source: The total length of the file is the size of physical memory (RAM) plus 4KB.
pl: Całkowity rozmiar tego pliku to rozmiar fizycznej pamięci (RAM) plus 4 KB.

source: This file can be used instead of the B<syslog>(2) system call to read kernel messages. A process must have superuser privileges to read this file, and only one process should read this file. This file should not be read if a syslog process is running which uses the B<syslog>(2) system call facility to log kernel messages.
pl: Plik ten może służyć do odczytu komunikatów jądra, zamiast funkcji systemowej B<syslog>(2). Aby odczytać ten plik, proces musi mieć uprawnienia superużytkownika i tylko jeden proces powinien dokonywać jego odczytu. Pliku tego nie należy czytać, gdy działa proces syslog, korzystający z funkcji systemowej B<syslog>(2) do rejestrowania komunikatów jądra.

source: Information in this file is retrieved with the B<dmesg>(1) program.
pl: Z tego pliku pobiera komunikaty program B<dmesg>(1).

source: See I</proc/kallsyms>.
pl: Patrz I</proc/kallsyms>.

source: The first three fields in this file are load average figures giving the number of jobs in the run queue (state R) or waiting for disk I/O (state D) averaged over 1, 5, and 15 minutes. They are the same as the load average numbers given by B<uptime>(1) and other programs. The fourth field consists of two numbers separated by a slash (/). The first of these is the number of currently runnable kernel scheduling entities (processes, threads). The value after the slash is the number of kernel scheduling entities that currently exist on the system. The fifth field is the PID of the process that was most recently created on the system.
pl: Pierwsze trzy pola w tym pliku zawierają średnie obciążenie (loadavg) podając informację o średniej liczbie zadań uruchomionych (stan R) oraz czekających na dyskowe operacje wejścia/wyjścia (stan D) w ciągu ostatnich 1, 5 i 15 minut. Są to te same wartości średniego obciążenia, które podaje B<uptime>(1) i inne programy. Czwarte pole zawiera dwie liczby oddzielone od siebie znakiem ukośnika (/). Pierwsza z nich jest liczbą obecnie wykonywanych zadań (procesów, wątków). Wartość za ukośnikiem jest liczbą zadań, obecnych w systemie. Piąte pole zawiera PID najnowszego ostatnio utworzonego procesu w systemie.

source: This file shows current file locks (B<flock>(2) and B<fcntl>(2)) and leases (B<fcntl>(2)).
pl: Plik ten pokazuje aktualne blokady plików (B<flock>(2) i B<fcntl>(2)) oraz dzierżawy (B<fcntl>(2)).

source: I</proc/malloc> (only up to and including Linux 2.2)
pl: I</proc/malloc> (tylko do wersji 2.2 Linuksa włącznie)

source: This file is only present if B<CONFIG_DEBUG_MALLOC> was defined during compilation.
pl: Ten plik istnieje tylko jeśli podczas kompilacji zdefiniowano B<CONFIG_DEBUG_MALLOC>.

source: This file reports statistics about memory usage on the system. It is used by B<free>(1) to report the amount of free and used memory (both physical and swap) on the system as well as the shared memory and buffers used by the kernel.
pl: Plik zawiera statystyki o użyciu pamięci w systemie. Jest używany przez B<free>(1) do informowania o rozmiarze wolnej i zajętej pamięci (zarówno fizycznej, jak i wymiany) w systemie, a także o pamięci wspólnej i buforach używanych przez jądro.

source: A text list of the modules that have been loaded by the system. See also B<lsmod>(8).
pl: Tekstowa lista modułów, które załadowano w systemie. Zobacz także B<lsmod>(8).

source: Before kernel 2.4.19, this file was a list of all the file systems currently mounted on the system. With the introduction of per-process mount namespaces in Linux 2.4.19, this file became a link to I</proc/self/mounts>, which lists the mount points of the process's own mount namespace. The format of this file is documented in B<fstab>(5).
pl: Przed jądrem 2.4.19 plik ten był listą wszystkich systemów plików zamontowanych aktualnie w systemie. Wraz z wprowadzeniem przestrzeni nazw montowań przydzielanych dla procesu w Linuksie 2.4.19, plik ten stał się dowiązaniem do I</proc/self/mounts>, który zawiera listę punktów montowań we własnej przestrzeni nazw montowań procesu. Format tego pliku jest opisany w B<fstab>(5).

source: Memory Type Range Registers. See the kernel source file I<Documentation/mtrr.txt> for details.
pl: Memory Type Range Registers. Szczegóły można znaleźć w pliku źródeł jądra I<Documentation/mtrr.txt>.

source: various net pseudo-files, all of which give the status of some part of the networking layer. These files contain ASCII structures and are, therefore, readable with B<cat>(1). However, the standard B<netstat>(8) suite provides much cleaner access to these files.
pl: Różne sieciowe pseudopliki, z których wszystkie podają stan pewnej części warstwy sieciowej. Plik ten zawiera struktury ASCII i dlatego nadaje się do odczytu za pomocą B<cat>(1). Jednak standardowy pakiet B<netstat>(8) daje dużo czystszy dostęp do tych plików.

source: This holds an ASCII readable dump of the kernel ARP table used for address resolutions. It will show both dynamically learned and preprogrammed ARP entries. The format is:
pl: Zawiera zrzut tabeli ARP jądra używanej do rozwiązywania adresów, w czytelnej postaci ASCII. Pokazane zostaną zarówno wyuczone dynamicznie, jak i wstępnie zaprogramowane wpisy w tabeli ARP. Format jest następujący:

source: Here "IP address" is the IPv4 address of the machine and the "HW type" is the hardware type of the address from RFC\ 826. The flags are the internal flags of the ARP structure (as defined in I</usr/include/linux/if_arp.h>) and the "HW address" is the data link layer mapping for that IP address if it is known.
pl: Gdzie "IP address" jest adresem IPv4 maszyny, a "HW type" jest rodzajem sprzętu wg RFC\ 826. "Flags" są to wewnętrzne znaczniki struktury ARP (zdefiniowane w I</usr/include/linux/if_arp.h>), a "HW address" jest odwzorowaniem adresu IP w warstwie fizycznej, jeśli jest ono określone.

source: The dev pseudo-file contains network device status information. This gives the number of received and sent packets, the number of errors and collisions and other basic statistics. These are used by the B<ifconfig>(8) program to report device status. The format is:
pl: Pseudoplik dev zawiera informacje o stanie urządzenia sieciowego. Zawierają one liczbę otrzymanych i wysłanych pakietów, liczbę błędów i kolizji oraz inne podstawowe statystyki. Informacje te są wykorzystywane przez program B<ifconfig>(8) do informowania o stanie urządzenia. Format jest następujący:

source: Defined in I</usr/src/linux/net/core/dev_mcast.c>:
pl: Zdefiniowany w I</usr/src/linux/net/core/dev_mcast.c>:

source: Internet Group Management Protocol. Defined in I</usr/src/linux/net/core/igmp.c>.
pl: Internetowy Protokół Zarządzania Grupami. Zdefiniowany w I</usr/src/linux/net/core/igmp.c>.

source: This file uses the same format as the I<arp> file and contains the current reverse mapping database used to provide B<rarp>(8) reverse address lookup services. If RARP is not configured into the kernel, this file will not be present.
pl: Plik ten ma ten sam format, co plik I<arp> i zawiera aktualną bazę odwrotnych odwzorowań, używaną do udostępniania usług odwrotnego poszukiwania adresów B<rarp>(8). Jeśli RARP nie jest skonfigurowane w jądrze, to plik ten nie będzie istniał.

source: Holds a dump of the RAW socket table. Much of the information is not of use apart from debugging. The "sl" value is the kernel hash slot for the socket, the "local_address" is the local address and protocol number pair. \&"St" is the internal status of the socket. The "tx_queue" and "rx_queue" are the outgoing and incoming data queue in terms of kernel memory usage. The "tr", "tm-E<gt>when", and "rexmits" fields are not used by RAW. The "uid" field holds the effective UID of the creator of the socket.
pl: Zawiera zrzut tabeli gniazd surowych (RAW). Większość informacji nie jest przeznaczona do użytku innego niż odpluskwiania. Wartość "sl" jest slotem mieszania jądra dla gniazda, "local_address" jest parą składającą się z lokalnego adresu i numeru protokołu. "st" jest stanem wewnętrznym gniazda. "tx_queue" i "rx_queue" są kolejkami danych przychodzących i wychodzących, w sensie zużycia pamięci jądra. Pola "tr", "tm-E<gt>when" i "rexmits" nie są używane przez gniazda surowe. Pole "uid" zawiera efektywny UID twórcy gniazda.

source: This file holds the ASCII data needed for the IP, ICMP, TCP, and UDP management information bases for an SNMP agent.
pl: Ten plik zawiera dane ASCII potrzebne bazom agenta SNMP zarządzającym informacjami o IP, ICMP, TCP i UDP.

source: Holds a dump of the TCP socket table. Much of the information is not of use apart from debugging. The "sl" value is the kernel hash slot for the socket, the "local_address" is the local address and port number pair. The "rem_address" is the remote address and port number pair (if connected). \&"St" is the internal status of the socket. The "tx_queue" and "rx_queue" are the outgoing and incoming data queue in terms of kernel memory usage. The "tr", "tm-E<gt>when", and "rexmits" fields hold internal information of the kernel socket state and are only useful for debugging. The "uid" field holds the effective UID of the creator of the socket.
pl: Zawiera zrzut tabeli gniazd TCP. Wiele informacji nie przydaje się do użytku poza odpluskwianiem. Wartość "sl" jest slotem mieszania jądra dla gniazda, "local_address" jest parą składającą się z lokalnego adresu i numeru portu. "rem_address" jest parą składającą się ze zdalnego adresu i numeru portu (jeśli gniazdo jest podłączone). \&"St" jest stanem wewnętrznym gniazda. "tx_queue" i "rx_queue" są kolejkami danych przychodzących i wychodzących w sensie zużycia pamięci jądra. Pola "tr", "tm-when" i "rexmits" zawierają wewnętrzne informacje o stanie gniazda w jądrze i są przydatne tylko do odpluskwiania. Pole "uid" zawiera efektywny UID twórcy gniazda.

source: Holds a dump of the UDP socket table. Much of the information is not of use apart from debugging. The "sl" value is the kernel hash slot for the socket, the "local_address" is the local address and port number pair. The "rem_address" is the remote address and port number pair (if connected). "St" is the internal status of the socket. The "tx_queue" and "rx_queue" are the outgoing and incoming data queue in terms of kernel memory usage. The "tr", "tm-E<gt>when", and "rexmits" fields are not used by UDP. The "uid" field holds the effective UID of the creator of the socket. The format is:
pl: Zawiera zrzut tabeli gniazd UDP. Wiele informacji nie przydaje się do użytku poza odpluskwianiem. Wartość "sl" jest slotem mieszania jądra dla gniazda, "local_address" jest parą składającą się z lokalnego adresu i numeru portu. "rem_address" jest parą składającą się ze zdalnego adresu i numeru portu (jeśli gniazdo jest podłączone). "st" jest stanem wewnętrznym gniazda. "tx_queue" i "rx_queue" są kolejkami danych przychodzących i wychodzących w sensie zużycia pamięci jądra. Pola "tr", "tm-when" i "rexmits" nie są używane w gniazdach UDP. Pole "uid" zawiera efektywny UID twórcy gniazda. Format jest następujący:

source: Lists the UNIX domain sockets present within the system and their status. The format is:
pl: Wymienia gniazda domeny UNIX, obecne w systemie oraz ich stan. Format jest następujący:

source: Here "Num" is the kernel table slot number, "RefCount" is the number of users of the socket, "Protocol" is currently always 0, "Flags" represent the internal kernel flags holding the status of the socket. Currently, type is always "1" (UNIX domain datagram sockets are not yet supported in the kernel). \&"St" is the internal state of the socket and Path is the bound path (if any) of the socket.
pl: Gdzie "Num" jest numerem wpisu w tablicy jądra, "RefCount" jest liczbą użytkowników gniazda, "Protocol" obecnie jest zawsze zerem, "Flags" reprezentuje wewnętrzne znaczniki jądra, określające stan gniazda. "Type" jest zawsze równe "1" (Nie ma na razie w jądrze wsparcia dla gniazd datagramowych domeny UNIX). \&"St" jest wewnętrznym stanem gniazda, a ścieżka jest ścieżką (jeśli istnieje) związaną z gniazdem.
