Repository: eurolinux-enterprise-linux-sources/man-pages-pl
Catalog: src/po/man5/proc.5.po
Languages: pl

source: I<1\ ("debug")> All processes dump core when possible. The core dump is owned by the file system user ID of the dumping process and no security is applied. This is intended for system debugging situations only. Ptrace is unchecked.
pl: I<1\ ("debug")>. Jeżeli jest to możliwe, to wszystkie procesy wykonują zrzut pamięci. Właścicielem pliku zrzutu jest użytkownik, którego uprawnienia do systemu plików ma proces wykonujący zrzut. Nie są stosowane żadne mechanizmy bezpieczeństwa. Jest to przeznaczone tylko do celów debugowania. Ptrace nie jest sprawdzane.

source: I<2\ ("suidsafe")> Any binary which normally would not be dumped (see "0" above) is dumped readable by root only. This allows the user to remove the core dump file but not to read it. For security reasons core dumps in this mode will not overwrite one another or other files. This mode is appropriate when administrators are attempting to debug problems in a normal environment.
pl: I<2\ ("suidsafe")>. Zrzut pamięci programu, dla którego w normalnej sytuacji taki zrzut nie zostałby wykonany (patrz wyżej "0"), może być odczytany tylko przez administratora (root). Pozwala to użytkownikowi usunąć plik ze zrzutem, ale nie pozwala na jego odczytanie. Z powodów bezpieczeństwa w tym trybie pliki zrzutu nie nadpisują istniejących plików. Ten tryb jest odpowiedni, gdy administrator będzie chciał debugować problemy w naturalnym środowisku.

source: This file controls the maximum number of superblocks, and thus the maximum number of mounted file systems the kernel can have. You only need to increase I<super-max> if you need to mount more file systems than the current value in I<super-max> allows you to.
pl: Plik steruje maksymalną liczbą superbloków, a więc i maksymalną liczbą systemów plików, które jądro może zamontować. Potrzeba zwiększenia wartości I<super-max> występuje tylko wtedy, gdy chce się zamontować więcej systemów plików, niż na to pozwala aktualna wartość I<super-max>.

source: This file contains the number of file systems currently mounted.
pl: Plik zawiera liczbę obecnie zamontowanych systemów plików.

source: This directory contains files controlling a range of kernel parameters, as described below.
pl: Katalog zawiera pliki kontrolujące wiele parametrów jądra, jak opisano poniżej.

source: This file contains three numbers: I<highwater>, I<lowwater>, and I<frequency>. If BSD-style process accounting is enabled these values control its behavior. If free space on file system where the log lives goes below I<lowwater> percent accounting suspends. If free space gets above I<highwater> percent accounting resumes. I<frequency> determines how often the kernel checks the amount of free space (value is in seconds). Default values are 4, 2 and 30. That is, suspend accounting if 2% or less space is free; resume it if 4% or more space is free; consider information about amount of free space valid for 30 seconds.
pl: Plik zawiera trzy liczby: I<highwater>, I<lowwater> i I<frequency>. Gdy włączone jest rejestrowanie procesów w stylu BSD, wartości te sterują jego zachowaniem. Gdy ilość wolnego miejsca w systemie plików, na którym znajdują się logi, spada poniżej wyrażonej w procentach wartości I<lowwater>, rejestrowanie jest wstrzymywane. Gdy ilość wolnego miejsca stanie się większa niż wyrażona w procentach wartość I<highwater>, rejestrowanie jest wznawiane. I<frequency> określa, jak często jądro będzie sprawdzać ilość wolnego miejsca (wartość w sekundach). Wartościami domyślnymi są 4, 2 i 30. Oznacza to, że rejestrowanie procesów jest wstrzymywane, gdy ilość wolnego miejsca będzie wynosiła 2% lub mniej; wznowione zostanie, gdy wolne będzie 4% lub więcej; zakłada się, że informacja o ilości wolnego miejsca jest ważna przez 30 sekund.

source: I</proc/sys/kernel/cap-bound> (from Linux 2.2 to 2.6.24)
pl: I</proc/sys/kernel/cap-bound> (od Linuksa 2.2 do 2.6.24)

source: This file holds the value of the kernel I<capability bounding set> (expressed as a signed decimal number). This set is ANDed against the capabilities permitted to a process during B<execve>(2). Starting with Linux 2.6.25, the system-wide capability bounding set disappeared, and was replaced by a per-thread bounding set; see B<capabilities>(7).
pl: Plik przechowuje wartość I<capability bounding set> dla jądra (wyrażone jako liczba dziesiętna ze znakiem). Wartość ta jest mnożona (AND) bitowo z capabilities dozwolonymi dla procesu podczas B<execve>(2). Poczynając od Linuksa 2.6.25 ogólnosystemowe capability bounding set zostało usunięte i zastąpione bounding set na wątek, patrz B<capabilities>(7).

source: This file controls the handling of Ctrl-Alt-Del from the keyboard. When the value in this file is 0, Ctrl-Alt-Del is trapped and sent to the B<init>(8) program to handle a graceful restart. When the value is greater than zero, Linux's reaction to a Vulcan Nerve Pinch (tm) will be an immediate reboot, without even syncing its dirty buffers. Note: when a program (like dosemu) has the keyboard in "raw" mode, the ctrl-alt-del is intercepted by the program before it ever reaches the kernel tty layer, and it's up to the program to decide what to do with it.
pl: Ten plik steruje obsługą kombinacji klawiszy Ctrl-Alt-Del. Gdy w pliku tym znajduje się wartość 0, Ctrl-Alt-Del jest przechwytywane i przesyłane do programu B<init>(8) w celu wykonania wdzięcznego restartu. Gdy wartość jest większa od 0, reakcją Linuksa na Wulkanicznie Nerwowe Nękanie (Vulcan Nerve Pinch (tm)) będzie natychmiastowy restart, nawet bez zrzucenia zmodyfikowanych buforów. Uwaga: gdy program (jak np. dosemu) korzysta z "surowego" trybu klawiatury, Ctrl-Alt-Del jest przechwytywane przez program, zanim dotrze do warstwy terminalowej jądra i decyzja, co z tym zrobić, zależy od programu.

source: This file contains the path for the hotplug policy agent. The default value in this file is I</sbin/hotplug>.
pl: Plik ten zawiera ścieżkę do programu hotplug. Domyślną wartością w tym pliku jest I</sbin/hotplug>.

source: I</proc/sys/kernel/domainname> and I</proc/sys/kernel/hostname>
pl: I</proc/sys/kernel/domainname> i I</proc/sys/kernel/hostname>

source: can be used to set the NIS/YP domainname and the hostname of your box in exactly the same way as the commands B<domainname>(1) and B<hostname>(1), that is:
pl: Te pliki mogą służyć do ustawiania nazwy domeny i hosta NIS/YP maszyny dokładnie w ten sam sposób, jak za pomocą poleceń B<domainname>(1) i B<hostname>(1), np.:

source: has the same effect as
pl: daje taki sam efekt, jak

source: Note, however, that the classic darkstar.frop.org has the hostname "darkstar" and DNS (Internet Domain Name Server) domainname "frop.org", not to be confused with the NIS (Network Information Service) or YP (Yellow Pages) domainname. These two domain names are in general different. For a detailed discussion see the B<hostname>(1) man page.
pl: Należy tu zauważyć, że klasyczny darkstar.frop.org posiada nazwę hosta "darkstar" i domenę "frop.org" w DNS (Internetowej Usłudze Nazw Domen - Internet Domain Name Service), których nie należy mylić z domeną NIS (Sieciowej Usługi Informacyjnej - Network Information Service) lub YP (Yellow Pages). Te dwa systemy nazw domenowych zasadniczo się różnią. Szczegółowe informacje można znaleźć na stronie podręcznika B<hostname>(1).

source: (PowerPC only) If this file is set to a nonzero value, the PowerPC htab (see kernel file I<Documentation/powerpc/ppc_htab.txt>) is pruned each time the system hits the idle loop.
pl: (Tylko PowerPC) Jeśli do tego pliku zostanie wpisana wartość niezerowa, htab PowerPC (zobacz: plik I<Documentation/powerpc/ppc_htab.txt> w źródłach jądra) jest czyszczony za każdym razem, gdy system natrafi na pętlę oczekiwania ("idle").

source: (PowerPC only) This file contains a flag that controls the L2 cache of G3 processor boards. If 0, the cache is disabled. Enabled if nonzero.
pl: (Tylko PowerPC) Plik zawiera znacznik sterujący cache'em L2 płyt procesora G3. Jeśli zawiera 0, cache jest wyłączony. Cache jest włączony, gdy plik zawiera wartość różną od zera.

source: This file contains the path for the kernel module loader. The default value is I</sbin/modprobe>. The file is only present if the kernel is built with the B<CONFIG_KMOD> option enabled. It is described by the kernel source file I<Documentation/kmod.txt> (only present in kernel 2.4 and earlier).
pl: Plik zawiera ścieżkę do programu ładującego moduły jądra. Domyślną wartością jest I</sbin/modprobe>. Plik jest obecny tylko, jeśli jądro zostało zbudowane z włączoną opcją B<CONFIG_KMOD>. Jest on opisany w pliku źródeł jądra I<Documentation/kmod.txt> (obecnym tylko w jądrach 2.4 i wcześniejszych).

source: This file defines a system-wide limit specifying the maximum number of bytes in a single message written on a System V message queue.
pl: Zawiera ogólnosystemowe ograniczenie maksymalnej liczby bajtów w pojedynczym komunikacie zapisywanym do kolejki komunikatów Systemu V.

source: This file defines the system-wide limit on the number of message queue identifiers. (This file is only present in Linux 2.4 onward.)
pl: Określa ogólnosystemowe ograniczenie liczby identyfikatorów kolejek komunikatów. (Plik ten występuje począwszy od Linuksa 2.4).

source: This file defines a system-wide parameter used to initialize the I<msg_qbytes> setting for subsequently created message queues. The I<msg_qbytes> setting specifies the maximum number of bytes that may be written to the message queue.
pl: Zawiera ogólnosystemowy parametr służący do inicjacji ustawienia I<msg_qbytes> tworzonych później kolejek komunikatów. Ustawienie I<msg_qbytes> określa maksymalną liczbę bajtów, które mogą zostać zapisane do kolejki komunikatów.

source: I</proc/sys/kernel/ostype> and I</proc/sys/kernel/osrelease>
pl: I</proc/sys/kernel/ostype> i I</proc/sys/kernel/osrelease>

source: These files give substrings of I</proc/version>.
pl: Pliki te zawierają poszczególne części z I</proc/version>.

source: I</proc/sys/kernel/overflowgid> and I</proc/sys/kernel/overflowuid>
pl: I</proc/sys/kernel/overflowgid> i I</proc/sys/kernel/overflowuid>

source: These files duplicate the files I</proc/sys/fs/overflowgid> and I</proc/sys/fs/overflowuid>.
pl: Pliki te są kopiami plików I</proc/sys/fs/overflowgid> i I</proc/sys/fs/overflowuid>.

source: This file gives read/write access to the kernel variable I<panic_timeout>. If this is zero, the kernel will loop on a panic; if nonzero it indicates that the kernel should autoreboot after this number of seconds. When you use the software watchdog device driver, the recommended setting is 60.
pl: Plik umożliwia dostęp (odczyt i zapis) do zmiennej jądra I<panic_timeout>. Jeśli jest to zero, jądro będzie się zapętlać podczas paniki; jeśli wartość niezerowa, to określa liczbę sekund, po której jądro powinno się automatycznie przeładować. Jeśli używany jest software watchdog to zalecaną wartością jest 60.

source: I</proc/sys/kernel/panic_on_oops> (since Linux 2.5.68)
pl: I</proc/sys/kernel/panic_on_oops> (od Linuksa 2.5.68)

source: This file controls the kernel's behavior when an oops or BUG is encountered. If this file contains 0, then the system tries to continue operation. If it contains 1, then the system delays a few seconds (to give klogd time to record the oops output) and then panics. If the I</proc/sys/kernel/panic> file is also nonzero then the machine will be rebooted.
pl: Plik ten kontroluje zachowanie jądra, kiedy wystąpi oops lub BŁĄD. Jeśli ten plik zawiera 0, to system próbuje kontynuować operację. Jeśli zawiera 1, to system czeka parę sekund (aby dać procesowi klogd czas na zapisanie wyjścia z oops), a następnie panikuje. Jeżeli wartość w pliku I</proc/sys/kernel/panic> również jest niezerowa, to nastąpi restart komputera.

source: I</proc/sys/kernel/pid_max> (since Linux 2.5.34)
pl: I</proc/sys/kernel/pid_max> (od Linuksa 2.5.34)

source: This file specifies the value at which PIDs wrap around (i.e., the value in this file is one greater than the maximum PID). The default value for this file, 32768, results in the same range of PIDs as on earlier kernels. On 32-bit platforms, 32768 is the maximum value for I<pid_max>. On 64-bit systems, I<pid_max> can be set to any value up to 2^22 (B<PID_MAX_LIMIT>, approximately 4 million).
pl: Ten plik określa wartość po której nastąpi przewinięcie licznika PID (tj. wartość w tym pliku jest o 1 większa niż maksymalny PID). Domyślna wartość tego pliku, czyli 32768, określa taki sam zakres wartości PID, jak wcześniejsze wersje jądra. Dla platform 32-bitowych 32768 jest maksymalną wartością, jaką może przyjmować I<pid_max>. W systemach 64-bitowych I<pid_max> może zostać ustawiony na dowolną wartość, aż do 2^22 (B<PID_MAX_LIMIT>, około 4 milionów).

source: I</proc/sys/kernel/powersave-nap> (PowerPC only)
pl: I</proc/sys/kernel/powersave-nap> (tylko PowerPC)

source: This file contains a flag. If set, Linux-PPC will use the "nap" mode of powersaving, otherwise the "doze" mode will be used.
pl: Plik zawiera znacznik. Gdy jest on ustawiony, Linux-PPC używa trybu oszczędzania energii "nap", a w przeciwnym przypadku trybu "doze".

source: The four values in this file are I<console_loglevel>, I<default_message_loglevel>, I<minimum_console_level>, and I<default_console_loglevel>. These values influence I<printk()> behavior when printing or logging error messages. See B<syslog>(2) for more info on the different loglevels. Messages with a higher priority than I<console_loglevel> will be printed to the console. Messages without an explicit priority will be printed with priority I<default_message_level>. I<minimum_console_loglevel> is the minimum (highest) value to which I<console_loglevel> can be set. I<default_console_loglevel> is the default value for I<console_loglevel>.
pl: Cztery wartości w pliku I<printk> to: I<console_loglevel>, I<default_message_loglevel>, I<minimum_console_level> i I<default_console_loglevel>. Wartości te wpływają na zachowanie I<printk()> podczas wypisywania lub logowania komunikatów błędów. Informacja o różnych poziomach logowania można znaleźć w B<syslog>(2). Komunikaty o priorytecie wyższym niż I<console_loglevel> będą wypisywane na konsoli. Komunikaty bez jawnego priorytetu będą wypisywane z priorytetem I<default_message_level>. I<minimum_console_loglevel> jest najmniejszą (najwyższą) wartością, którą można ustawić jako I<console_loglevel>. I<default_console_loglevel> jest domyślną wartością dla I<console_loglevel>.

source: I</proc/sys/kernel/pty> (since Linux 2.6.4)
pl: I</proc/sys/kernel/pty> (od wersji Linuksa 2.6.4)

source: This directory contains two files relating to the number of UNIX 98 pseudoterminals (see B<pts>(4)) on the system.
pl: Ten katalog zawiera dwa pliki związane z liczbą pseudoterminali UNIX 98 (patrz B<pts>(4)) w systemie.

source: This file defines the maximum number of pseudoterminals.
pl: Plik określa maksymalną liczbę pseudoterminali.

source: This read-only file indicates how many pseudoterminals are currently in use.
pl: Ten plik tylko do odczytu zawiera informację o liczbie obecnie używanych pseudoterminali.

source: This directory contains various parameters controlling the operation of the file I</dev/random>. See B<random>(4) for further information.
pl: Katalog ten zawiera różne parametry sterujące działaniem pliku I</dev/random>. Dalsze informacje można znaleźć w B<random>(4).

source: This file is documented in the kernel source file I<Documentation/initrd.txt>.
pl: Plik ten jest udokumentowany w pliku I<Documentation/initrd.txt> w źródłach jądra.

source: I</proc/sys/kernel/reboot-cmd> (Sparc only)
pl: I</proc/sys/kernel/reboot-cmd> (tylko Sparc)

source: This file seems to be a way to give an argument to the SPARC ROM/Flash boot loader. Maybe to tell it what to do after rebooting?
pl: Ten plik wydaje się stanowić mechanizm podawania argumentów SPARC-owej ładowarce systemu w ROM/Flash. Może przekazuje jej, co zrobić po restarcie?

source: (Only in kernels up to and including 2.6.7; see B<setrlimit>(2)) This file can be used to tune the maximum number of POSIX real-time (queued) signals that can be outstanding in the system.
pl: (Tylko w wersjach jądra nie późniejszych niż 2.6.7; patrz B<setrlimit>(2)). Plik ten może służyć do sterowania maksymalną liczbą zgodnych z POSIX nieobsłużonych (w kolejkach) sygnałów czasu rzeczywistego w systemie.

source: (Only in kernels up to and including 2.6.7.) This file shows the number POSIX real-time signals currently queued.
pl: (Tylko w wersjach jądra nie późniejszych niż 2.6.7). Plik ten podaje liczbę zgodnych z POSIX sygnałów czasu rzeczywistego oczekujących obecnie w kolejce.

source: I</proc/sys/kernel/sem> (since Linux 2.4)
pl: I</proc/sys/kernel/sem> (od wersji Linuksa 2.4)

source: This file contains 4 numbers defining limits for System V IPC semaphores. These fields are, in order:
pl: Plik ten zawiera 4 liczby definiujące ograniczenia semaforów Systemu V. Są to w kolejności:

source: The maximum semaphores per semaphore set.
pl: Maksymalna liczba semaforów w zestawie semaforów.

source: A system-wide limit on the number of semaphores in all semaphore sets.
pl: Ogólnosystemowe ograniczenie liczby semaforów we wszystkich zestawiach semaforów.

source: The maximum number of operations that may be specified in a B<semop>(2) call.
pl: Maksymalna liczba operacji, które mogą zostać podane w wywołaniu B<semop>(2).

source: A system-wide limit on the maximum number of semaphore identifiers.
pl: Ogólnosystemowe ograniczenie maksymalnej liczby identyfikatorów semaforów.

source: This file shows the size of the generic SCSI device (sg) buffer. You can't tune it just yet, but you could change it at compile time by editing I<include/scsi/sg.h> and changing the value of B<SG_BIG_BUFF>. However, there shouldn't be any reason to change this value.
pl: Plik ten zawiera rozmiar bufora niskopoziomowego urządzenia SCSI (sg). Nie można nim na razie sterować, ale można go zmienić podczas kompilacji poprzez edycję I<include/scsi/sg.h> i zmianę wartości B<SG_BIG_BUFF>. Jednakże nie ma żadnego powodu, aby to robić.

source: This file contains the system-wide limit on the total number of pages of System V shared memory.
pl: Ten plik zawiera ogólnosystemowe ograniczenie całkowitej liczby stron pamięci wspólnej Systemu V.

source: This file can be used to query and set the run-time limit on the maximum (System V IPC) shared memory segment size that can be created. Shared memory segments up to 1GB are now supported in the kernel. This value defaults to B<SHMMAX>.
pl: Ten plik może służyć do odpytywania o aktualne ograniczenie maksymalnego rozmiaru tworzonego segmentu pamięci wspólnej (System V IPC) oraz do zmiany tego ograniczenia. Jądro wspiera obecnie segmenty pamięci wspólnej do 1 GB. Wartością domyślną jest B<SHMMAX>.

source: (available in Linux 2.4 and onward) This file specifies the system-wide maximum number of System V shared memory segments that can be created.
pl: (dostępny począwszy od Linuksa 2.4) Ten plik określa ogólnosystemową maksymalną liczbę segmentów pamięci wspólnej Systemu V, które można utworzyć.

source: This file controls the functions allowed to be invoked by the SysRq key. By default, the file contains 1 meaning that every possible SysRq request is allowed (in older kernel versions, SysRq was disabled by default, and you were required to specifically enable it at run-time, but this is not the case any more). Possible values in this file are:
pl: Plik kontroluje dozwolone funkcje, które są wywoływane przy użyciu klawisza SysRq. Domyślnie, plik zawiera 1, oznaczające że dozwolona jest każde możliwe żądanie SysRq (w starszych wersjach jądra, SysRq było domyślnie wyłączone i konieczne było włączenie go w czasie uruchomienia, jednak ta sytuacja już nie występuje). Dozwolone wartości w pliku:

source: 0 - disable sysrq completely 1 - enable all functions of sysrq E<gt>1 - bitmask of allowed sysrq functions, as follows: 2 - enable control of console logging level 4 - enable control of keyboard (SAK, unraw) 8 - enable debugging dumps of processes etc. 16 - enable sync command 32 - enable remount read-only 64 - enable signalling of processes (term, kill, oom-kill) 128 - allow reboot/poweroff 256 - allow nicing of all real-time tasks
pl: 0 - całkowicie wyłącza sysrq 1 - włącza wszystkie funkcje sysrq E<gt>1 - maska bitowa dozwolonych funkcji sysrq, jak poniżej: 2 - włącza kontrolę poziomu logów konsoli 4 - włącza kontrolę klawiatury (SAK, unraw) 8 - włącza zrzuty procesów w celu debugowania itd. 16 - włącza polecenie sync 32 - włącza ponowne montowanie tylko do odczytu 64 - włącza sygnały procesów (term, kill, oom-kill) 128 - pozwala na restartowanie/wyłączanie 256 - pozwala ustawiać nice wszystkich zadań czasu rzeczywistego

source: This file is only present if the B<CONFIG_MAGIC_SYSRQ> kernel configuration option is enabled. For further details see the kernel source file I<Documentation/sysrq.txt>.
pl: Ten plik istnieje tylko jeśli podczas kompilacji jądra włączono opcję B<CONFIG_MAGIC_SYSRQ>. Aby dowiedzieć się więcej, proszę zapoznać się z plikiem I<Documentation/sysrq.txt> w źródłach jądra.

source: This file contains a string like:
pl: Plik zawiera tekst jak np.:

source: The "#5" means that this is the fifth kernel built from this source base and the date behind it indicates the time the kernel was built.
pl: Gdzie'#5' oznacza, że jest to piąte z kolei jądro zbudowane z tych samych źródeł, a następująca dalej data określa, kiedy jądro zostało zbudowane.

source: I</proc/sys/kernel/threads-max> (since Linux 2.3.11)
pl: I</proc/sys/kernel/threads-max> (od Linuksa 2.3.11)

source: This file specifies the system-wide limit on the number of threads (tasks) that can be created on the system.
pl: Ten plik określa ogólnosystemowe ograniczenie całkowitej liczby wątków (zadań), jakie mogą zostać utworzone w systemie.

source: I</proc/sys/kernel/zero-paged> (PowerPC only)
pl: I</proc/sys/kernel/zero-paged> (tylko PowerPC)

source: This file contains a flag. When enabled (nonzero), Linux-PPC will pre-zero pages in the idle loop, possibly speeding up get_free_pages.
pl: Plik zawiera znacznik. Gdy jest on ustawiony (niezerowy), Linux-PPC wstępnie zeruje strony w pętli bezczynności. Prawdopodobnie przyspiesza to get_free_pages.

source: This directory contains networking stuff. Explanations for some of the files under this directory can be found in B<tcp>(7) and B<ip>(7).
pl: Ten katalog zawiera rzeczy związane z siecią. Wyjaśnienia dotyczące niektórych plików zawartych w tym katalogu można znaleźć w B<tcp>(7) i B<ip>(7).

source: This file defines a ceiling value for the I<backlog> argument of B<listen>(2); see the B<listen>(2) manual page for details.
pl: Plik definiuje wartość cechy górnej (sufitu) do argumentu I<backlog> funkcji B<listen>; patrz strona podręcznika B<listen>(2), aby dowiedzieć się więcej.

source: This directory supports Sun remote procedure call for network file system (NFS). On some systems, it is not present.
pl: Ten katalog obsługuje Sunowskie zdalne wywoływanie procedur dla sieciowego systemu plikowego (NFS). W niektórych systemach może nie istnieć.

source: This directory contains files for memory management tuning, buffer and cache management.
pl: Ten katalog zawiera pliki sterujące zarządzaniem pamięcią, buforami i zarządzaniem cachem.

source: I</proc/sys/vm/drop_caches> (since Linux 2.6.16)
pl: I</proc/sys/vm/drop_caches> (od wersji Linuksa 2.6.16)

source: Writing to this file causes the kernel to drop clean caches, dentries and inodes from memory, causing that memory to become free.
pl: Zapis do tego pliku powoduje zwolnienie przez jądro czystych buforów, dentries i i-węzłów z pamięci, zwalniając tę pamięć.
