Repository: eurolinux-enterprise-linux-sources/man-pages-pl
Catalog: src/po/man5/proc.5.po
Languages: pl

source: This file displays the current score that the kernel gives to this process for the purpose of selecting a process for the OOM-killer. A higher score means that the process is more likely to be selected by the OOM-killer. The basis for this score is the amount of memory used by the process, with increases (+) or decreases (-) for factors including:
pl: Plik wyświetla bieżący wynik, jaki jądro przydziela temu procesowi w celu wybrania procesu do zabicia przez OOM-killer. Wyższy wynik oznacza, że proces ma większe prawdopodobieństwo zostania wybranym przez OOM-killer. Podstawą wyniku jest liczba pamięci użytej przez proces, a jest on zwiększany (+) lub zmniejszany (-) przez następujące czynniki:

source: whether the process creates a lot of children using B<fork>(2) (+);
pl: czy proces tworzy wiele potomków przy użyciu B<fork>(2) (+),

source: whether the process has been running a long time, or has used a lot of CPU time (-);
pl: czy proces jest używany przez długi czas lub używa dużo czasu procesora (-),

source: whether the process has a low nice value (i.e., E<gt> 0) (+);
pl: czy proces ma niską wartość nice (np. E<gt> 0) (+),

source: whether the process is privileged (-); and
pl: czy proces jest uprzywilejowany (-) oraz

source: whether the process is making direct hardware access (-).
pl: czy proces wykonuje bezpośredni dostęp do sprzętu (-).

source: The I<oom_score> also reflects the bit-shift adjustment specified by the I<oom_adj> setting for the process.
pl: Wartość I<oom_score> uwzględnia również przesunięcie bitowe określone przez ustawienie procesu I<oom_adj>.

source: UNIX and Linux support the idea of a per-process root of the file system, set by the B<chroot>(2) system call. This file is a symbolic link that points to the process's root directory, and behaves as exe, fd/*, etc. do.
pl: UNIX i Linux wspierają pomysł określonego dla każdego procesu osobno katalogu głównego systemu plików, ustawianego przez wywołanie systemowe B<chroot>(2). Plik ten wskazuje na katalog główny systemu plików i zachowuje się jak exe, fd/*, itp.

source: I</proc/[pid]/smaps> (since Linux 2.6.14)
pl: I</proc/[pid]/smaps> (od Linuksa 2.6.14)

source: This file shows memory consumption for each of the process's mappings. For each of mappings there is a series of lines such as the following:
pl: Plik ten pokazuje zużycie pamięci dla każdego mapowania procesu. Dla każdego takiego mapowania pokazana jest lista następujących linii:

source: The first of these lines shows the same information as is displayed for the mapping in I</proc/[pid]/maps>. The remaining lines show the size of the mapping, the amount of the mapping that is currently resident in RAM, the number of clean and dirty shared pages in the mapping, and the number of clean and dirty private pages in the mapping.
pl: Pierwsza z tych linii pokazuje te same informacje o mapowaniach, co w I</proc/[pid]/maps>. Pozostałe linie zawierają rozmiar mapowania, ilość mapowań obecnych w RAM, liczbę czystych i brudnych stron współdzielonych w mapowaniu oraz liczbę czystych i brudnych prywatnych stron w mapowaniu.

source: This file is only present if the B<CONFIG_MMU> kernel configuration option is enabled.
pl: Ten plik istnieje tylko jeśli podczas kompilacji jądra włączono opcję B<CONFIG_MMU>.

source: Status information about the process. This is used by B<ps>(1). It is defined in I</usr/src/linux/fs/proc/array.c>.
pl: Informacje o stanie procesu. Korzysta z tego B<ps>(1). Są one zdefiniowane w I</usr/src/linux/fs/proc/array.c>.

source: The fields, in order, with their proper B<scanf>(3) format specifiers, are:
pl: Kolejne pola i ich właściwe specyfikatory formatu B<scanf>(3) to:

source: The process ID.
pl: Identyfikator procesu (PID).

source: The filename of the executable, in parentheses. This is visible whether or not the executable is swapped out.
pl: Nazwa pliku wykonywalnego w nawiasach. Widać, czy plik uległ wymianie.

source: One character from the string "RSDZTW" where R is running, S is sleeping in an interruptible wait, D is waiting in uninterruptible disk sleep, Z is zombie, T is traced or stopped (on a signal), and W is paging.
pl: Jeden znak spośród "RSDZTW", gdzie R (running) oznacza proces działający, S - (sleeping) proces uśpiony w oczekiwaniu przerywalnym, D - (disk) proces uśpiony w oczekiwaniu nieprzerywalnym, Z - (zombie) proces duch, T - (traced) śledzony lub zatrzymany (przez sygnał), a W - którego strony zastąpiono.

source: The PID of the parent.
pl: PID procesu macierzystego.

source: The process group ID of the process.
pl: Identyfikator grupy procesów danego procesu.

source: The session ID of the process.
pl: Identyfikator sesji procesu.

source: The controlling terminal of the process. (The minor device number is contained in the combination of bits 31 to 20 and 7 to 0; the major device number is in bits 15 to 8.)
pl: Kontroluje terminal procesu (poboczny numer urządzenia jest przechowywany w kombinacji bitów 31 do 20 i 7 do 0, natomiast główny numer urządzenia jest w bitach 15 do 8).

source: The ID of the foreground process group of the controlling terminal of the process.
pl: Identyfikator grupy procesów pierwszoplanowych kontrolującego terminala procesu.

source: I<flags> %u (%lu before Linux 2.6.22)
pl: I<flags> %u (%lu przed wersją 2.6.22 Linuksa)

source: The kernel flags word of the process. For bit meanings, see the PF_* defines in I<E<lt>linux/sched.hE<gt>>. Details depend on the kernel version.
pl: Słowo flag jądra dla danego procesu. Znaczenie poszczególnych bitów określają definicje PF_* w pliku I<E<lt>linux/sched.hE<gt>>. Szczegóły zależą od wersji jądra.

source: The number of minor faults the process has made which have not required loading a memory page from disk.
pl: Liczba drobnych błędów, które popełnił proces, a które nie wymagały załadowania strony pamięci z dysku.

source: The number of minor faults that the process's waited-for children have made.
pl: Liczba drobnych błędów procesów potomnych.

source: The number of major faults the process has made which have required loading a memory page from disk.
pl: Liczba głównych błędów, które popełnił proces, a które wymagały załadowania strony pamięci z dysku.

source: The number of major faults that the process's waited-for children have made.
pl: Liczba głównych błędów procesów potomnych.

source: Amount of time that this process has been scheduled in user mode, measured in clock ticks (divide by I<sysconf(_SC_CLK_TCK)>. This includes guest time, I<guest_time> (time spent running a virtual CPU, see below), so that applications that are not aware of the guest time field do not lose that time from their calculations.
pl: Czas jaki został przydzielony procesowi w trybie użytkownika, mierzony w taktach zegara (podzielonych przez I<sysconf(_SC_CLK_TCK)>). Obejmuje to czas gościa, I<guest_time> (czas spędzony w czasie działania wirtualnego CPU, patrz niżej), tak więc aplikacje, które nie wiedzą o polu czasu gościa nie tracą tego czasu ze swych obliczeń.

source: Amount of time that this process has been scheduled in kernel mode, measured in clock ticks (divide by I<sysconf(_SC_CLK_TCK)>.
pl: Czas, jaki został przydzielony procesowi w trybie jądra, mierzony w taktach zegara (podzielonych przez I<sysconf(_SC_CLK_TCK)>.

source: Amount of time that this process's waited-for children have been scheduled in user mode, measured in clock ticks (divide by I<sysconf(_SC_CLK_TCK)>. (See also B<times>(2).) This includes guest time, I<cguest_time> (time spent running a virtual CPU, see below).
pl: Czas, jaki został przydzielony procesom potomnym tego procesu w stanie waited-for w trybie użytkownika, mierzony w taktach zegara (podzielonych przez I<sysconf(_SC_CLK_TCK)>, patrz także B<times>(2)). Obejmuje to czas gościa, I<cguest_time> (czas spędzony działając na procesorze wirtualnym, patrz niżej).

source: Amount of time that this process's waited-for children have been scheduled in kernel mode, measured in clock ticks (divide by I<sysconf(_SC_CLK_TCK)>.
pl: Czas, jaki został przydzielony procesom potomnym tego procesu w stanie waited-for w trybie jądra, mierzony w taktach zegara (podzielonych przez I<sysconf(_SC_CLK_TCK)>.

source: (Explanation for Linux 2.6) For processes running a real-time scheduling policy (I<policy> below; see B<sched_setscheduler>(2)), this is the negated scheduling priority, minus one; that is, a number in the range -2 to -100, corresponding to real-time priorities 1 to 99. For processes running under a non-real-time scheduling policy, this is the raw nice value (B<setpriority>(2)) as represented in the kernel. The kernel stores nice values as numbers in the range 0 (high) to 39 (low), corresponding to the user-visible nice range of -20 to 19.
pl: (Wyjaśnienie dla Linuksa 2.6) W przypadku procesów działających z zasadami planisty czasu rzeczywistego (I<policy> poniżej; patrz B<sched_setscheduler>(2)), jest to liczba przeciwna w stosunku do priorytetu planisty minus jeden, tzn. jest to zakres -2 do -100 odpowiadający priorytetom czasu rzeczywistego od 1 do 99. W przypadku procesów nie działających według tych zasad, jest to surowa wartość nice (B<setpriority>(2) zgodna z podaną przez jądro. Jądro przechowuje wartości nice jako liczby w zakresie od 0 (wysoki) do 39 (niski), co odpowiada widocznemu dla użytkownika zakresowi nice od -20 do 19.

source: Before Linux 2.6, this was a scaled value based on the scheduler weighting given to this process.
pl: Przed Linuksem 2.6 była to wartość skalowana w oparciu o wagę jaką planista przypisał do danego procesu.

source: The nice value (see B<setpriority>(2)), a value in the range 19 (low priority) to -20 (high priority).
pl: Wartość "nice" (patrz B<setpriority>(2)) zawierająca się w zakresie od 19 (niski priorytet) do -20 (wysoki priorytet).

source: Number of threads in this process (since Linux 2.6). Before kernel 2.6, this field was hard coded to 0 as a placeholder for an earlier removed field.
pl: Liczba wątków procesu (od Linuksa 2.6). Przed jądrem 2.6 to pole miało przydzieloną na sztywno wartość 0, jako wypełniacz do usuniętego wcześniej pola.

source: The time in jiffies before the next B<SIGALRM> is sent to the process due to an interval timer. Since kernel 2.6.17, this field is no longer maintained, and is hard coded as 0.
pl: Czas w jiffies poprzedzający wysłanie przez czasomierz do procesu następnego sygnału B<SIGALRM>. Od jądra 2.6.17, to pole nie jest dłużej utrzymywane i ma ustawioną na sztywno wartość 0.

source: I<starttime> %llu (was %lu before Linux 2.6)
pl: I<starttime> %llu (było %lu przed Linuksem 2.6)

source: The time in jiffies the process started after system boot.
pl: Czas uruchomienia procesu wyrażony w jiffies od uruchomienia systemu.

source: Virtual memory size in bytes.
pl: Rozmiar pamięci wirtualnej w bajtach.

source: Resident Set Size: number of pages the process has in real memory. This is just the pages which count toward text, data, or stack space. This does not include pages which have not been demand-loaded in, or which are swapped out.
pl: Resident Set Size: liczba stron, które proces ma w rzeczywistej pamięci. Są to po prostu strony, które obejmują segment text, segment data i przestrzeń stosu. Nie obejmuje to stron, które nie były ładowane na żądanie lub które uległy wymianie.

source: Current soft limit in bytes on the rss of the process; see the description of B<RLIMIT_RSS> in B<getpriority>(2).
pl: Aktualne miękkie ograniczenie rss procesu w bajtach; patrz opis B<RLIMIT_RSS> w B<getpriority>(2).

source: The address above which program text can run.
pl: Adres, pod którym zaczyna się kod programu.

source: The address below which program text can run.
pl: Adres, pod którym kończy się kod programu.

source: The address of the start (i.e., bottom) of the stack.
pl: Adres początku (np. spód) stosu.

source: The current value of ESP (stack pointer), as found in the kernel stack page for the process.
pl: Bieżąca wartość ESP (wskaźnika stosu), określona na podstawie strony stosu jądra dla danego procesu.

source: The current EIP (instruction pointer).
pl: Aktualny EIP (wskaźnik instrukcji).

source: The bitmap of pending signals, displayed as a decimal number. Obsolete, because it does not provide information on real-time signals; use I</proc/[pid]/status> instead.
pl: Maska bitowa oczekujących sygnałów, wyświetlana jako liczba dziesiętna. Przestarzałe, ponieważ nie dostarcza informacji o sygnałach czasu rzeczywistego; prosimy używać I</proc/[pid]/status> zamiast tego pliku.

source: The bitmap of blocked signals, displayed as a decimal number. Obsolete, because it does not provide information on real-time signals; use I</proc/[pid]/status> instead.
pl: Maska bitowa zablokowanych sygnałów, wyświetlana jako liczba dziesiętna. Przestarzałe, ponieważ nie dostarcza informacji o sygnałach czasu rzeczywistego; prosimy używać I</proc/[pid]/status> zamiast tego pliku.

source: The bitmap of ignored signals, displayed as a decimal number. Obsolete, because it does not provide information on real-time signals; use I</proc/[pid]/status> instead.
pl: Maska bitowa ignorowanych sygnałów, wyświetlana jako liczba dziesiętna. Przestarzałe, ponieważ nie dostarcza informacji o sygnałach czasu rzeczywistego; prosimy używać I</proc/[pid]/status> zamiast tego pliku.

source: The bitmap of caught signals, displayed as a decimal number. Obsolete, because it does not provide information on real-time signals; use I</proc/[pid]/status> instead.
pl: Maska bitowa schwytanych sygnałów, wyświetlana jako liczba dziesiętna. Przestarzałe, ponieważ nie dostarcza informacji o sygnałach czasu rzeczywistego; prosimy używać I</proc/[pid]/status> zamiast tego pliku.

source: This is the "channel" in which the process is waiting. It is the address of a system call, and can be looked up in a namelist if you need a textual name. (If you have an up-to-date I</etc/psdatabase>, then try I<ps -l> to see the WCHAN field in action.)
pl: Jest to "kanał", na którym oczekuje proces. Jest to adres funkcji systemowej i można go znaleźć na liście nazw, jeśli potrzebna jest nazwa tekstowa. (Gdy I</etc/psdatabase> jest aktualne, można zobaczyć działanie pola WCHAN, próbując I<ps -l>.)

source: Number of pages swapped (not maintained).
pl: Liczba stron, które uległy wymianie (nieutrzymywane).

source: Cumulative I<nswap> for child processes (not maintained).
pl: Łączna wartość I<nswap> dla procesów potomnych (nieutrzymywane).

source: I<exit_signal> %d (since Linux 2.1.22)
pl: I<exit_signal> %d (od Linuksa 2.1.22)

source: Signal to be sent to parent when we die.
pl: Sygnał wysyłany przez ginący proces do jego procesu macierzystego.

source: I<processor> %d (since Linux 2.2.8)
pl: I<processor> %d (od Linuksa 2.2.8)

source: CPU number last executed on.
pl: Numer CPU, na którym proces ostatnio działał.

source: I<rt_priority> %u (since Linux 2.5.19; was %lu before Linux 2.6.22)
pl: I<rt_priority> %u (od Linuksa 2.5.19; było %lu przed Linuksem 2.6.22)

source: Real-time scheduling priority, a number in the range 1 to 99 for processes scheduled under a real-time policy, or 0, for non-real-time processes (see B<sched_setscheduler>(2)).
pl: Priorytet planisty czasu rzeczywistego, liczba w zakresie od 1 do 99 do procesów przydzielanych według zasad czasu rzeczywistego lub 0 do procesów nie czasu rzeczywistego (patrz B<sched_setscheduler>(2)).

source: I<policy> %u (since Linux 2.5.19; was %lu before Linux 2.6.22)
pl: I<policy> %u (od Linuksa 2.5.19; było %lu przed Linuksem 2.6.22)

source: Scheduling policy (see B<sched_setscheduler>(2)). Decode using the SCHED_* constants in I<linux/sched.h>.
pl: Polityka przydzielania zadaniom czasu procesora (patrz B<sched_setscheduler>(2)). Dekodowana używając stałych SCHED_* w I<linux/sched.h>.

source: I<delayacct_blkio_ticks> %llu (since Linux 2.6.18)
pl: I<delayacct_blkio_ticks> %llu (od Linuksa 2.6.18)

source: Aggregated block I/O delays, measured in clock ticks (centiseconds).
pl: Sumaryczna zwłoka bloków wejścia/wyjścia, mierzona w taktach zegara (centysekundy).

source: I<guest_time> %lu (since Linux 2.6.24)
pl: I<guest_time> %lu (od Linuksa 2.6.24)

source: Guest time of the process (time spent running a virtual CPU for a guest operating system), measured in clock ticks (divide by I<sysconf(_SC_CLK_TCK)>.
pl: Czas gościa procesu (czas, jaki upłynął podczas działania na wirtualnym procesorze systemu operacyjnego gościa), mierzony w taktach zegara (podzielony przez I<sysconf(_SC_CLK_TCK)>

source: I<cguest_time> %ld (since Linux 2.6.24)
pl: I<cguest_time> %ld (od Linuksa 2.6.24)

source: Guest time of the process's children, measured in clock ticks (divide by I<sysconf(_SC_CLK_TCK)>.
pl: Czas gościa potomków procesu, mierzony w taktach zegara (podzielony przez I<sysconf(_SC_CLK_TCK)>.

source: Provides information about memory usage, measured in pages. The columns are:
pl: Udostępnia informacje o użyciu pamięci, mierzone w stronach. Występują następujące kolumny:

source: size total program size (same as VmSize in I</proc/[pid]/status>) resident resident set size (same as VmRSS in I</proc/[pid]/status>) share shared pages (from shared mappings) text text (code) lib library (unused in Linux 2.6) data data + stack dt dirty pages (unused in Linux 2.6)
pl: size łączny rozmiar programu (taki sam jak VmSize w I</proc/[pid]/status>) resident rozmiar części rezydentnej (taki sam jak VmRSS w I</proc/[pid]/status>) share strony wspólne (z wspólnych mapowań) text tekst (kod) lib biblioteki (nieużywane w Linuksie 2.6) data dane i stos dt strony nieaktualne (dirty; nieużywane w Linuksie 2.6)

source: Provides much of the information in I</proc/[pid]/stat> and I</proc/[pid]/statm> in a format that's easier for humans to parse. Here's an example:
pl: Udostępnia sporo informacji ze I</proc/[pid]/stat> i I</proc/[pid]/statm> w postaci łatwiejszej do przeanalizowania przez człowieka. Oto przykład:

source: The fields are as follows:
pl: Występują następujące pola:

source: I<Name>: Command run by this process.
pl: I<Name>: Polecenie uruchomione przez ten proces.

source: I<State>: Current state of the process. One of "R (running)", "S (sleeping)", "D (disk sleep)", "T (stopped)", "T (tracing stop)", "Z (zombie)", or "X (dead)".
pl: I<State>: Bieżący stan procesu. Jeden z: "R (running)", "S (sleeping)", "D (disk sleep)", "T (stopped)", "T (tracing stop)", "Z (zombie)", or "X (dead)".

source: I<Tgid>: Thread group ID (i.e., Process ID).
pl: I<Tgid>: identyfikator grupy wątku (np. identyfikator procesu).

source: I<Pid>: Thread ID (see B<gettid>(2)).
pl: I<Pid>: identyfikator wątku (patrz B<gettid>(2)).

source: I<PPid>: PID of parent process.
pl: I<PPid>: PID procesu macierzystego.

source: I<TracerPid>: PID of process tracing this process (0 if not being traced).
pl: I<TracerPid>: PID procesu śledzącego ten proces (0 gdy nie jest śledzony).

source: I<Uid>, I<Gid>: Real, effective, saved set, and file system UIDs (GIDs).
pl: I<Uid>, I<Gid>: UID (GID): realny, efektywny, zapisany oraz systemu plików.

source: I<FDSize>: Number of file descriptor slots currently allocated.
pl: I<FDSize>: Liczba slotów aktualnie przydzielonych deskryptorów plików.

source: I<Groups>: Supplementary group list.
pl: I<Groups>: Uzupełniająca lista grup.

source: I<VmPeak>: Peak virtual memory size.
pl: I<VmPeak>: Szczytowy rozmiar pamięci wirtualnej.

source: I<VmSize>: Virtual memory size.
pl: I<VmSize>: Rozmiar pamięci wirtualnej.

source: I<VmLck>: Locked memory size (see B<mlock>(3)).
pl: I<VmLck>: Rozmiar pamięci zablokowanej (patrz B<mlock>(3)).

source: I<VmHWM>: Peak resident set size ("high water mark").
pl: I<VmHWM>: Szczytowy ustawiony rozmiar rezydentny ("high water mark").

source: I<VmRSS>: Resident set size.
pl: I<VmRSS>: Ustawiony rozmiar rezydentny.

source: I<VmData>, I<VmStk>, I<VmExe>: Size of data, stack, and text segments.
pl: I<VmData>, I<VmStk>, I<VmExe>: Rozmiar segmentów danych, stosu i tekstu.

source: I<VmLib>: Shared library code size.
pl: I<VmLib>: Rozmiar kodu biblioteki współdzielonej.

source: I<VmPTE>: Page table entries size (since Linux 2.6.10).
pl: I<VmPTE>: Rozmiar wpisów tablicy strony (od Linuksa 2.6.10).

source: I<Threads>: Number of threads in process containing this thread.
pl: I<Threads>: Liczba wątków w procesie zawierających ten wątek.

source: I<SigQ>: This field contains two slash-separated numbers that relate to queued signals for the real user ID of this process. The first of these is the number of currently queued signals for this real user ID, and the second is the resource limit on the number of queued signals for this process (see the description of B<RLIMIT_SIGPENDING> in B<getrlimit>(2)).
pl: I<SigQ>: Pole zawiera dwie liczby oddzielone ukośnikiem, które odnoszą się do skolejkowanych sygnałów do realnego identyfikatora użytkownika tego procesu. Pierwsza jest liczbą aktualnie skolejkowanych sygnałów do tego realnego identyfikatora użytkownika, a druga jest limitem zasobów liczby skolejkowanych sygnałów do tego procesu (patrz opis B<RLIMIT_SIGPENDING> w B<getrlimit>(2)).

source: I<SigPnd>, I<ShdPnd>: Number of signals pending for thread and for process as a whole (see B<pthreads>(7) and B<signal>(7)).
pl: I<SigPnd>, I<ShdPnd>: Liczba sygnałów oczekujących na wątek i na proces jako całość (patrz B<pthreads>(7) i B<signal>(7)).

source: I<SigBlk>, I<SigIgn>, I<SigCgt>: Masks indicating signals being blocked, ignored, and caught (see B<signal>(7)).
pl: I<SigBlk>, I<SigIgn>, I<SigCgt>: Maski oznaczające zablokowane, zignorowane i przechwycone sygnały (patrz B<signal>(7)).

source: I<CapInh>, I<CapPrm>, I<CapEff>: Masks of capabilities enabled in inheritable, permitted, and effective sets (see B<capabilities>(7)).
pl: I<CapInh>, I<CapPrm>, I<CapEff>: Maski możliwości, włączonych w zestawach dziedziczonych (inheritable), dozwolonych (permitted) i efektywnych (effective) (patrz B<capabilities>(7)).

source: I<CapBnd>: Capability Bounding set (since kernel 2.6.26, see B<capabilities>(7)).
pl: I<CapBnd>: Zestaw możliwości ograniczających (capability bounding set) (od jądra 2.6.26, patrz B<capabilities>(7)).

source: I<Cpus_allowed>: Mask of CPUs on which this process may run (since Linux 2.6.24, see B<cpuset>(7)).
pl: I<Cpus_allowed>: Maska procesorów, na których proces może być uruchomiony (od Linuksa 2.6.24, patrz B<cpuset>(7)).

source: I<Cpus_allowed_list>: Same as previous, but in "list format" (since Linux 2.6.26, see B<cpuset>(7)).
pl: I<Cpus_allowed_list>: Jak wyżej, ale w "formacie listy" (od Linuksa 2.6.26, patrz B<cpuset>(7)).

source: I<Mems_allowed>: Mask of memory nodes allowed to this process (since Linux 2.6.24, see B<cpuset>(7)).
pl: I<Mems_allowed>: Maska węzłów pamięci, dozwolonych dla tego procesu (od Linuksa 2.6.24, patrz B<cpuset>(7)).

source: I<Mems_allowed_list>: Same as previous, but in "list format" (since Linux 2.6.26, see B<cpuset>(7)).
pl: I<Mems_allowed_list>: Jak wyżej, ale w "formacie listy" (od Linuksa 2.6.26, patrz B<cpuset>(7)).

source: I<voluntary_context_switches>, I<nonvoluntary_context_switches>: Number of voluntary and involuntary context switches (since Linux 2.6.23).
pl: I<voluntary_context_switches>, I<nonvoluntary_context_switches>: Liczba dobrowolnych i przymusowych przełączeń kontekstu (od Linuksa 2.6.23).

source: I</proc/[pid]/task> (since Linux 2.6.0-test6)
pl: I</proc/[pid]/task> (od Linuksa 2.6.0-test6)
