Repository: eurolinux-enterprise-linux-sources/man-pages-pl
Catalog: src/po/man5/proc.5.po
Languages: pl

source: Linux Programmer's Manual
pl: Podręcznik programisty Linuksa

source: NAME
pl: NAZWA

source: proc - process information pseudo-file system
pl: proc - pseudosystem plików z informacjami o procesach

source: DESCRIPTION
pl: OPIS

source: The I<proc> file system is a pseudo-file system which is used as an interface to kernel data structures. It is commonly mounted at I</proc>. Most of it is read-only, but some files allow kernel variables to be changed.
pl: I<proc> jest pseudosystemem plików, który służy jako lepszy interfejs do struktur jądra. Zazwyczaj jest montowany w katalogu I</proc>. Jest on w większości przeznaczony tylko do odczytu, lecz niektóre pliki umożliwiają modyfikacje zmiennych jądra.

source: The following outline gives a quick tour through the I</proc> hierarchy.
pl: Następujący szkic ukazuje w szybki sposób hierarchię I</proc>.

source: There is a numerical subdirectory for each running process; the subdirectory is named by the process ID. Each such subdirectory contains the following pseudo-files and directories.
pl: Każdemu działającemu procesowi odpowiada katalog o numerycznej nazwie; nazwą tą jest identyfikator procesu. Każdy z tych katalogów zawiera następujące pseudopliki i podkatalogi:

source: I</proc/[pid]/auxv> (since 2.6.0-test7)
pl: I</proc/[pid]/auxv> (od wersji jądra 2.6.0-test7)

source: This contains the contents of the ELF interpreter information passed to the process at exec time. The format is one I<unsigned long> ID plus one I<unsigned long> value for each entry. The last entry contains two zeros.
pl: Zawartość informacji ELF przekazanej do procesu podczas uruchomienia. Formatem jest jeden identyfikator w postaci I<unsigned long> plus jedna wartość I<unsigned long> dla każdego wpisu. Ostatni wpis zawiera dwa zera.

source: This holds the complete command line for the process, unless the process is a zombie. In the latter case, there is nothing in this file: that is, a read on this file will return 0 characters. The command-line arguments appear in this file as a set of strings separated by null bytes (\(aq\e0\(aq), with a further null byte after the last string.
pl: Zawiera pełną linię polecenia wydanego przy uruchamianiu procesu, chyba że jest to proces-duch (zombie). Wówczas plik będzie pusty, tzn. odczyt tego pliku zwróci zawsze 0 znaków. Argumenty linii poleceń występują w tym pliku rozdzielone znakami NUL (\(aq\e0\(aq), z dodatkowym znakiem NUL po ostatnim łańcuchu.

source: I</proc/[pid]/coredump_filter> (since kernel 2.6.23)
pl: I</proc/[pid]/coredump_filter> (od wersji jądra 2.6.23)

source: See B<core>(5).
pl: Patrz B<core>(5).

source: I</proc/[pid]/cpuset> (since kernel 2.6.12)
pl: I</proc/[pid]/cpuset> (od wersji jądra 2.6.12)

source: See B<cpuset>(7).
pl: Patrz B<cpuset>(7).

source: This is a symbolic link to the current working directory of the process. To find out the current working directory of process 20, for instance, you can do this:
pl: Jest dowiązaniem do bieżącego katalogu roboczego procesu. Aby dowiedzieć się, jaki jest katalog roboczy procesu, na przykład o identyfikatorze 20, można wydać następujące polecenie:

source: Note that the I<pwd> command is often a shell built-in, and might not work properly. In B<bash>(1), you may use I<pwd\ -P>.
pl: Należy zauważyć, że polecenie I<pwd> jest często wbudowanym poleceniem powłoki i może nie działać w tym kontekście w sposób właściwy. W powłoce B<bash>(1) można użyć I<pwd\ -P>.

source: In a multithreaded process, the contents of this symbolic link are not available if the main thread has already terminated (typically by calling B<pthread_exit>(3)).
pl: W procesie wielowątkowym zawartość tego linku symbolicznego nie jest dostępna, jeżeli wątek główny już się zakończył (zazwyczaj przez wywołanie B<pthread_exit>(3)).

source: This file contains the environment for the process. The entries are separated by null bytes (\(aq\e0\(aq), and there may be a null byte at the end. Thus, to print out the environment of process 1, you would do:
pl: Plik ten zawiera środowisko procesu. Wpisy są oddzielone znakami NULL ("\e0"), mogą także wystąpić znaki NULL na końcu. Dlatego, aby wypisać zmienne środowiskowe procesu 1, należy wykonać:

source: Under Linux 2.2 and later, this file is a symbolic link containing the actual pathname of the executed command. This symbolic link can be dereferenced normally; attempting to open it will open the executable. You can even type I</proc/[pid]/exe> to run another copy of the same executable as is being run by process [pid]. In a multithreaded process, the contents of this symbolic link are not available if the main thread has already terminated (typically by calling B<pthread_exit>(3)).
pl: W Linuksie 2.2 i wersjach późniejszych plik ten jest dowiązaniem symbolicznym zawierającym rzeczywistą nazwę ścieżki działającego polecenia. Dowiązaniem symbolicznym można się normalnie posługiwać - próba jego otwarcia otworzy plik programu. Można nawet wydać polecenie I</proc/[pid]/exe>, aby uruchomić kolejną kopię tego samego procesu co [pid].W procesie wielowątkowym zawartość tego linku symbolicznego nie jest dostępna, jeżeli główny wątek już się zakończył (wywołując zapewne B<pthread_exit>(3)).

source: Under Linux 2.0 and earlier I</proc/[pid]/exe> is a pointer to the binary which was executed, and appears as a symbolic link. A B<readlink>(2) call on this file under Linux 2.0 returns a string in the format:
pl: W Linuksie 2.0 i wcześniejszych wersjach, I</proc/[pid]/exe> jest wskaźnikiem do uruchomionego pliku binarnego i ma postać dowiązania symbolicznego. Wywołanie B<readlink>(2) na tym pliku zwróci w Linuksie 2.0 łańcuch znakowy postaci:

source: [device]:inode
pl: [urządzenie]:i-węzeł

source: For example, [0301]:1502 would be inode 1502 on device major 03 (IDE, MFM, etc. drives) minor 01 (first partition on the first drive).
pl: Na przykład, [0301]:1502 będzie 1502 i-węzłem na urządzeniu o numerze głównym 03 (IDE, MFM itp.) i pobocznym 01 (pierwsza partycja pierwszego dysku).

source: B<find>(1) with the I<-inum> option can be used to locate the file.
pl: Do zlokalizowania pliku, można posłużyć się poleceniem B<find>(1) z opcją I<-inum>.

source: This is a subdirectory containing one entry for each file which the process has open, named by its file descriptor, and which is a symbolic link to the actual file. Thus, 0 is standard input, 1 standard output, 2 standard error, etc.
pl: Jest to podkatalog zawierający po jednym wpisie dla każdego otwartego przez proces pliku; nazwą tego wpisu jest deskryptor pliku i jest on dowiązaniem symbolicznym do rzeczywistego pliku. Dlatego 0 jest standardowym wejściem, 1 jest standardowym wyjściem, 2 jest standardową diagnostyką, itd.

source: In a multithreaded process, the contents of this directory are not available if the main thread has already terminated (typically by calling B<pthread_exit>(3)).
pl: W procesie wielowątkowym zawartość tego katalogu nie jest dostępna, jeżeli wątek główny już się zakończył (zazwyczaj przez wywołanie B<pthread_exit>(3)).

source: Programs that will take a filename as a command-line argument, but will not take input from standard input if no argument is supplied, or that write to a file named as a command-line argument, but will not send their output to standard output if no argument is supplied, can nevertheless be made to use standard input or standard out using I</proc/[pid]/fd>. For example, assuming that I<-i> is the flag designating an input file and I<-o> is the flag designating an output file:
pl: Programy, które przyjmują nazwę pliku jako argument wiersza polecenia, lecz nie czytają standardowego wejścia, jeśli nie podano argumentu albo które zapisują do pliku nazwanego argumentem wiersza polecenia, lecz nie wysyłają danych wyjściowych na standardowe wyjście, można zmusić do używania standardowego wejścia lub wyjścia wykorzystując I</proc/[pid]/fd>. Na przykład, zakładając, że opcja I<-i> określa plik wejściowy, a opcja I<-o> określa plik wyjściowy:

source: and you have a working filter.
pl: co daje działający filtr.

source: I</proc/self/fd/N> is approximately the same as I</dev/fd/N> in some UNIX and UNIX-like systems. Most Linux MAKEDEV scripts symbolically link I</dev/fd> to I</proc/self/fd>, in fact.
pl: I</proc/self/fd/N> jest w przybliżeniu tym samym co I</dev/fd/N> na niektórych systemach uniksowych i uniksopodobnych. Większość linuksowych skryptów MAKEDEV tworzy dowiązania symboliczne I</dev/fd> do I</proc/self/fd>.

source: Most systems provide symbolic links I</dev/stdin>, I</dev/stdout>, and I</dev/stderr>, which respectively link to the files I<0>, I<1>, and I<2> in I</proc/self/fd>. Thus the example command above could be written as:
pl: Większość systemów udostępnia dowiązania symboliczne I</dev/stdin>, I</dev/stdout> i I<dev/stderr>, które linkują odpowiednio do plików I<0>, I<1> i I<2> w I</proc/self/fd>. Powyższe, przykładowe polecenie może być więc zapisane również tak:

source: I</proc/[pid]/fdinfo/> (since kernel 2.6.22)
pl: I</proc/[pid]/fdinfo/> (od wersji jądra 2.6.22)

source: This is a subdirectory containing one entry for each file which the process has open, named by its file descriptor. The contents of each file can be read to obtain information about the corresponding file descriptor, for example:
pl: Jest to podkatalog zawierający po jednym wpisie dla każdego pliku otwartego przez proces; nazwą tego wpisu jest deskryptor pliku. Zawartość pliku można odczytać, aby uzyskać informacje o odpowiadającym mu deskryptorze pliku, na przykład:

source: The I<pos> field is a decimal number showing the current file offset. The I<flags> field is an octal number that displays the file access mode and file status flags (see B<open>(2)).
pl: Pole I<pos> jest liczbą dziesiętną oznaczającą bieżące przesunięcie w pliku. Pole I<flags> jest liczbą ósemkową zawierającą prawa dostępu do pliku i znaczniki stanu (patrz B<open>(2)).

source: The files in this directory are readable only by the owner of the process.
pl: Tylko właściciel procesu może odczytywać pliki z tego katalogu.

source: I</proc/[pid]/limits> (since kernel 2.6.24)
pl: I</proc/[pid]/limits> (od wersji jądra 2.6.24)

source: This file displays the soft limit, hard limit, and units of measurement for each of the process's resource limits (see B<getrlimit>(2)). The file is protected to only allow reading by the real UID of the process.
pl: Plik zawiera informacje o miękkim limicie, twardym limicie i jednostkach, w których mierzone są limity zasobów procesów (patrz B<getrlimit>(2)). Plik jest zabezpieczony, aby pozwolić na odczyt jedynie przez realny identyfikator UID procesu.

source: A file containing the currently mapped memory regions and their access permissions.
pl: Plik zawierający aktualnie zmapowane obszary pamięci wraz z prawami dostępu do nich.

source: The format is:
pl: Format pliku jest następujący:

source: where "address" is the address space in the process that it occupies, "perms" is a set of permissions:
pl: gdzie "address" jest przestrzenią adresową procesu, który ją zajmuje, a "perms" jest zbiorem uprawnień:

source: r = read w = write x = execute s = shared p = private (copy on write)
pl: r = odczyt w = zapis x = wykonywanie s = wspólne p = prywatne (kopiowane przy zapisie)

source: "offset" is the offset into the file/whatever, "dev" is the device (major:minor), and "inode" is the inode on that device. 0 indicates that no inode is associated with the memory region, as the case would be with BSS (uninitialized data).
pl: "offset" jest przesunięciem w pliku lub czymkolwiek innym, "dev" zawiera numery (główny:poboczny) urządzenia, a "inode" jest i-węzłem na tym urządzeniu. 0 wskazuje, że nie istnieje i-węzeł związany z tym obszarem pamięci, jak to na przykład ma miejsce w przypadku segmentu BSS (niezainicjowanych danych).

source: Under Linux 2.0 there is no field giving pathname.
pl: W Linuksie 2.0 nie ma pola pathname podającego nazwę ścieżki.

source: This file can be used to access the pages of a process's memory through B<open>(2), B<read>(2), and B<lseek>(2).
pl: Za pośrednictwem tego pliku można, korzystając z B<open>(2), B<read>(2) i B<lseek>(2), uzyskać dostęp do stron pamięci procesu.

source: I</proc/[pid]/mountinfo> (since Linux 2.6.26)
pl: I</proc/[pid]/mountinfo> (od wersji jądra 2.6.26)

source: This file contains information about mount points. It contains lines of the form:
pl: Plik zawiera informacje o punktach montowania. Składa się z linii w postaci:

source: The numbers in parentheses are labels for the descriptions below:
pl: Liczby w nawiasach są etykietami poniższych opisów:

source: mount ID: unique identifier of the mount (may be reused after B<umount>(2)).
pl: ID montowania: unikatowy identyfikator montowania (może zostać użyty ponownie po wykonaniu B<umount>(2)).

source: parent ID: ID of parent mount (or of self for the top of the mount tree).
pl: ID rodzica: identyfikator rodzica (lub siebie samego, jeśli montowanie znajduje się na szczycie drzewa montowań).

source: major:minor: value of I<st_dev> for files on file system (see B<stat>(2)).
pl: główny:poboczny: wartość pola I<st_dev> (patrz B<stat>(2)) dla plików w systemie plików.

source: root: root of the mount within the file system.
pl: korzeń: korzeń (root) montowania w systemie plików.

source: mount point: mount point relative to the process's root.
pl: punkt montowania: punkt montowania w odniesieniu do korzenia procesów.

source: mount options: per-mount options.
pl: opcje montowania: opcje montowania dla każdego montowania.

source: optional fields: zero or more fields of the form "tag[:value]".
pl: pola opcjonalne: zero lub więcej pól w postaci "znacznik[:wartość]"

source: separator: marks the end of the optional fields.
pl: separator: oznacza koniec pól opcjonalnych.

source: file system type: name of file system in the form "type[.subtype]".
pl: typ systemu plików: nazwa systemu plików w postaci "typ[.podtyp]".

source: mount source: file system-specific information or "none".
pl: źródło montowania: informacja zależna od systemu plików lub "none".

source: super options: per-super block options.
pl: super opcje: opcje dla superbloku.

source: Parsers should ignore all unrecognized optional fields. Currently the possible optional fields are:
pl: Parsery powinny ignorować wszystkie nierozpoznane pola opcjonalne. Obecnie są to:

source: mount is shared in peer group X
pl: montowanie jest współdzielone w grupie węzłów X

source: mount is slave to peer group X
pl: montowanie jest podrzędne w stosunku do grupy węzłów X

source: mount is slave and receives propagation from peer group X (*)
pl: montowanie jest podrzędne i podlega propagacji z grupy węzłów X (*)

source: mount is unbindable
pl: montowanie jest niepodpinalne

source: (*) X is the closest dominant peer group under the process's root. If X is the immediate master of the mount, or if there is no dominant peer group under the same root, then only the "master:X" field is present and not the "propagate_from:X" field.
pl: (*) X jest najbliższą dominującą grupą węzłów pod korzeniem procesów. Jeśli X jest bezpośrednio nadrzędne w stosunku do montowania, lub jeśli nie istnieje dominująca grupa węzłów pod tym samym korzeniem, to obecne jest wyłącznie pole "master:X", bez pola "propagate_from:X".

source: For more information on mount propagation see: I<Documentation/filesystems/sharedsubtree.txt> in the kernel source tree.
pl: Aby dowiedzieć się więcej o propagacji montowań, proszę zapoznać się z I<Documentation/filesystems/sharedsubtree.txt> w drzewie źródeł jądra.

source: I</proc/[pid]/mounts> (since Linux 2.4.19)
pl: I</proc/[pid]/mounts> (od wersji Linuksa 2.4.19)

source: This is a list of all the file systems currently mounted in the process's mount namespace. The format of this file is documented in B<fstab>(5). Since kernel version 2.6.15, this file is pollable: after opening the file for reading, a change in this file (i.e., a file system mount or unmount) causes B<select>(2) to mark the file descriptor as readable, and B<poll>(2) and B<epoll_wait>(2) mark the file as having an error condition.
pl: Jest to lista wszystkich systemów plików obecnie zamontowanych w przestrzeni montowań procesów. Format tego pliku jest udokumentowany w B<fstab>(5). Od wersji 2.6.15 jądra Linuksa, ten plik może być użyty w wywołaniu funkcji poll(): po otwarciu tego pliku do odczytu, zmiana w nim (np. montowanie lub odmontowanie systemu plików) powoduje, że B<select>(2) oznaczy deskryptor jako możliwy do odczytu, a B<poll>(2) i B<epoll_wait>(2) zaznaczą, że w pliku wystąpił błąd.

source: I</proc/[pid]/mountstats> (since Linux 2.6.17)
pl: I</proc/[pid]/mountstats> (Od wersji Linuksa 2.6.17)

source: This file exports information (statistics, configuration information) about the mount points in the process's name space. Lines in this file have the form:
pl: Plik eksportuje informacje (statystyki, informacje konfiguracyjne) o punktach montowań w przestrzeni nazwy procesów. Wiersze pliku mają następującą postać:

source: The fields in each line are:
pl: Pola w każdym wierszu są następujące:

source: The name of the mounted device (or "nodevice" if there is no corresponding device).
pl: Nazwa zamontowanego urządzenia (lub "nodevice", jeśli nie ma odpowiadającego urządzenia).

source: The mount point within the file system tree.
pl: Punkt montowania w drzewie systemu plików.

source: The file system type.
pl: Typ systemu plików.

source: Optional statistics and configuration information. Currently (as at Linux 2.6.26), only NFS file systems export information via this field.
pl: Opcjonalne statystyki i informacje konfiguracyjne. Obecnie (Linux 2.6.26) tylko system plików NFS eksportuje opcje za pomocą tego pola.

source: This file is only readable by the owner of the process.
pl: Plik jest odczytywalny wyłącznie dla właściciela procesu.

source: I</proc/[pid]/ns/> (since Linux 3.0)
pl: I</proc/[pid]/ns/> (od Linuksa 3.0)

source: This is a subdirectory containing one entry for each namespace that supports being manipulated by B<setns>(2). For information about namespaces, see B<clone>(2).
pl: Jest to podkatalog zawierający po jednym wpisie dla każdej przestrzeni nazw, która obsługuje manipulację za pomocą B<setns>(2). Aby dowiedzieć się więcej o przestrzeniach nazw, proszę zapoznać się z B<clone>(2).

source: I</proc/[pid]/ns/ipc> (since Linux 3.0)
pl: I</proc/[pid]/ns/ipc> (od Linuksa 3.0)

source: Bind mounting this file (see B<mount>(2)) to somewhere else in the filesystem keeps the IPC namespace of the process specified by I<pid> alive even if all processes currently in the namespace terminate.
pl: Montowanie używając podpięcia wykonane na tym pliku (patrz B<mount>(2)) do jakiegoś innego miejsca w systemie plików utrzymuje przestrzeń nazwy IPC procesu określoną przez I<pid> nawet, gdy zakończą się wszystkie procesy znajdujące się obecnie w przestrzeni nazwy.

source: Opening this file returns a file handle for the IPC namespace of the process specified by I<pid>. As long as this file descriptor remains open, the IPC namespace will remain alive, even if all processes in the namespace terminate. The file descriptor can be passed to B<setns>(2).
pl: Otwarcie tego pliku przywróci obsługę pliku dotyczącą przestrzeni nazwy IPC procesu, określonego przez I<pid>. Tak długo jak jego deskryptor pliku pozostanie otwarty, przestrzeń nazwy IPC pozostanie aktywna, nawet jeśli wszystkie procesy w przestrzeni nazwy zakończą się. Deskryptor pliku może być podany do B<setns>(2).

source: I</proc/[pid]/ns/net> (since Linux 3.0)
pl: I</proc/[pid]/ns/net> (od Linuksa 3.0)

source: Bind mounting this file (see B<mount>(2)) to somewhere else in the filesystem keeps the network namespace of the process specified by I<pid> alive even if all processes in the namespace terminate.
pl: Montowanie używając podpięcia wykonane na tym pliku (patrz B<mount>(2)) do jakiegoś innego miejsca w systemie plików utrzymuje sieciową przestrzeń nazwy procesu określoną przez I<pid> nawet, gdy zakończą się wszystkie procesy znajdujące się w przestrzeni nazwy.

source: Opening this file returns a file handle for the network namespace of the process specified by I<pid>. As long as this file descriptor remains open, the network namespace will remain alive, even if all processes in the namespace terminate. The file descriptor can be passed to B<setns>(2).
pl: Otwarcie tego pliku przywróci obsługę pliku dotyczącą sieciowej przestrzeni nazwy procesu, określonego przez I<pid>. Tak długo jak jego deskryptor pliku pozostanie otwarty, sieciowa przestrzeń nazwy pozostanie aktywna, nawet jeśli wszystkie procesy w przestrzeni nazwy zakończą się. Deskryptor pliku może być podany do B<setns>(2).

source: I</proc/[pid]/ns/uts> (since Linux 3.0)
pl: I</proc/[pid]/ns/uts> (od Linuksa 3.0)

source: Bind mounting this file (see B<mount>(2)) to somewhere else in the filesystem keeps the UTS namespace of the process specified by I<pid> alive even if all processes currently in the namespace terminate.
pl: Montowanie używając podpięcia wykonane na tym pliku (patrz B<mount>(2)) do jakiegoś innego miejsca w systemie plików utrzymuje przestrzeń nazwy UTS procesu określoną przez I<pid> nawet, gdy zakończą się wszystkie procesy znajdujące się obecnie w przestrzeni nazwy.

source: Opening this file returns a file handle for the UTS namespace of the process specified by I<pid>. As long as this file descriptor remains open, the UTS namespace will remain alive, even if all processes in the namespace terminate. The file descriptor can be passed to B<setns>(2).
pl: Otwarcie tego pliku przywróci obsługę pliku dotyczącą przestrzeni nazwy UTS procesu, określonego przez I<pid>. Tak długo jak jego deskryptor pliku pozostanie otwarty, przestrzeń nazwy UTS pozostanie aktywna, nawet jeśli wszystkie procesy w przestrzeni nazwy zakończą się. Deskryptor pliku może być podany do B<setns>(2).

source: I</proc/[pid]/numa_maps> (since Linux 2.6.14)
pl: I</proc/[pid]/numa_maps> (od Linuksa 2.6.14)

source: See B<numa>(7).
pl: Patrz B<numa>(7).

source: I</proc/[pid]/oom_adj> (since Linux 2.6.11)
pl: I</proc/[pid]/oom_adj> (od Linuksa 2.6.11)

source: This file can be used to adjust the score used to select which process should be killed in an out-of-memory (OOM) situation. The kernel uses this value for a bit-shift operation of the process's I<oom_score> value: valid values are in the range -16 to +15, plus the special value -17, which disables OOM-killing altogether for this process. A positive score increases the likelihood of this process being killed by the OOM-killer; a negative score decreases the likelihood. The default value for this file is 0; a new process inherits its parent's I<oom_adj> setting. A process must be privileged (B<CAP_SYS_RESOURCE>) to update this file.
pl: Plik może być użyty do dostosowania wyniku, używanego do wybrania procesów do zabicia, w przypadku sytuacji braku pamięci (out-of-memory - OOM). Jądro używa tej wartości do operacji przesunięcia bitowego wartości I<oom_score> procesu: poprawne wartości mieszczą się w zakresie od -16 do +15, wraz ze specjalną wartością -17, która całkowicie wyłącza zabijanie przy OOM danego procesu. Dodatni wynik zwiększa prawdopodobieństwo, że proces zostanie zabity przez OOM-killer, ujemny zmniejsza je. Domyślną wartością tego pliku jest 0, nowy proces dziedziczy ustawienie I<oom_adj> swojego rodzica. Proces musi być uprzywilejowany (B<CAP_SYS_RESOURCE>) aby móc zaktualizować ten plik.

source: I</proc/[pid]/oom_score> (since Linux 2.6.11)
pl: I</proc/[pid]/oom_score> (od Linuksa 2.6.11)
