Repository: eurolinux-enterprise-linux-sources/man-pages-pl
Catalog: src/po/man5/proc.5.po
Languages: pl

source: Contains major and minor numbers of each partition as well as number of blocks and partition name.
pl: Zawiera liczby główne i poboczne każdej z partycji oraz liczby bloków i nazwy partycji.

source: This is a listing of all PCI devices found during kernel initialization and their configuration.
pl: Listing wszystkich urządzeń PCI znalezionych podczas inicjalizacji jądra i ich konfiguracja.

source: This file has been deprecated in favor of a new I</proc> interface for PCI (I</proc/bus/pci>). It became optional in Linux 2.2 (available with B<CONFIG_PCI_OLD_PROC> set at kernel compilation). It became once more nonoptionally enabled in Linux 2.4. Next, it was deprecated in Linux 2.6 (still available with B<CONFIG_PCI_LEGACY_PROC> set), and finally removed altogether since Linux 2.6.17.
pl: Plik został zastąpiony nowym interfejsem I</proc> do PCI (I</proc/bus/pci>). Stał się opcjonalny w Linuksie 2.2 (dostępny przy ustawieniu opcji B<CONFIG_PCI_OLD_PROC> przy kompilacji jądra). Ponownie stał się nieopcjonalny w Linuksie 2.4. Następnie, został uznany za przestarzały w Linuksie 2.6 (był wciąż dostępny przy ustawieniu B<CONFIG_PCI_LEGACY_PROC>), aż w końcu usunięto go w Linuksie 2.6.17.

source: A directory with the I<scsi> mid-level pseudo-file and various SCSI low-level driver directories, which contain a file for each SCSI host in this system, all of which give the status of some part of the SCSI IO subsystem. These files contain ASCII structures and are, therefore, readable with B<cat>(1).
pl: Katalog z pseudoplikiem I<scsi> na pośrednim poziomie i różnymi podkatalogami niskopoziomowych sterowników SCSI, zawierającymi po jednym pliku dla każdego kontrolera SCSI w danym systemie; każdy z nich podaje stan jakiejś części podsystemu we/wy SCSI. Pliki te zawierają struktury ASCII i dlatego nadają się do odczytu za pomocą B<cat>(1).

source: You can also write to some of the files to reconfigure the subsystem or switch certain features on or off.
pl: Możliwy jest też zapis do niektórych z tych plików, w celu rekonfiguracji podsystemu, lub przełączania różnych parametrów.

source: This is a listing of all SCSI devices known to the kernel. The listing is similar to the one seen during bootup. scsi currently supports only the I<add-single-device> command which allows root to add a hotplugged device to the list of known devices.
pl: Jest wypisaniem wszystkich znanych jądru urządzeń SCSI. Listing jest podobny do widzianego podczas ładowania systemu. scsi wspiera obecnie tylko polecenie I<add-single-device> umożliwiające rootowi dodanie do listy znanych urządzeń urządzenia włączonego na gorąco.

source: The command
pl: Polecenie

source: will cause host scsi1 to scan on SCSI channel 0 for a device on ID 5 LUN 0. If there is already a device known on this address or the address is invalid, an error will be returned.
pl: spowoduje, że kontroler scsi1 przeprowadzi skanowanie kanału SCSI 0 w poszukiwaniu urządzenia o ID 5 i LUN 0. Jeśli już istnieje urządzenie o takim adresie, lub adres jest nieprawidłowy, zostanie zwrócony błąd.

source: I</proc/scsi/[drivername]>
pl: I</proc/scsi/[nazwa-sterownika]>

source: I<[drivername]> can currently be NCR53c7xx, aha152x, aha1542, aha1740, aic7xxx, buslogic, eata_dma, eata_pio, fdomain, in2000, pas16, qlogic, scsi_debug, seagate, t128, u15-24f, ultrastore, or wd7000. These directories show up for all drivers that registered at least one SCSI HBA. Every directory contains one file per registered host. Every host-file is named after the number the host was assigned during initialization.
pl: I<[nazwa-sterownika]> może obecnie być jedną z: NCR53c7xx, aha152x, aha1542, aha1740, aic7xxx, buslogic, eata_dma, eata_pio, fdomain, in2000, pas16, qlogic, scsi_debug, seagate, t128, u15-24f, ultrastore, or wd7000. Ukazują się te z katalogów, dla których odpowiednie sterowniki zarejestrowały przynajmniej jeden kontroler SCSI. Każdy katalog zawiera jeden plik dla każdego zarejestrowanego kontrolera. Każdy z plików kontrolera ma nazwę odpowiadającą numerowi kontrolera, przyznanemu podczas jego inicjacji.

source: Reading these files will usually show driver and host configuration, statistics, etc.
pl: Czytanie tych plików zwykle pokaże konfigurację sterownika i kontrolera, statystyki itp.

source: Writing to these files allows different things on different hosts. For example, with the I<latency> and I<nolatency> commands, root can switch on and off command latency measurement code in the eata_dma driver. With the I<lockup> and I<unlock> commands, root can control bus lockups simulated by the scsi_debug driver.
pl: Pisanie do tych plików umożliwia różne operacje na różnych kontrolerach. Na przykład za pomocą poleceń I<latency> i I<nolatency> root może uaktywniać lub deaktywować kod pomiaru czasu oczekiwania dla poleceń (command latency) w sterowniku eata_dma. Za pomocą poleceń I<lockup> i I<unlock> root może sterować symulowanym przez sterownik scsi_debug blokowaniem magistrali.

source: This directory refers to the process accessing the I</proc> file system, and is identical to the I</proc> directory named by the process ID of the same process.
pl: Ten katalog odnosi się do procesu korzystającego z systemu plików I</proc> i jest identyczny z katalogiem w I</proc> o nazwie będącej jego PID-em.

source: Information about kernel caches. Since Linux 2.6.16 this file is only present if the B<CONFIG_SLAB> kernel configuration option is enabled. The columns in I</proc/slabinfo> are:
pl: Informacje o buforach jądra. Od Linuksa 2.6.16 plik ten istnieje tylko jeśli podczas kompilacji jądra włączono opcję I<CONFIG_SLAB>. Występują następujące kolumny w pliku I</proc/slabinfo>:

source: See B<slabinfo>(5) for details.
pl: Szczegóły można znaleźć w B<slabinfo>(5).

source: kernel/system statistics. Varies with architecture. Common entries include:
pl: statystyki jądra/systemu. Różnią się pomiędzy architekturami. Wśród wspólnych wpisów są:

source: The amount of time, measured in units of USER_HZ (1/100ths of a second on most architectures, use I<sysconf(_SC_CLK_TCK)> to obtain the right value), that the system spent in user mode, user mode with low priority (nice), system mode, and the idle task, respectively. The last value should be USER_HZ times the second entry in the uptime pseudo-file.
pl: Czas, wyrażony w USER_HZ (jedna setna sekundy na większości architektur, proszę użyć I<sysconf(_SC_CLK_TCK)> aby uzyskać prawidłową wartość), które system spędził w trybie użytkownika, trybie użytkownika o obniżonym priorytecie (nice), trybie systemowym i w zadaniu idle. Ostatnia wartość powinna być równa iloczynowi wartości USER_HZ z drugim wpisem w pseudopliku uptime.

source: In Linux 2.6 this line includes three additional columns: I<iowait> - time waiting for I/O to complete (since 2.5.41); I<irq> - time servicing interrupts (since 2.6.0-test4); I<softirq> - time servicing softirqs (since 2.6.0-test4).
pl: W Linuksie 2.6 linia ta zawiera trzy dodatkowe kolumny: I<iowait> - czas oczekiwania na zakończenie operacji I/O (od wersji 2.5.41); I<irq> - czas obsługiwania przerwań (od 2.6.0-test4); I<softirq> - czas obsługiwania miękkich przerwań (softirqs) (od 2.6.0-test4).

source: Since Linux 2.6.11, there is an eighth column, I<steal> - stolen time, which is the time spent in other operating systems when running in a virtualized environment
pl: Od Linuksa 2.6.11 istnieje również ósma kolumna, I<steal> - czas "skradziony", który jest czasem spędzonym w innym systemie operacyjnym podczas pracy w środowisku zwirtualizowanym.

source: Since Linux 2.6.24, there is a ninth column, I<guest>, which is the time spent running a virtual CPU for guest operating systems under the control of the Linux kernel.
pl: Od Linuksa 2.6.24 pojawiła się dziewiąta kolumna, I<guest>, która jest czasem spędzonym podczas działania na wirtualnym procesorze systemu operacyjnego gościa, pod kontrolą jądra Linux.

source: The number of pages the system paged in and the number that were paged out (from disk).
pl: Liczba stron, które system wstronicował i liczba tych, które wystronicował (z dysku).

source: The number of swap pages that have been brought in and out.
pl: Liczba stron wymiany, które wniesiono i wyniesiono.

source: This line shows counts of interrupts serviced since boot time, for each of the possible system interrupts. The first column is the total of all interrupts serviced; each subsequent column is the total for a particular interrupt.
pl: Linia ta pokazuje licznik przerwań obsłużonych od czasu uruchomienia dla każdego możliwego przerwania systemowego. Pierwsza kolumna określa całkowitą liczbę wszystkich obsłużonych przerwań, każda następna określa całkowitą wartość dla danego przerwania.

source: (Linux 2.4 only)
pl: (tylko Linux 2.4)

source: The number of context switches that the system underwent.
pl: Liczba przełączeń kontekstu, które przeszedł system.

source: boot time, in seconds since the Epoch, 1970-01-01 00:00:00 +0000 (UTC).
pl: Czas uruchomienia systemu, w sekundach od epoki: 1970-01-01 00:00:00 +0000 (UTC).

source: Number of forks since boot.
pl: Liczba rozwidleń procesów od uruchomienia systemu.

source: Number of processes in runnable state. (Linux 2.5.45 onward.)
pl: Liczba procesów w stanie runnable (Linux 2.5.45 i późniejsze).

source: Number of processes blocked waiting for I/O to complete. (Linux 2.5.45 onward.)
pl: Liczba procesów oczekujących na zakończenie operacji wejścia/wyjścia (Linux 2.5.45 i późniejsze).

source: Swap areas in use. See also B<swapon>(8).
pl: Używane obszary wymiany. Zobacz także B<swapon>(8).

source: This directory (present since 1.3.57) contains a number of files and subdirectories corresponding to kernel variables. These variables can be read and sometimes modified using the I</proc> file system, and the (deprecated) B<sysctl>(2) system call.
pl: Katalog ten (obecny od 1.3.57) zawiera wiele plików i podkatalogów odpowiadających zmiennym jądra. Zmienne te mogą być odczytywane i czasem modyfikowane za pośrednictwem systemu plików I<proc>, jak też przy wykorzystaniu (przestarzałej) funkcji systemowej B<sysctl>(2)

source: I</proc/sys/abi> (since Linux 2.4.10)
pl: I</proc/sys/abi> (od Linuksa 2.4.10)

source: This directory may contain files with application binary information. See the kernel source file I<Documentation/sysctl/abi.txt> for more information.
pl: Plik może zawierać pliki z binarnymi informacjami aplikacji. Dalsze informacje można znaleźć w pliku I<Documentation/sysctl/abi.txt> w źródłach jądra.

source: This directory may be empty.
pl: Ten katalog może być pusty.

source: This directory contains device-specific information (e.g., I<dev/cdrom/info>). On some systems, it may be empty.
pl: Ten katalog zawiera informacje specyficzne dla poszczególnych urządzeń. (np. I<dev/cdrom/info>). W niektórych systemach może być pusty.

source: This directory contains the files and subdirectories for kernel variables related to file systems.
pl: Katalog zawierający pliki i podkatalogi do zmiennych jądra związanych z systemami plików.

source: Documentation for files in this directory can be found in the kernel sources in I<Documentation/binfmt_misc.txt>.
pl: Dokumentacja plików z tego katalogu znajduje się w źródłach jądra w I<Documentation/binfmt_misc.txt>.

source: I</proc/sys/fs/dentry-state> (since Linux 2.2)
pl: I</proc/sys/fs/dentry-state> (od Linuksa 2.2)

source: This file contains information about the status of the directory cache (dcache). The file contains six numbers, I<nr_dentry>, I<nr_unused>, I<age_limit> (age in seconds), I<want_pages> (pages requested by system) and two dummy values.
pl: Plik zawiera informacje o statusie bufora katalogu (dcache). Zawiera sześć liczb: I<nr_dentry>, I<nr_unused>, I<age_limit> (wiek w sekundach), I<want_pages> (strony żądane przez system) i dwie nieużywane wartości.

source: I<nr_dentry> is the number of allocated dentries (dcache entries). This field is unused in Linux 2.2.
pl: I<nr_dentry> jest liczbą zaalokowanych dentries (wpisów dcache). To pole jest nieużywane w Linuksie 2.2.

source: I<nr_unused> is the number of unused dentries.
pl: I<nr_unused> jest liczbą nieużywanych dentries.

source: I<age_limit> is the age in seconds after which dcache entries can be reclaimed when memory is short.
pl: I<age_limit> jest wiekiem w sekundach, po którym wpisy dcache mogą być przydzielone ponownie, gdy jest zbyt mało pamięci.

source: I<want_pages> is nonzero when the kernel has called shrink_dcache_pages() and the dcache isn't pruned yet.
pl: I<want_pages> jest niezerowa, gdy jądro wywołało shrink_dcache_pages(), ale dcache nie zostały jeszcze przycięte.

source: This file can be used to disable or enable the I<dnotify> interface described in B<fcntl>(2) on a system-wide basis. A value of 0 in this file disables the interface, and a value of 1 enables it.
pl: Plik ten może służyć do wyłączania lub włączania interfejsu I<dnotify> opisanego w B<fcntl>(2) dla całego systemu. Wartość 0 w tym pliku wyłącza interfejs, a wartość 1 go włącza.

source: This file shows the maximum number of cached disk quota entries. On some (2.4) systems, it is not present. If the number of free cached disk quota entries is very low and you have some awesome number of simultaneous system users, you might want to raise the limit.
pl: Zawiera maksymalną liczbę buforowanych wpisów kwot dyskowych. W niektórych (2.4) systemach nie występuje. Gdy liczba wolnych zbuforowanych kwot dyskowych jest bardzo mała, a jest przerażająca liczba jednoczesnych użytkowników systemu, może istnieć potrzeba zwiększenia tego ograniczenia.

source: This file shows the number of allocated disk quota entries and the number of free disk quota entries.
pl: Zawiera liczbę przydzielonych wpisów kwot dyskowych oraz liczbę wolnych wpisów kwot dyskowych.

source: I</proc/sys/fs/epoll> (since Linux 2.6.28)
pl: I</proc/sys/fs/epoll> (od Linuksa 2.6.28)

source: This directory contains the file I<max_user_watches>, which can be used to limit the amount of kernel memory consumed by the I<epoll> interface. For further details, see B<epoll>(7).
pl: Katalog zawiera plik I<max_user_watches>, którego można użyć, aby ograniczyć ilość pamięci jądra używanej przez interfejs I<epoll>. Więcej szczegółów można znaleźć w B<epoll>(7).

source: This file defines a system-wide limit on the number of open files for all processes. (See also B<setrlimit>(2), which can be used by a process to set the per-process limit, B<RLIMIT_NOFILE>, on the number of files it may open.) If you get lots of error messages about running out of file handles, try increasing this value:
pl: Zawiera ogólnosystemowe ograniczenie liczby plików otwartych przez wszystkie procesy. (Zobacz także B<setrlimit>(2), które może służyć procesom do ustawiania ograniczenia dla procesu, B<RLIMIT_NOFILE>, jako liczby plików, które proces może otworzyć). Gdy otrzymuje się mnóstwo komunikatów o przekroczeniu liczby uchwytów plików (file handles), to można spróbować zwiększyć tę wartość:

source: The kernel constant B<NR_OPEN> imposes an upper limit on the value that may be placed in I<file-max>.
pl: Stała jądra B<NR_OPEN> narzuca górne ograniczenie wartości, która może zostać umieszczone w I<file-max>.

source: If you increase I</proc/sys/fs/file-max>, be sure to increase I</proc/sys/fs/inode-max> to 3-4 times the new value of I</proc/sys/fs/file-max>, or you will run out of inodes.
pl: Gdy zwiększa się I</proc/sys/fs/file-max>, należy pamiętać o zwiększeniu I</proc/sys/fs/inode-max> do wartości 3-4 razy większej niż nowa wartość I</proc/sys/fs/file-max> lub należy się liczyć z tym, że zabraknie i-węzłów.

source: This (read-only) file gives the number of files presently opened. It contains three numbers: the number of allocated file handles; the number of free file handles; and the maximum number of file handles. The kernel allocates file handles dynamically, but it doesn't free them again. If the number of allocated files is close to the maximum, you should consider increasing the maximum. When the number of free file handles is large, you've encountered a peak in your usage of file handles and you probably don't need to increase the maximum.
pl: Ten (tylko do odczytu) plik określa liczbę aktualnie otwartych plików. Zawiera on trzy liczby: liczbę przydzielonych uchwytów plików, liczbę wolnych uchwytów plików oraz maksymalną liczbę uchwytów plików. Jądro przydziela uchwyty plików dynamicznie, ale ich później nie zwalnia. Gdy liczba przydzielonych uchwytów plików zbliża się do maksimum, należy rozważyć zwiększenie tego maksimum. Gdy jest duża liczba wolnych uchwytów plików, oznacza to, że wystąpiło przesilenie w wykorzystaniu uchwytów plików i, prawdopodobnie, nie ma potrzeby zwiększania maksimum.

source: This file contains the maximum number of in-memory inodes. On some (2.4) systems, it may not be present. This value should be 3-4 times larger than the value in I<file-max>, since I<stdin>, I<stdout> and network sockets also need an inode to handle them. When you regularly run out of inodes, you need to increase this value.
pl: Ten plik zawiera maksymalną liczbę i-węzłów w pamięci. W niektórych (2.4) systemach może nie występować. Wartość ta powinna być 3-4 razy większa niż wartość w I<file-max>, gdyż I<stdin>, I<stdout> i gniazda sieciowe również potrzebują i-węzłów, aby można było na nich operować. Gdy systematycznie brakuje i-węzłów, istnieje potrzeba zwiększenia tej wartości.

source: This file contains the first two values from I<inode-state>.
pl: Zawiera dwie pierwsze wartości z I<inode-state>.

source: This file contains seven numbers: I<nr_inodes>, I<nr_free_inodes>, I<preshrink>, and four dummy values. I<nr_inodes> is the number of inodes the system has allocated. This can be slightly more than I<inode-max> because Linux allocates them one page full at a time. I<nr_free_inodes> represents the number of free inodes. I<preshrink> is nonzero when the I<nr_inodes> E<gt> I<inode-max> and the system needs to prune the inode list instead of allocating more.
pl: Zawiera siedem liczb: I<nr_inodes>, I<nr_free_inodes>, I<preshrink> i cztery wartości nieużywane. I<nr_inodes> jest liczbą przydzielonych w systemie i-węzłów. Może ona być nieco większa niż I<inode-max>, gdyż Linux przydziela je pełnymi stronami. I<nr_free_inodes> przedstawia liczbę wolnych i-węzłów. I<preshrink> jest niezerowe, gdy I<nr_inodes> E<gt> I<inode-max> oraz w systemie występuje potrzeba wyczyszczenia listy i-węzłów zamiast przydzielania nowych.

source: I</proc/sys/fs/inotify> (since Linux 2.6.13)
pl: I</proc/sys/fs/inotify> (od wersji Linuksa 2.6.13)

source: This directory contains files I<max_queued_events>, I<max_user_instances>, and I<max_user_watches>, that can be used to limit the amount of kernel memory consumed by the I<inotify> interface. For further details, see B<inotify>(7).
pl: Ten katalog zawiera pliki I<max_queued_events>, I<max_user_instances> i I<max_user_watches>, których można użyć, aby ograniczyć ilość pamięci jądra używanej przez interfejs I<inotify>. Więcej szczegółów można znaleźć w B<inotify>(7).

source: This file specifies the grace period that the kernel grants to a process holding a file lease (B<fcntl>(2)) after it has sent a signal to that process notifying it that another process is waiting to open the file. If the lease holder does not remove or downgrade the lease within this grace period, the kernel forcibly breaks the lease.
pl: Określa okres ulgi, przez jaki jądro zapewnia procesowi utrzymanie dzierżawy pliku (B<fcntl>(2)), a po którym wyśle do tego procesu sygnał zawiadamiający go, że inny proces oczekuje na otwarcie pliku. Jeśli utrzymujący dzierżawę nie usunie jej lub nie ograniczy swoich praw do niej w przeciągu tego czasu, jądro wymusi zerwanie dzierżawy.

source: This file can be used to enable or disable file leases (B<fcntl>(2)) on a system-wide basis. If this file contains the value 0, leases are disabled. A nonzero value enables leases.
pl: Ten plik może służyć do ogólnosystemowego włączania lub wyłączania dzierżaw plików (B<fcntl>(2)). Gdy plik ten zawiera wartość 0, dzierżawy są wyłączone. Wartość niezerowa włącza dzierżawy.

source: I</proc/sys/fs/mqueue> (since Linux 2.6.6)
pl: I</proc/sys/fs/mqueue> (od wersji Linuksa 2.6.6)

source: This directory contains files I<msg_max>, I<msgsize_max>, and I<queues_max>, controlling the resources used by POSIX message queues. See B<mq_overview>(7) for details.
pl: Ten katalog zawiera pliki I<msg_max>, I<msgsize_max> i I<queues_max>, kontrolujące zasoby używane przez kolejki komunikatów POSIX. Szczegółowe informacje można znaleźć w B<mq_overview>(7).

source: These files allow you to change the value of the fixed UID and GID. The default is 65534. Some file systems only support 16-bit UIDs and GIDs, although in Linux UIDs and GIDs are 32 bits. When one of these file systems is mounted with writes enabled, any UID or GID that would exceed 65535 is translated to the overflow value before being written to disk.
pl: Te pliki umożliwiają zmianę wartości ustalonego UID-u i GID-u. Wartością domyślną jest 65534. Niektóre systemy plików wspierają jedynie 16-bitowe UID-y i GID-y, podczas gdy linuksowe UID-y i GID-y są 32-bitowe. Gdy któryś z takich systemów plików jest zamontowany z możliwością zapisu, to wszystkie UID-y i GID-y przekraczające 65535 są zastępowane podanymi tu wartościami przed zapisem na dysk.

source: I</proc/sys/fs/pipe-max-size> (since Linux 2.6.35)
pl: I</proc/sys/fs/pipe-max-size> (od Linuksa 2.6.35)

source: The value in this file defines an upper limit for raising the capacity of a pipe using the B<fcntl>(2) B<F_SETPIPE_SZ> operation. This limit applies only to unprivileged processes. The default value for this file is 1,048,576. The value assigned to this file may be rounded upward, to reflect the value actually employed for a convenient implementation. To determine the rounded-up value, display the contents of this file after assigning a value to it. The minimum value that can be assigned to this file is the system page size.
pl: Wartość w tym pliku definiuje górny limit do podnoszenia pojemności potoku przy użyciu operacji B<F_SETPIPE_SZ> B<fcntl>(2). Limit ten odnosi się wyłącznie do procesów nieuprzywilejowanych. Domyślną wartością dla tego pliku jest 1 048 576. Wartość przypisana do pliku może być zaokrąglona w górę, odnosząc się do faktycznej wartości wykorzystanej z powodu dogodnej implementacji. Aby poznać zaokrągloną wartość, należy wyświetlić zawartość tego pliku po przypisaniu do niego wartości. Minimalną wartością, jaka może zostać przypisana do tego pliku jest systemowy rozmiar strony.

source: I</proc/sys/fs/suid_dumpable> (since Linux 2.6.13)
pl: I</proc/sys/fs/suid_dumpable> (od wersji Linuksa 2.6.13)

source: The value in this file determines whether core dump files are produced for set-user-ID or otherwise protected/tainted binaries. Three different integer values can be specified:
pl: Wartość w tym pliku określa, czy pliki zrzutów pamięci są tworzone dla programów mających ustawiony bit set-user-ID albo chronionych w jakiś inny sposób. Można podać trzy różne wartości liczbowe:

source: I<0\ (default)> This provides the traditional (pre-Linux 2.6.13) behavior. A core dump will not be produced for a process which has changed credentials (by calling B<seteuid>(2), B<setgid>(2), or similar, or by executing a set-user-ID or set-group-ID program) or whose binary does not have read permission enabled.
pl: I<0\ (domyślny)>. Jest to tradycyjne zachowanie (sprzed Linuksa 2.6.13). Zrzut pamięci nie będzie tworzony dla procesu, który zmienił swoje uprawnienia (wywołując B<seteuid>(2), B<setgid>(2) lub podobną funkcję albo gdy program miał ustawiony bit set-user-ID lub set-group-ID) albo gdy uprawnienia nadane plikowi binarnemu programu zabraniają jego odczytywania.
