Repository: eurolinux-enterprise-linux-sources/man-pages-pl
Catalog: src/po/man5/proc.5.po
Languages: pl

source: To free pagecache, use I<echo 1 E<gt> /proc/sys/vm/drop_caches>; to free dentries and inodes, use I<echo 2 E<gt> /proc/sys/vm/drop_caches>; to free pagecache, dentries and inodes, use I<echo 3 E<gt> /proc/sys/vm/drop_caches>.
pl: Aby zwolnić bufor stronicowania, należy użyć I<echo 1 E<gt> /proc/sys/vm/drop_caches>; aby zwolnić dentries i i-węzły, należy użyć I<echo 2 E<gt> /proc/sys/vm/drop_caches>; aby zwolnić bufor stronicowania, dentries i i-węzły, należy użyć I<echo 3 E<gt> /proc/sys/vm/drop_caches>.

source: Because this is a nondestructive operation and dirty objects are not freeable, the user should run B<sync>(8) first.
pl: Ponieważ operacja ta nie jest destrukcyjna i brudne obiekty nie są zwalniane, użytkownik powinien wcześniej uruchomić B<sync>(8).

source: I</proc/sys/vm/legacy_va_layout> (since Linux 2.6.9)
pl: I</proc/sys/vm/legacy_va_layout> (od wersji Linuksa 2.6.9)

source: If nonzero, this disables the new 32-bit memory-mapping layout; the kernel will use the legacy (2.4) layout for all processes.
pl: Wartość niezerowa oznacza wyłączenie nowego, 32-bitowego rozmieszczenia mapowania pamięci; jądro będzie używać starego (2.4) rozmieszczenia dla wszystkich procesów.

source: I</proc/sys/vm/memory_failure_early_kill> (since Linux 2.6.32)
pl: I</proc/sys/vm/memory_failure_early_kill> (od Linuksa 2.6.32)

source: Control how to kill processes when an uncorrected memory error (typically a 2-bit error in a memory module) that cannot be handled by the kernel is detected in the background by hardware. In some cases (like the page still having a valid copy on disk), the kernel will handle the failure transparently without affecting any applications. But if there is no other up-to-date copy of the data, it will kill processes to prevent any data corruptions from propagating.
pl: Kontroluje jak zabijać procesy z nienaprawialnym błędem pamięci (z reguły 2-bitowy błąd w module pamięci), które nie mogą być obsłużone przez jądro, wykryte w tle przez sprzęt. W niektórych przypadkach (np. jeśli strona ma wciąż poprawną kopię na dysku), jądro obsłuży taki błąd w sposób przezroczysty, bez wpływu na pracę aplikacji. Jednak jeśli nie istnieje inna, zaktualizowana kopia danych, jądro zabija procesy, aby zapobiec uszkodzeniu danych wynikłego z propagacji błędu.

source: The file has one of the following values:
pl: Plik posiada jedną z następujących wartości:

source: Kill all processes that have the corrupted-and-not-reloadable page mapped as soon as the corruption is detected. Note this is not supported for a few types of pages, like kernel internally allocated data or the swap cache, but works for the majority of user pages.
pl: Wszystkie procesy, które posiadają zmapowaną uszkodzoną i nieprzeładowaną stronę, są zabijane zaraz po wykryciu uszkodzenia. Proszę zauważyć, że nie jest to obsługiwane dla nielicznych typów stron, takich jak wewnętrzne przypisanie danych przez jądro lub pamięć podręczna na dysku (swap), ale działa w przypadku większości stron użytkownika.

source: Only unmap the corrupted page from all processes and only kill a process who tries to access it.
pl: Usuwana (unmap) jest jedynie uszkodzona strona, a zabijane są wyłącznie procesy, które chcą uzyskać do niej dostęp.

source: The kill is performed using a B<SIGBUS> signal with I<si_code> set to B<BUS_MCEERR_AO>. Processes can handle this if they want to; see B<sigaction>(2) for more details.
pl: Zabicie jest wykonywane za pomocą sygnału B<SIGBUS> z I<si_code> ustawionym na B<BUS_MCEERR_AO>. Procesy mogą obsłużyć tę sytuację, jeśli chcą; proszę zapoznać się z B<sigaction>(2), aby dowiedzieć się więcej.

source: This feature is only active on architectures/platforms with advanced machine check handling and depends on the hardware capabilities.
pl: Funkcja jest aktywna wyłącznie na architekturach/platformach z zaawansowaną, maszynową obsługą sprawdzania i zależy od możliwości sprzętowych.

source: Applications can override the I<memory_failure_early_kill> setting individually with the B<prctl>(2) B<PR_MCE_KILL> operation.
pl: Aplikacje mogą indywidualnie przesłonić ustawienie I<memory_failure_early_kill> za pomocą operacji B<PR_MCE_KILL> B<prctl>(2).

source: Only present if the kernel was configured with B<CONFIG_MEMORY_FAILURE>.
pl: Obecne tylko, jeśli jądro zostało skonfigurowane z B<CONFIG_MEMORY_FAILURE>.

source: I</proc/sys/vm/memory_failure_recovery> (since Linux 2.6.32)
pl: I</proc/sys/vm/memory_failure_recovery> (od Linuksa 2.6.32)

source: Enable memory failure recovery (when supported by the platform)
pl: Włącza odzyskiwanie po błędzie pamięci (jeśli jest obsługiwane przez daną platformę)

source: Attempt recovery.
pl: Próbuje odzyskiwać.

source: Always panic on a memory failure.
pl: Zawsze panikuje przy błędzie pamięci.

source: I</proc/sys/vm/oom_dump_tasks> (since Linux 2.6.25)
pl: I</proc/sys/vm/oom_dump_tasks> (od Linuksa 2.6.25)

source: Enables a system-wide task dump (excluding kernel threads) to be produced when the kernel performs an OOM-killing. The dump includes the following information for each task (thread, process): thread ID, real user ID, thread group ID (process ID), virtual memory size, resident set size, the CPU that the task is scheduled on, oom_adj score (see the description of I</proc/[pid]/oom_adj>), and command name. This is helpful to determine why the OOM-killer was invoked and to identify the rogue task that caused it.
pl: Włącza tworzenie ogólnosystemowego zrzutu zadania (bez wątków jądra), gdy jądro wykonuje OOM-killing. Zrzut zawiera następujące informacje o każdym zadaniu (wątku, procesie): identyfikator wątku, realny identyfikator użytkownika, identyfikator grupy wątku (identyfikator procesu), rozmiar pamięci wirtualnej, rozmiar zestawu rezydentnego, procesor któremu przydzielono zadanie, wynik oom_adj (patrz opis I</proc/[pid]/oom_adj>) i nazwę polecenia. Jest to przydatne do określenia dlaczego OOM-killer został przywołany i zidentyfikowania zadania, które to spowodowało.

source: If this contains the value zero, this information is suppressed. On very large systems with thousands of tasks, it may not be feasible to dump the memory state information for each one. Such systems should not be forced to incur a performance penalty in OOM situations when the information may not be desired.
pl: Jeśli zawiera wartość zero, ta informacja nie jest zrzucana. Zrobienie zrzutu stanu pamięci każdego zadania może nie być wykonalne w bardzo dużych systemach, z tysiącami zadań. Takie systemy nie powinny być zmuszane do narażania się na dodatkowy spadek wydajności w sytuacjach braku pamięci, gdy taka informacja nie może być przydatna.

source: If this is set to nonzero, this information is shown whenever the OOM-killer actually kills a memory-hogging task.
pl: Jeśli wartość jest niezerowa, ta informacja jest pokazywana kiedy tylko OOM-killer rzeczywiście zabija zadanie zajmujące dużo pamięci.

source: The default value is 0.
pl: Domyślną wartością jest 0.

source: I</proc/sys/vm/oom_kill_allocating_task> (since Linux 2.6.24)
pl: I</proc/sys/vm/oom_kill_allocating_task> (od Linuksa 2.6.24)

source: This enables or disables killing the OOM-triggering task in out-of-memory situations.
pl: Włącza lub wyłącza zabijanie zadania kolejkującego OOM w sytuacjach braku pamięci (Out-Of-Memory).

source: If this is set to zero, the OOM-killer will scan through the entire tasklist and select a task based on heuristics to kill. This normally selects a rogue memory-hogging task that frees up a large amount of memory when killed.
pl: Jeśli jest ustawione na zero OOM-killer przeskanuje całą listę zadań i do zabicia wybierze zadania na podstawie heurystyki. Z reguły wybierane są zadania zajmujące wiele pamięci, które zwalniają dużą ilość pamięci po zabiciu.

source: If this is set to nonzero, the OOM-killer simply kills the task that triggered the out-of-memory condition. This avoids a possibly expensive tasklist scan.
pl: Jeśli jest ustawione na wartość niezerową, OOM-killer po prostu zabija zadanie, które wyzwoliło stan braku pamięci. W ten sposób unika się potencjalnie kosztownego skanowania listy zadań.

source: If I</proc/sys/vm/panic_on_oom> is nonzero, it takes precedence over whatever value is used in I</proc/sys/vm/oom_kill_allocating_task>.
pl: Jeśli I</proc/sys/vm/panic_on_oom> jest niezerowe, to ma ono pierwszeństwo, niezależnie od wartości użytej w I</proc/sys/vm/oom_kill_allocating_task>.

source: This file contains the kernel virtual memory accounting mode. Values are:
pl: Plik zawiera tryb rozliczeń pamięci wirtualnej jądra. Dopuszczalne wartości:

source: 0: heuristic overcommit (this is the default)
pl: 0: heurystyczny overcommit (domyślnie)

source: 1: always overcommit, never check
pl: 1: zawsze robi overcommit, nigdy nie sprawdza

source: 2: always check, never overcommit
pl: 2: zawsze sprawdza, nigdy nie robi overcommitu

source: In mode 0, calls of B<mmap>(2) with B<MAP_NORESERVE> are not checked, and the default check is very weak, leading to the risk of getting a process "OOM-killed". Under Linux 2.4 any nonzero value implies mode 1. In mode 2 (available since Linux 2.6), the total virtual address space on the system is limited to (SS + RAM*(r/100)), where SS is the size of the swap space, and RAM is the size of the physical memory, and r is the contents of the file I</proc/sys/vm/overcommit_ratio>.
pl: W trybie 0 nie są sprawdzane wywołania B<mmap>(2) z B<MAP_NORESERVE>, a domyślne sprawdzenia są bardzo słabe, prowadząc do ryzyka zabicia procesu przez "OOM-killera". Pod Linuksem 2.4 jakakolwiek wartość niezerowa oznacza tryb 1. W trybie 2 (dostępnym od Linuksa 2.6), całkowity adres przestrzeni wirtualnej w systemie jest ograniczony do (SS + RAM*(r/100)), gdzie SS jest rozmiarem przestrzeni wymiany, RAM jest rozmiarem fizycznej pamięci, a r - zawartością pliku I</proc/sys/vm/overcommit_ratio>.

source: See the description of I</proc/sys/vm/overcommit_memory>.
pl: Zobacz opis I</proc/sys/vm/overcommit_memory>.

source: I</proc/sys/vm/panic_on_oom> (since Linux 2.6.18)
pl: I</proc/sys/vm/panic_on_oom> (od wersji Linuksa 2.6.18)

source: This enables or disables a kernel panic in an out-of-memory situation.
pl: Włącza lub wyłącza panikę jądra w sytuacjach braku pamięci.

source: If this file is set to the value 0, the kernel's OOM-killer will kill some rogue process. Usually, the OOM-killer is able to kill a rogue process and the system will survive.
pl: Jeśli plik ma ustawioną wartość 0, OOM-killer jądra zabija któryś z nieposłusznych procesów. Z reguły OOM-killer jest w stanie to wykonać i system może pracować dalej.

source: If this file is set to the value 1, then the kernel normally panics when out-of-memory happens. However, if a process limits allocations to certain nodes using memory policies (B<mbind>(2) B<MPOL_BIND>) or cpusets (B<cpuset>(7)) and those nodes reach memory exhaustion status, one process may be killed by the OOM-killer. No panic occurs in this case: because other nodes' memory may be free, this means the system as a whole may not have reached an out-of-memory situation yet.
pl: Jeśli plik ma ustawioną wartość 1, to jądro zwykle panikuje przy sytuacji braku pamięci. Jednak jeśli proces limituje przydzielanie do konkretnych węzłów używając zasad pamięci (B<mbind>(2) B<MPOL_BIND>) lub cpuset (B<cpuset>(7)) i te węzły dotknie problem braku pamięci, to taki proces może być zabity przez OOM-killer. Nie występuje wówczas panika, ponieważ pamięć innych węzłów może być wolna, co oznacza że system jako całość mógł nie osiągnąć jeszcze sytuacji braku pamięci.

source: If this file is set to the value 2, the kernel always panics when an out-of-memory condition occurs.
pl: Jeśli ustawiono wartość 2, to jądro zawsze panikuje w sytuacji braku pamięci.

source: The default value is 0. 1 and 2 are for failover of clustering. Select either according to your policy of failover.
pl: Domyślną wartość jest 0. 1 i 2 są przeznaczone do poprawnej pracy klastrów mimo wystąpienia problemów. Proszę wybrać właściwą z nich, zgodnie z używanymi zasadami w takich sytuacjach.

source: The value in this file controls how aggressively the kernel will swap memory pages. Higher values increase aggressiveness, lower values decrease aggressiveness. The default value is 60.
pl: Wartość w tym pliku kontroluje jak agresywnie jądro przenosi strony pamięci do pamięci wymiany (swapu). Wyższe wartości zwiększają agresywność, mniejsze zmniejszają ją. Domyślną wartością jest 60.

source: I</proc/sysrq-trigger> (since Linux 2.4.21)
pl: I</proc/sysrq-trigger> (od Linuksa 2.4.21)

source: Writing a character to this file triggers the same SysRq function as typing ALT-SysRq-E<lt>characterE<gt> (see the description of I</proc/sys/kernel/sysrq>). This file is normally only writable by I<root>. For further details see the kernel source file I<Documentation/sysrq.txt>.
pl: Zapisanie znaków do tego pliku wyzwala tę samą funkcję SysRq, jaka zostałaby wykonana przy użyciu kombinacji ALT-SysRq-E<lt>znakE<gt> (patrz opis I</proc/sys/kernel/sysrq>). Plik jest normalnie zapisywalny tylko dla roota. Aby dowiedzieć się więcej, proszę zapoznać się z plikiem I<Documentation/sysrq.txt> w źródłach jądra.

source: Subdirectory containing the pseudo-files I<msg>, I<sem> and I<shm>. These files list the System V Interprocess Communication (IPC) objects (respectively: message queues, semaphores, and shared memory) that currently exist on the system, providing similar information to that available via B<ipcs>(1). These files have headers and are formatted (one IPC object per line) for easy understanding. B<svipc>(7) provides further background on the information shown by these files.
pl: Podkatalog zawierający pseudopliki I<msg>, I<sem> i I<shm>. Pliki te zawierają obiekty komunikacji międzyprocesowej (Interprocess Communication - IPC) Systemu V (odpowiednio: kolejki komunikatów, semafory i pamięć wspólną) obecnie istniejące w systemie, udostępniając informacje podobne do tych, które są dostępne poprzez B<ipcs>(1). Pliki te zawierają nagłówki i są sformatowane (jeden obiekt IPC w wierszu) w celu łatwiejszego zrozumienia. B<svipc>(7) podaje dodatkowe informacje o zawartości tych plików.

source: Subdirectory containing the pseudo-files and subdirectories for tty drivers and line disciplines.
pl: Podkatalog zawierający psuedopliki i podkatalogi sterowników terminali (tty) oraz protokołów sterowania linią (line discipline).

source: This file contains two numbers: the uptime of the system (seconds), and the amount of time spent in idle process (seconds).
pl: Ten plik zawiera dwie liczby: czas pracy systemu (w sekundach) i ilość czasu spędzonego na wykonywaniu procesu idle (w sekundach).

source: This string identifies the kernel version that is currently running. It includes the contents of I</proc/sys/kernel/ostype>, I</proc/sys/kernel/osrelease> and I</proc/sys/kernel/version>. For example:
pl: Ten napis określa wersję obecnie działającego jądra. Zawiera on w sobie zawartość I</proc/sys/ostype>, I</proc/sys/osrelease> i I</proc/sys/version>. Na przykład:

source: I</proc/vmstat> (since Linux 2.6)
pl: I</proc/vmstat> (od wersji Linuksa 2.6)

source: This file displays various virtual memory statistics.
pl: Plik ten wyświetla różne statystyki pamięci wirtualnej.

source: I</proc/zoneinfo> (since Linux 2.6.13)
pl: I</proc/zoneinfo> (od wersji Linuksa 2.6.13)

source: This file display information about memory zones. This is useful for analyzing virtual memory behavior.
pl: Plik zawiera informacje o strefach pamięci. Może być przydatny podczas analizowania zachowania pamięci wirtualnej.

source: NOTES
pl: UWAGI

source: Many strings (i.e., the environment and command line) are in the internal format, with subfields terminated by null bytes (\(aq\e0\(aq), so you may find that things are more readable if you use I<od -c> or I<tr "\e000" "\en"> to read them. Alternatively, I<echo \`cat E<lt>fileE<gt>\`> works well.
pl: Wiele łańcuchów znakowych (np. środowisko czy linia poleceń) występuje w postaci wewnętrznej, z polami zakończonymi bajtami NUL (\(aq\e0\(aq), więc jeśli do ich czytania użyje się I<od -c> lub I<tr "\e000" "\en">, to mogą być bardziej czytelne. Alternatywnie, I<echo \`cat E<lt>plikE<gt>\`> działa równie dobrze.

source: This manual page is incomplete, possibly inaccurate, and is the kind of thing that needs to be updated very often.
pl: Ta strona podręcznika jest niekompletna, prawdopodobnie niedokładna i należy do tych, które powinny być bardzo często poprawiane.

source: SEE ALSO
pl: ZOBACZ TAKŻE

source: The kernel source files: I<Documentation/filesystems/proc.txt>, I<Documentation/sysctl/vm.txt>
pl: Pliki w źródłach jądra: I<Documentation/filesystems/proc.txt>, I<Documentation/sysctl/vm.txt>

source: COLOPHON
pl: O STRONIE

source: This page is part of release 3.40 of the Linux I<man-pages> project. A description of the project, and information about reporting bugs, can be found at http://www.kernel.org/doc/man-pages/.
pl: Ta strona jest częścią wydania 3.40 projektu I<man-pages> Linuksa. Opis projektu, informacje o zgłaszaniu błędów dostępne na stronie http://www.kernel.org/doc/man-pages/.
