Repository: eurolinux-enterprise-linux-sources/man-pages-pl
Catalog: src/po/man3/getutent.3.po
Languages: pl

source: Linux Programmer's Manual
pl: Podręcznik programisty Linuksa

source: NAME
pl: NAZWA

source: getutent, getutid, getutline, pututline, setutent, endutent, utmpname - access utmp file entries
pl: getutent, getutid, getutline, pututline, setutent, endutent, utmpname - dostęp do wpisów pliku utmp

source: SYNOPSIS
pl: SKŁADNIA

source: DESCRIPTION
pl: OPIS

source: New applications should use the POSIX.1-specified "utmpx" versions of these functions; see CONFORMING TO.
pl: Nowe aplikacje powinny używać podanych w standardzie POSIX.1 wersji "utmpx" tych funkcji, patrz rozdział "ZGODNE Z" poniżej.

source: B<utmpname>() sets the name of the utmp-format file for the other utmp functions to access. If B<utmpname>() is not used to set the filename before the other functions are used, they assume B<_PATH_UTMP>, as defined in I<E<lt>paths.hE<gt>>.
pl: B<utmpname>() ustawia nazwę pliku w formacie utmp, który będzie używany przez pozostałe funkcje utmp. Jeżeli nie użyto B<utmpname>() przed wywołaniem innych funkcji, to używają one domyślnej nazwy B<_PATH_UTMP>, zdefiniowanej w I<E<lt>paths.hE<gt>>.

source: B<setutent>() rewinds the file pointer to the beginning of the utmp file. It is generally a good idea to call it before any of the other functions.
pl: B<setutent>() przesuwa wskaźnik pliku z powrotem na początek pliku utmp. Funkcja ta powinna zostać wywołana przed wywołaniem którejkolwiek z pozostałych funkcji.

source: B<endutent>() closes the utmp file. It should be called when the user code is done accessing the file with the other functions.
pl: B<endutent>() zamyka plik utmp. Powinna być wywołana, gdy program już zakończył używanie tego pliku przy pomocy innych funkcji.

source: B<getutent>() reads a line from the current file position in the utmp file. It returns a pointer to a structure containing the fields of the line. The definition of this structure is shown in B<utmp>(5).
pl: B<getutent>() odczytuje linię z pliku utmp, zaczynając od bieżącej pozycji w tym pliku. Zwraca wskaźnik do struktury zawierającej pola linii. Definicję tej struktury opisano w B<utmp>(5).

source: B<getutid>() searches forward from the current file position in the utmp file based upon I<ut>. If I<ut-E<gt>ut_type> is one of B<RUN_LVL>, B<BOOT_TIME>, B<NEW_TIME>, or B<OLD_TIME>, B<getutid>() will find the first entry whose I<ut_type> field matches I<ut-E<gt>ut_type>. If I<ut-E<gt>ut_type> is one of B<INIT_PROCESS>, B<LOGIN_PROCESS>, B<USER_PROCESS>, or B<DEAD_PROCESS>, B<getutid>() will find the first entry whose I<ut_id> field matches I<ut-E<gt>ut_id>.
pl: B<getutid>() przeszukuje plik w przód, zaczynając od bieżącej pozycji, biorąc pod uwagę parametr I<ut>. Jeżeli I<ut-E<gt>ut_type> jest jednym z B<RUN_LVL>, B<BOOT_TIME>, B<NEW_TIME> lub B<OLD_TIME>, to B<getutid>() wyszuka pierwszy rekord, którego pole I<ut_type> odpowiada I<ut-E<gt>ut_type>. Jeżeli I<ut-E<gt>ut_type> jest jednym z B<INIT_PROCESS>, B<LOGIN_PROCESS>, B<USER_PROCESS> lub B<DEAD_PROCESS>, to B<getutid>() wyszuka pierwszy wpis, którego pole I<ut_id> pasuje do I<ut-E<gt>ut_id>.

source: B<getutline>() searches forward from the current file position in the utmp file. It scans entries whose I<ut_type> is B<USER_PROCESS> or B<LOGIN_PROCESS> and returns the first one whose I<ut_line> field matches I<ut-E<gt>ut_line>.
pl: B<getutline>() przeszukuje plik utmp w przód, zaczynając od bieżącej pozycji w pliku. Sprawdza wpisy, których I<ut_type> jest równe B<USER_PROCESS> lub B<LOGIN_PROCESS>, i zwraca pierwszy z nich, którego pole I<ut_line> odpowiada I<ut-E<gt>ut_line>.

source: B<pututline>() writes the I<utmp> structure I<ut> into the utmp file. It uses B<getutid>() to search for the proper place in the file to insert the new entry. If it cannot find an appropriate slot for I<ut>, B<pututline>() will append the new entry to the end of the file.
pl: B<pututline>() zapisuje strukturę I<ut>, której typem jest I<utmp>, do pliku utmp. Używa B<getutid>(), aby znaleźć odpowiednie miejsce do dodania nowego rekordu. Jeśli go nie znajdzie, to B<pututline>() doda nowy wpis na końcu pliku.

source: RETURN VALUE
pl: WARTOŚĆ ZWRACANA

source: B<getutent>(), B<getutid>(), and B<getutline>() return a pointer to a I<struct utmp> on success, and NULL on failure (which includes the "record not found" case). This I<struct utmp> is allocated in static storage, and may be overwritten by subsequent calls.
pl: Funkcje B<getutent>(), B<getutid>() i B<getutline>() zwracają wskaźnik do I<struct utmp>, jeśli zakończą się powodzeniem, lub NULL w razie wystąpienia błędu. I<struct utmp> jest zaalokowana w statycznej przestrzeni danych i może zostać nadpisana przez kolejne wywołania funkcji.

source: On success B<pututline>() returns I<ut>; on failure, it returns NULL.
pl: Funkcja B<pututline>() zwraca I<ut>, jeśli zakończy się powodzeniem, lub NULL w razie wystąpienia błędu.

source: B<utmpname>() returns 0 if the new name was successfully stored, or -1 on failure.
pl: B<utmpname>() zwraca 0, jeśli zachowano nową nazwę, lub -1 w przypadku błędu.

source: ERRORS
pl: BŁĘDY

source: Out of memory.
pl: Brak pamięci.

source: Record not found.
pl: Nie znaleziono rekordu.

source: B<setutent>(), B<pututline>(), and the B<getut* ()> functions can also fail for the reasons described in B<open>(2).
pl: Funkcje B<setutent>(), B<pututline>() i B<getut* ()> mogą także zwrócić błędy opisane w B<open>(2).

source: FILES
pl: PLIKI

source: /var/run/utmp database of currently logged-in users
pl: /var/run/utmp baza danych obecnie zalogowanych użytkowników

source: /var/log/wtmp database of past user logins
pl: /var/log/wtmp baza danych poprzednich logowań użytkowników

source: CONFORMING TO
pl: ZGODNE Z

source: In XPG2 and SVID 2 the function B<pututline>() is documented to return void, and that is what it does on many systems (AIX, HP-UX, Linux libc5). HP-UX introduces a new function B<_pututline>() with the prototype given above for B<pututline>() (also found in Linux libc5).
pl: W dokumentacji XPG2 i SVID2 funkcja B<pututline>() zwraca void, i to jest to, co ona rzeczywiście zwraca na wielu systemach (AIX, HPUX, Linux libc5). HPUX wprowadza nową funkcję B<_pututline>() o prototypie podanym powyżej dla B<pututline>() (funkcja ta znajduje się również w libc5 Linuksa).

source: All these functions are obsolete now on non-Linux systems. POSIX.1-2001, following SUSv1, does not have any of these functions, but instead uses
pl: Wszystkie te funkcje są przestarzałe na systemach nielinuksowych. POSIX.1-2001, naśladując SUSv1, nie zawiera żadnej z tych funkcji, ale zamiast nich używa

source: These functions are provided by glibc, and perform the same task as their equivalents without the "x", but use I<struct utmpx>, defined on Linux to be the same as I<struct utmp>. For completeness, glibc also provides B<utmpxname>(), although this function is not specified by POSIX.1.
pl: Powyższe funkcje są dostarczane przez glibc i wykonują dokładnie te same zadania, co ich odpowiedniki bez przyrostka "x", tyle że używają struktury I<struct utmpx>, zdefiniowanej pod Linuksem dokładnie tak samo jak I<struct utmp>. glibc dostarcza także B<utmpxname>(), chociaż POSIX.1 nie zawiera tej funkcji.

source: On some other systems, the I<utmpx> structure is a superset of the I<utmp> structure, with additional fields, and larger versions of the existing fields, and parallel files are maintained, often I</var/*/utmpx> and I</var/*/wtmpx>.
pl: Na niektórych systemach struktura I<utmpx> jest rozszerzeniem struktury I<utmp> o dodatkowe pola i o większe wersje istniejących pól. Utrzymywane są tam równoległe wersje plików, często jako I</var/*/utmpx> oraz I</var/*/wtmpx>.

source: Linux glibc on the other hand does not use a parallel I<utmpx> file since its I<utmp> structure is already large enough. The functions B<getutxent>() etc. are aliases for B<getutent>() etc.
pl: Z drugiej strony linuksowe glibc nie używa pliku I<utmpx>, ponieważ jego struktura I<utmp> jest już wystarczjąco duża. Funkcje B<getutxent> itp. są aliasami funkcji B<getutent> itp.

source: NOTES
pl: UWAGI

source: Glibc Notes
pl: Uwagi dotyczące biblioteki glibc

source: The above functions are not thread-safe. Glibc adds reentrant versions
pl: Powyższe funkcje nie są bezpieczne dla wątków. Glibc dodaje wersje współbieżne:

source: B<#define _GNU_SOURCE> /* or _SVID_SOURCE or _BSD_SOURCE; \& see B<feature_test_macros(7)> */ B<#include E<lt>utmp.hE<gt>>
pl: B<#define _GNU_SOURCE> /* lub _SVID_SOURCE, lub _BSD_SOURCE; \& patrz B<feature_test_macros(7)> */ B<#include E<lt>utmp.hE<gt>>

source: These functions are GNU extensions, analogs of the functions of the same name without the _r suffix. The I<ubuf> argument gives these functions a place to store their result. On success they return 0, and a pointer to the result is written in I<*ubufp>. On error these functions return -1. There are no utmpx equivalents of the above functions. (POSIX.1 does not specify such functions.)
pl: Te funkcje są rozszerzeniami GNU, analogicznymi do funkcji o tych samych nazwach, ale bez przyrostka "_r". Parametr I<ubuf> określa miejsce, w którym te funkcje powinny zapisać wynik. Jeśli zakończą się powodzeniem, to zwracają 0, a wskaźnik do wyniku jest zapisywany w I<*ubufp>. W razie błędu funkcje zwracają -1. Funkcje te nie mają swoich odpowiedników utmpx (POSIX.1 ich nie zawiera).

source: EXAMPLE
pl: PRZYKŁAD

source: The following example adds and removes a utmp record, assuming it is run from within a pseudo terminal. For usage in a real application, you should check the return values of B<getpwuid>(3) and B<ttyname>(3).
pl: Następujący przykład dodaje i usuwa rekord utmp, przy założeniu, że zostanie uruchomiony z pseudoterminalu. Użycie w rzeczywistej aplikacji wymagałoby sprawdzenia wartości zwracanych przez B<getpwuid>(3) i B<ttyname>(3).

source: system("echo before adding entry:;who");
pl: system("echo przed dodaniem wpisu:;who");

source: entry.ut_type = USER_PROCESS; entry.ut_pid = getpid(); strcpy(entry.ut_line, ttyname(STDIN_FILENO) + strlen("/dev/")); /* only correct for ptys named /dev/tty[pqr][0-9a-z] */ strcpy(entry.ut_id, ttyname(STDIN_FILENO) + strlen("/dev/tty")); time(&entry.ut_time); strcpy(entry.ut_user, getpwuid(getuid())-E<gt>pw_name); memset(entry.ut_host, 0, UT_HOSTSIZE); entry.ut_addr = 0; setutent(); pututline(&entry);
pl: entry.ut_type = USER_PROCESS; entry.ut_pid = getpid(); strcpy(entry.ut_line, ttyname(STDIN_FILENO) + strlen("/dev/")); /* poprawne tylko dla pseudoterminali nazwanych /dev/tty[pqr][0-9a-z] */ strcpy(entry.ut_id, ttyname(STDIN_FILENO) + strlen("/dev/tty")); time(&entry.ut_time); strcpy(entry.ut_user, getpwuid(getuid())-E<gt>pw_name); memset(entry.ut_host, 0, UT_HOSTSIZE); entry.ut_addr = 0; setutent(); pututline(&entry);

source: system("echo after adding entry:;who");
pl: system("echo po dodaniu wpisu:;who");

source: system("echo after removing entry:;who");
pl: system("echo po usunięciu wpisu:;who");

source: SEE ALSO
pl: ZOBACZ TAKŻE

source: COLOPHON
pl: O STRONIE

source: This page is part of release 3.40 of the Linux I<man-pages> project. A description of the project, and information about reporting bugs, can be found at http://www.kernel.org/doc/man-pages/.
pl: Angielska wersja tej strony pochodzi z wydania 3.40 projektu Linux I<man-pages>. Opis projektu oraz informacje dotyczące zgłaszania błędów można znaleźć pod adresem http://www.kernel.org/doc/man-pages/.
